{
  "grammar_point": "(っ)たって (hypothetical, futile)",
  "rank": 10,
  "dojg": {
    "grammar_point": "(っ)たって②",
    "description": "The contracted form of と言っても or としても.",
    "meaning": "Even if (someone says that); even if someone tries to; although",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "597",
    "examples": [
      {
        "japanese": "(ksa).一人でしよう(っ)たって、それは無理だ。",
        "english": "You'll never be able to do it alone! (literally: Even if you try to do it alone, that's impossible.)"
      },
      {
        "japanese": "(ksb).今すぐ買いに行く(っ)たって、もう店はみんな閉まっている。",
        "english": "Even if you wanted to go buy it right now, the stores are all already closed."
      },
      {
        "japanese": "(ksc).高い(っ)たって、１００万円はしないだろう。",
        "english": "Even though it's said to be expensive, my guess is it won't cost more than one million yen."
      },
      {
        "japanese": "(ksd).日本語教育の経験者(だ)ったって、彼女はまだ日本以外で教えたことはない。",
        "english": "Although she has experience teaching Japanese, she hasn't yet taught anywhere outside of Japan."
      },
      {
        "japanese": "(a).あの家は君が買おうったって買えるようなものじゃない。",
        "english": "That house is not something you could buy even if you wanted to."
      },
      {
        "japanese": "(b).僕を騙そうったってそうはいかない。",
        "english": "It won't work if you try to cheat me."
      },
      {
        "japanese": "(c).彼が何を言おうったってそれをとめようとは思わない。",
        "english": "Whatever he may want to say, I don't think I'll stop it."
      },
      {
        "japanese": "(d).今から帰るったってもう電車はないよ。",
        "english": "There are no more trains even if (you say) you want to go home  now."
      },
      {
        "japanese": "(e).調べるったって、こんなたくさんある資料を一人で調べるのは無理だ。",
        "english": "Even if you say you'll look through the materials, it's  impossible for you to do it alone because there are so many."
      },
      {
        "japanese": "(f).近いったってとても歩いて行ける距離じゃない。",
        "english": "Although (I say) it's close, it's not a distance you can walk  at all."
      },
      {
        "japanese": "(g).いくら簡単ったって、やっぱり最低限のパソコン知識がなくては使えない。",
        "english": "No matter how simple (they say) it is, in fact you won't be  able to use it without a minimum knowledge of computers."
      },
      {
        "japanese": "(h).「断食」ったって、全く何も口に入れないんじゃない。1日に2回、野菜ジュースを飲むことはできる。",
        "english": "Although I say \"fasting,\" it's not like you can't put anything  in your mouth. You can drink vegetable juice twice a day."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Vvolitional\n- (っ)たって\n- 飲もう(っ)たって\n- Even if you try to drink\n- (ii)Vinformal\n- (っ)たって\n- 飲む(っ)たって\n- Even if you say you will drink\n- 飲んだったって\n- Even if you say you drank\n- (iii)Adjectiveいinformal\n- (っ)たって\n- 高い(っ)たって\n- Even if you say something is expensive\n- 高かったったって\n- Even if you say something was expensive\n- (iv){Adjectiveなstem/Noun}\n- {∅/だ/だった}ったって\n- 便利{∅/だ/だった}ったって\n- Even if you say something is/was convenient\n- 学生{∅/だ/だった}ったって\n- Even if you say someone is/was a student",
    "part_of_speech": "Phrase (usually used in conversation)",
    "related": "【Related Expression: ようにも(~ない)】",
    "antonym": "",
    "source": "resources/original/dojg/all/(っ)たって②.yaml"
  }
}