{
  "grammar_point": "Noun+を〜に任せる",
  "rank": 6,
  "bunpro": {
    "grammar_point": "〜を〜に任せる",
    "jlpt": "N2",
    "meaning": "Leave 〜 up to, Entrust 〜 to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "(A) を (B) に任せるis a structure used to highlight that something is being 'entrusted' or 'left up to (B). This can be thought of as a standard function of the る-Verb任せる 'to entrust'.In(A) を (B) に任せるsentences, (A) を will identify the task, while (B) に will identify the person or thing that (A) is being left up to.Fun-fact - Although this expression often highlights people that some task is being left up to, it is also frequently used when some eventuation or result is being left up to chance or fate.",
    "examples": [
      {
        "japanese": "私は忙しいから、あなたにペットの世話を任せてもいい?",
        "english": "Is it alright if I trust you to take care of my pet since I'm busy?"
      },
      {
        "japanese": "先月入社して来たばかりの新人くんにあの重要なプレゼンを任せたの?",
        "english": "You entrusted that important presentation to a newcomer who just joined the company last month?"
      },
      {
        "japanese": "彼女と付き合えるかどうかを神様に任せる。",
        "english": "I'm going to leave it to God to decide if I can go out with her or not."
      },
      {
        "japanese": "あの会社に入れるかどうかは運に任せる。",
        "english": "I'll leave it to luck if I can join that company or not."
      },
      {
        "japanese": "大切な発表をいつも彼に任せる。",
        "english": "I always leave the important presentations up to him."
      },
      {
        "japanese": "研修生に掃除を任せます。",
        "english": "I will leave the cleaning up to the trainee."
      },
      {
        "japanese": "奇跡が起こるかどうかを神様に任せる。",
        "english": "Whether or not a miracle happens I will leave up to the gods."
      },
      {
        "japanese": "案内状の宛名書きを新入社員に任せてみた。",
        "english": "I tried entrusting writing the address on the invitation to the new employee."
      },
      {
        "japanese": "アンテナの修理を息子に任せた。",
        "english": "I entrusted repairing the antenna to my son."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/を-に任せる",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-793"
  }
}