{
  "grammar_point": "Noun+であれ+Noun+であれ",
  "rank": 10,
  "dojg": {
    "grammar_point": "〜であれ〜であれ",
    "description": "A structure that means “no matter which one is the case”",
    "meaning": "Whether X or Y; be it X or Y; or",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "71",
    "examples": [
      {
        "japanese": "(ksa).男性であれ、女性であれ、人間としての権利は同じはずだ。",
        "english": "Whether one is a man or a woman, one's rights as a human being  should be the same."
      },
      {
        "japanese": "(ksb).有名であれ、無名であれ、人生は短い。",
        "english": "No matter if one is famous or nameless, life is short."
      },
      {
        "japanese": "(a).ここは春であれ秋であれ美しいから観光に向いている。",
        "english": "Whether spring or fall, this place is beautiful, so it is a  good sightseeing spot."
      },
      {
        "japanese": "(b).イスラエル人であれ、パレスチナ人であれ、平和を望んでいることでは同じはずだ。",
        "english": "Whether an Israeli or a Palestinian, their hope for peace  should be the same."
      },
      {
        "japanese": "(c).彼は和食であれ、洋食であれ、何でも食べてしまう。",
        "english": "He eats anything, Japanese- or Western-style food."
      },
      {
        "japanese": "(d).あの学者は哲学であれ、言語学であれ、人類学であれ、同じように精通している。",
        "english": "That scholar is well-versed in a number of subjects, whether it  be philosophy, linguistics or anthropology."
      },
      {
        "japanese": "(e).平日であれ、週末であれ、健太は仕事に追われている。",
        "english": "Whether weekday or weekend, Kenta is always pressed by work."
      },
      {
        "japanese": "(f).写真であれ、コンピュータグラフィックスであれ、求められたイメージを表現するのは大変難しい。",
        "english": "Whether in photography or in computer graphics, it is hard to  produce an image as requested."
      },
      {
        "japanese": "(g).場所が便利であれ、不便であれ、マイホームが持ちたい。",
        "english": "Whether the location is convenient or inconvenient, I'd like to  have my own house."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun1\n- であれ、Noun2であれ\n- 夏であれ、冬であれ\n- Whether it is summer or winter\n- (ii)Adjective な1 stem\n- であれ、Adjective な2 stemであれ\n- 便利であれ、不便であれ\n- Whether something is convenient or inconvenient",
    "part_of_speech": "Structure (usually used in formal writing and formal speech)",
    "related": "【Related Expression: であろうと~であろうと; でも~でも; と言わず~と言わず】",
    "antonym": "",
    "source": "resources/original/dojg/all/～であれ～であれ.yaml"
  }
}