{
  "grammar_point": "Number+しか〜ない",
  "rank": 2,
  "bunpro": {
    "grammar_point": "Number+しか〜ない",
    "jlpt": "N4",
    "meaning": "No more than, Not exceeding, As few as・as little as, Only",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Theadverbial particleしかis often compared toだけ, in that it also expresses 'only'. However, unlikeだけ,しかcan only be used innegative statements. Due to this,しか〜ないis regularly translated as 'there's only (A)', or 'there's nothing but (A)'.しか〜ないmay be used to express numbers, or nouns. In this lesson we will examine numbers.To use this construction, the number that you want to express as being 'all that exists' will go beforeしか, thenしかwill be followed by a verb in its ない, or ありません form.Fun FactThe main difference betweenしかandだけ, is thatだけsuggests that (A) was 'chosen' from among a group where several other choices exist.しかon the other hand, implies that there are no other choices, and (A) is the only possibility/thing that exists.",
    "examples": [
      {
        "japanese": "今日は5キロしか走れない。",
        "english": "I can only run 5 km today."
      },
      {
        "japanese": "今日は100円しか持っていない。",
        "english": "I have nothing but 100 yen on me."
      },
      {
        "japanese": "今日はたくさんの宿題があるから2時間しか遊べない。",
        "english": "I have a lot of homework today, so I can only hang out for 2 hours."
      },
      {
        "japanese": "冷蔵庫の中には色々な物が入っていたけど、リンゴだけを取り出した。",
        "english": "There were a lot of things in the refrigerator, but I just took out an apple."
      },
      {
        "japanese": "冷蔵庫の中にはリンゴしかなかったから、リンゴを食べた。",
        "english": "Apples were all that was in the refrigerator, so I ate an apple."
      },
      {
        "japanese": "お金持ちなのに現金は1000円しか持っていない。",
        "english": "Even though (they) are rich, (they) have no more than 1000 yen in cash."
      },
      {
        "japanese": "彼女にはまだ1回しか会っていない。",
        "english": "I have met her no more than once."
      },
      {
        "japanese": "計画書は1枚しか提出出来ない。",
        "english": "You can submit only one plan."
      },
      {
        "japanese": "髪の毛が3本しか生えていない。",
        "english": "He has no more than three hairs on his head."
      },
      {
        "japanese": "一ヶ月しか期間がないのに、あなたは変われるの?",
        "english": "You only have (the period of) one month. Can you change?"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/number-しか-ない",
    "false_friends": [
      {
        "term": "しか〜ない",
        "meaning": "There's only, Nothing but",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-19"
  }
}