{
  "grammar_point": "Verb[dictionary]+までだ",
  "rank": 8,
  "bunpro": {
    "grammar_point": "〜るまでだ",
    "jlpt": "N1",
    "meaning": "Just, Merely, Simply, Only",
    "meaning_warning": "Remember that までだ might simply mean \"until\" especially if there is no conditional/following period 「期限今月末までだ」",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "までだ, and までのことだ are structures that are usually translated as 'merely (B)', or 'simply (B)'. However, they are almost always used in somewhat hypothetical sentences, and translate much closer to 'one can only but (B)'. This nuance indicates a sense of resignation, or understanding on the part of the speaker that they personally have no options beyond (B).This grammar pattern will be used following verbs in theirdictionary form, and will often come at the end of a sentence that uses なら in the first clause. In this way, it will mean 'if (A), then (B) is all that can be done'. (A) will almost always be a negative situation.Examining the standard meaning of the particle まで as signifying an extent, it can be seen that this meaning is kept in までだ, with the speaker expressing that (B) is the extent of what is possible given the negative circumstances brought about by (A).",
    "examples": [
      {
        "japanese": "誰にも教えてもらえないなら、ネットで調べてみるまでだ。",
        "english": "If no one is going to teach me, I will just search it online."
      },
      {
        "japanese": "もし失敗したのなら、もう一回挑戦するまでだ。失敗しても諦めないことが大切だ。",
        "english": "If you made a mistake, you just have to try again. It is important to not give up even if you fail."
      },
      {
        "japanese": "誰も迎えにきてくれないのなら、電車で帰るまでのことだ。",
        "english": "If no one is going to come pick me up, I will simply go home by train."
      },
      {
        "japanese": "この会社に入社できなかったら、別の会社を探すまでのことです。",
        "english": "If I can't join this company, I will simply look for a different one."
      },
      {
        "japanese": "もしJLPTに落ちたら、もう一度試してみるまでのことだ。",
        "english": "If I fail the JLPT, I will simply try it once again."
      },
      {
        "japanese": "電車に乗り遅れたら、次のを待つまでのことだ。",
        "english": "If I miss the train, I will simply wait for the next one."
      },
      {
        "japanese": "祖国で就職できなかったら、外国へ移住することになるまでだ。",
        "english": "If I can't find work in my motherland, I will simply move abroad."
      },
      {
        "japanese": "夫婦の話：「やめなくちゃならないというなら、やめるまでのことだ。」",
        "english": "A conversation between a couple: 'If you say I have to quit, then I will simply quit.'"
      },
      {
        "japanese": "「問題が起きても、かいけつするまでだよ。」",
        "english": "'If a problem arises, I will just solve it.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/〜るまでだ",
    "false_friends": [
      {
        "term": "〜たまでだ",
        "meaning": "Just, Merely, Simply, Only",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-926"
  }
}