{
  "grammar_point": "Verb[れる・られる]~ままに",
  "rank": 8,
  "bunpro": {
    "grammar_point": "れる・られる+ままに",
    "jlpt": "N1",
    "meaning": "Do as (one is told or ordered…), In accordance with, In compliance with, Just like",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "When paired with まま, anounmeaning 'in the state of', and thecase marking particleに, theauxiliary verbsれる and られる indicate something being done 'as one is told', or 'as ordered'. Because of this, れる and られる will almost always be paired with verbs that indicate some kind of communication.As these structures are in the passive, the literal translation is close to 'to do (B) in the state that (A) was done to me'. The (B) part will come directly after ままに and simply states how someone is going to react in compliance with (A).Theconjunction particleが may appear between られる and ままに, but this is not common in modern Japanese. Although it does carry the meaning of 'but', the focus is more on expressing that the (A) is not being resisted or argued with when doing (B).CautionIn this grammar pattern, られる will never appear in the past-tense form.",
    "examples": [
      {
        "japanese": "私は先輩に言われるままにしただけですよ。",
        "english": "I only did things as I was told by senpai."
      },
      {
        "japanese": "日本では上司に命じられるままに仕事をしている人が多い。",
        "english": "In Japan, many people work as ordered by their bosses."
      },
      {
        "japanese": "警察に聞かれるままに、仲間の名前を教えた。",
        "english": "I gave the names of my accomplices to the police as they asked me."
      },
      {
        "japanese": "婚活アプリで出会った人に言われるがままに、ギフトカードを買ってしまった。",
        "english": "I did as I was told by someone I met on a dating app and bought a gift card."
      },
      {
        "japanese": "先生に教えられたままに漢字を書いた。",
        "english": "I wrote kanji characters as my teacher taught me. (Unnatural Japanese)"
      },
      {
        "japanese": "先生におしえられるままに、生徒はその発音を繰り返した。",
        "english": "The students repeated the pronunciation just like they were taught by the teacher."
      },
      {
        "japanese": "きかれるままに、彼女の住んでいる場所を教えた。",
        "english": "I told him where she lives, just like I was asked."
      },
      {
        "japanese": "店員さんにすすめられるまま、この洋服を買ってしまった。でも、あまり自分には似合わないと思う。",
        "english": "I bought these clothes as advised by the shop clerk. But I don't think that they suit me very well."
      },
      {
        "japanese": "強盗に要求されるまま、金をわたした。",
        "english": "I handed over the money as demanded by the robber."
      },
      {
        "japanese": "ガイドに案内されるまま、私たちはパリ市内を観光した。",
        "english": "We explored the city of Paris as guided by the guide."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/verb-passive-ままに",
    "false_friends": [
      {
        "term": "Verb[れる・られる]",
        "meaning": "Was done to ~ by ~, Done without consent, Done to one's dismay",
        "kind": "synonym"
      },
      {
        "term": "ままに (as desired)",
        "meaning": "As is, While remaining, Left in a state",
        "kind": "synonym"
      },
      {
        "term": "にしたがって",
        "meaning": "As, Following, As then, According to, In accordance with",
        "kind": "synonym"
      },
      {
        "term": "に沿って",
        "meaning": "Along, In accordance with, In line with",
        "kind": "synonym"
      },
      {
        "term": "とおり",
        "meaning": "In that way, Exactly, Precisely, Just as",
        "kind": "synonym"
      },
      {
        "term": "ように",
        "meaning": "So that, In order to, In such a way that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-27"
  }
}