{
  "grammar_point": "Verb[た]+までだ",
  "rank": 8,
  "bunpro": {
    "grammar_point": "〜たまでだ",
    "jlpt": "N1",
    "meaning": "Just, Merely, Simply, Only",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "In comparison to 〜るまでだ, the grammar pattern expressing that 'one can only but (A)',〜たまでだworks in a similar way, with the past tense of the verb indicating that 'doing (A) was all it was'. This emphasis is usually translated as 'I simply (A)', or 'I only (A)', with nuance on the action not being something especially big.Like 〜るまでだ,〜たまでだmay be replaced with 〜たまでのことだ, depending on what the speaker is trying to emphasize.As this structure emphasizes that (A) is not a big deal, it will often be used in order to modestly highlight that one only did the bare minimum, and therefore praising them is unnecessary.CautionBoth 〜るまでだ and〜たまでだare only used in reference to one's own personal actions, or the actions of a group they are affiliated with.",
    "examples": [
      {
        "japanese": "なんで俺が悪者扱いされないといけないんだ?俺はただ自分の意見を言ったまでだ。",
        "english": "Why do I have to get blamed for this? I only expressed my opinions."
      },
      {
        "japanese": "お婆さんが困った顔をしていたから、助けたまでだ。",
        "english": "I just helped because the old lady looked like she needed help."
      },
      {
        "japanese": "最近学校にも行かないし部屋からも出ないから、聞いたまでのことだ。",
        "english": "I merely asked because recently, you haven't left your room and haven't gone to school."
      },
      {
        "japanese": "そんなお礼とかはやめてください、人として当たり前のことをしたまでです。",
        "english": "Please, don't thank me. I just did something expected as a human."
      },
      {
        "japanese": "彼は私が困っていたから、助けてくれたまでだ。",
        "english": "Because I looked like I was in need, he merely helped me. (Unnatural Japanese)"
      },
      {
        "japanese": "A：「助けてくれてありがとうございます！」B：「いや、当然のことをしたまでのことです。」",
        "english": "A: 'Thank you very much for helping me!' B: 'Not at all. It was just the obvious thing.'"
      },
      {
        "japanese": "なんで怒っているの?私の意見を言ったまでのことだ。",
        "english": "Why are you angry? I merely stated my opinion."
      },
      {
        "japanese": "A：「わぁ、日本語上手だね！」B：「ただ趣味で勉強してたまでのことで、まだまだだけどね。」",
        "english": "A: 'Wow, your Japanese is good!'B: 'I was merely learning it as a hobby. I still have a ways to go.'"
      },
      {
        "japanese": "僕はただ伝言を頼まれたから伝えたまでで、それは僕の考えではないからね！",
        "english": "Since I was just requested to have a word with you, that's merely all I did, it's not like they were my thoughts."
      },
      {
        "japanese": "真実を話したまでのことなのに、なぜかクラスメイトから嘘つきと言われてしまいました。",
        "english": "When I just told the truth, I was accused by my classmate of being a liar for some reason."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たまでだ",
    "false_friends": [
      {
        "term": "〜るまでだ",
        "meaning": "Just, Merely, Simply, Only",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-279"
  }
}