{
  "grammar_point": "あわよくば",
  "rank": 10,
  "bunpro": {
    "grammar_point": "あわよくば",
    "jlpt": "N0",
    "meaning": "If luck is on my side, If the time is right, If possible, all going well",
    "meaning_warning": null,
    "details": {
      "Get more example sentences!": "Premium users get access to 12 example sentences on all Grammar Points."
    },
    "writeup": "あわよくば is a combination of the old-fashioned い-Adjective あわよい 'convenient', 'timely', and the conjunction particle ば 'if'. It can be translated as 'if the time is right', 'if possible', or 'if luck is on my side'. Despite its roots, あわよくば is treated as a single word in modern Japanese, and is used in the same way as a typical adverb.あわよくば will come before a phrase expressing a desirable outcome.Fun FactNotice that ば attaches to the く form of the い-Adjective あわよい rather than けれ, as would usually be required with modern conjugation rules. This is due to the conjugation rules for ば in relation to い-Adjectives being different in both classical and modern Japanese.",
    "examples": [
      {
        "japanese": "競馬で勝って、あわよくば大金持ちになるぞ。",
        "english": "If you win at the horse races, if you're lucky you'll become really rich!"
      },
      {
        "japanese": "議員：「あわよくばトップで当選したい。」",
        "english": "Member of congress: 'If possible, I want to get elected to the top spot.'"
      },
      {
        "japanese": "あわよくばミスコンで優勝したいと思っている。",
        "english": "If luck is on my side, I am thinking that I would like to be the grand champion in the beauty pageant."
      },
      {
        "japanese": "この詐欺が成功したらあわよくば裕福になれる。",
        "english": "If we succeed with this scam, all going well we'll be able to become wealthy."
      },
      {
        "japanese": "会社の業績が上がった。あわよくば僕の給料も上がるかも。",
        "english": "Our company performance improved. If I'm lucky my salary will improve too."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/あわよくば",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-56"
  }
}