{
  "grammar_point": "あっての",
  "rank": 8,
  "bunpro": {
    "grammar_point": "あっての",
    "jlpt": "N1",
    "meaning": "Exist only because of or due to, Owe everything to",
    "meaning_warning": "が is usually omitted",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "あってのis a pattern which emphasizes that (B) is something that only exists because of (A). It will often be translated as '(B) owes everything to (A)', or '(B) existing is only due to (A)'. This structure is a combination of the う-Verb ある 'to be' in its て-form, and the case-marking particle の.あってのwill be preceded and followed directly by nouns, where the first noun is (A), and the second noun is (B).あってのwill primarily be used when (B) is something that benefits positively from (A), and therefore is showing or should show some kind of gratitude toward it.Occasionally, the case-marking particle が will come between the (A) noun andあっての. However, it is often omitted.Fun Factあってのcan be thought of as an evolution of the basic grammar structure がある 'to have'. The main difference being that の allows (B) to be marked as the thing that has (A), while the て-form indicates that there is more information that will be given later about why this is important. Due to this information that comes later being important, (B) will almost always be followed by structures like から, or ので.",
    "examples": [
      {
        "japanese": "お客様あっての仕事だと思うのですが、理不尽なクレームを言われるとちょっとイラっときます。",
        "english": "My job only exists because of the customers, but I get a little annoyed when people make unreasonable complaints."
      },
      {
        "japanese": "今回は皆様の努力あっての結果です。皆様本当にありがとうございました。",
        "english": "This time, the results are because of your efforts. Thank you very much."
      },
      {
        "japanese": "私はお金がなかったら愛もない、お金があっての幸せだと思います。",
        "english": "I think that love exists only because of money, and without money there is no love."
      },
      {
        "japanese": "「あなたあってのわたしです。あなたがいなければ私の人生は無意味ですよ。」",
        "english": "'I can only exist because of you. My life would be meaningless without you.' (owe everything to)"
      },
      {
        "japanese": "彼が大学をやめるのは、何か理由があってのことだろう。",
        "english": "I guess he is dropping out of university only because some sort of reason exists."
      },
      {
        "japanese": "支配人、社員に：「ゲストあっての遊園地だということを忘れてはいけません。」",
        "english": "Manager to employees: 'You must not forget that the amusement park exists only because of the customers.'"
      },
      {
        "japanese": "ベストセラー作者の演説：「 私の本は、家族の支えあってのものです。息子と夫がいなければここまでやってこれなかったと思います。」",
        "english": "Best Selling author's speech: 'My books exist only because of the support from my family. I believe, if it was not for my son and husband, I would not have gotten this far.' (owe everything to)"
      },
      {
        "japanese": "切手のコレクションが火事で全焼して悲しいのは分かっているけどさ、生きて逃げられたのは何よりだよ。「命あっての物種」だね。",
        "english": "I understand that you are sad because your stamp collection was destroyed in the fire, but getting out of there with your life is more important than anything. 'While there is life, there is hope,' right? (only exist because of)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/あっての",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-47"
  }
}