{
  "grammar_point": "および",
  "rank": 6,
  "bunpro": {
    "grammar_point": "および",
    "jlpt": "N2",
    "meaning": "And, As well as",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "及びis a word that functions as a conjunction meaning 'and' or 'as well as', but is originally the conjunctive form of及ぶ, an う-Verb meaning 'to reach (A)', or 'to extend to (A)'. Although it is frequently translated simply as 'and',及びis a grammar pattern that more literally reflects the meaning of the base verb 'to extend to (A)'.Being a conjunction,及びwill primarily appear at the beginning of a second clause of a sentence, or directly following a noun that something else is 'in addition to'.As及びis considered a formal structure, it will primarily appear in documents, articles, and notifications.",
    "examples": [
      {
        "japanese": "免許書及び印鑑を持ってきてください。",
        "english": "Please bring your driver's license and seal."
      },
      {
        "japanese": "学校説明会に参加されたい方、及び体験入学をされたい方は8時から5時の間にこちらの電話番号までお電話をください。",
        "english": "If you would like to participate in a school information session and enroll in a trial lesson, please call this number between 8:00 a.m. and 5:00 p.m."
      },
      {
        "japanese": "夕食及び朝食は別料金になります。",
        "english": "Dinner and breakfast are charged separately."
      },
      {
        "japanese": "帽子及びメガネは外してください。",
        "english": "Hats and glasses must be removed."
      },
      {
        "japanese": "当店の定休日は月曜日及び水曜日となっています。",
        "english": "We are closed on Mondays as well as Wednesdays."
      },
      {
        "japanese": "お知らせ：「大学生のための職探し、及び起業に関するセミナー。」",
        "english": "Notification: 'Seminar about job-hunting and starting a business for university students.'"
      },
      {
        "japanese": "顧客サポート及び払戻に関する事項。",
        "english": "Matters related to refunds and customer support."
      },
      {
        "japanese": "憲法から：「国家は良心の自由及び信教の自由を保証すること。」",
        "english": "From the constitution: 'The state guarantees freedom of conscience and religious liberty.'"
      },
      {
        "japanese": "手帳及び日記等を見せてください。",
        "english": "Please show me things like your notebook and your diary."
      },
      {
        "japanese": "旅館及びホテルへの連絡はご遠慮ください。",
        "english": "Please refrain from contacting the Ryokan as well as the hotel."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/および",
    "false_friends": [
      {
        "term": "や",
        "meaning": "Things like, And the like",
        "kind": "synonym"
      },
      {
        "term": "と (quotation)",
        "meaning": "And",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-90"
  }
}