{
  "grammar_point": "およそ・おおよそ",
  "rank": 8,
  "bunpro": {
    "grammar_point": "おおよそ",
    "jlpt": "N2",
    "meaning": "Approximately, Roughly, About",
    "meaning_warning": null,
    "details": {
      "Get more example sentences!": "Premium users get access to 12 example sentences on all Grammar Points."
    },
    "writeup": "およそ or おおよそ, alternatively written as either凡そ or大凡is an adverb that commonly translates as 'approximately' or 'roughly' in English. It is primarily used in slightly more formal contexts, and can frequently be heard over announcements.As おおよそ is an adverb that is used in relation to time or distance more than anything else, it will usually be positioned at the beginning of sentences.Fun-fact - The kanji 凡 itself has the meaning of 'commonplace' and may also be translated as 'as a rule'. This just indicates that (A) is something that largely applies, but is not the case 100% of the time.",
    "examples": [
      {
        "japanese": "この物件から最寄りの駅までは徒歩でおよそ10分かかります。",
        "english": "It takes approximately 10 minutes to walk to the nearest train station from this property."
      },
      {
        "japanese": "私はおおよそ理解したけど、周りの子達はポカーンとした表情で先生を見ていた。",
        "english": "I understood most of it, but the people around me were looking at the teacher with a blank stare."
      },
      {
        "japanese": "美術館では、凡そ高価な作品を展示している。",
        "english": "As a rule, museums display expensive pieces."
      },
      {
        "japanese": "まずは計画のおおよそを説明しよう。",
        "english": "To start with, let's roughly explain the plan."
      },
      {
        "japanese": "地震による犠牲者はおおよそ百二十人です。",
        "english": "There are approximately 120 victims as a result of the earthquake."
      },
      {
        "japanese": "私の家から実家までおよそ十キロ離れている。",
        "english": "My house is separated from my family home by approximately 10 kilometers."
      },
      {
        "japanese": "およその見積もりを立ててから詳細をつめる。",
        "english": "Let's hammer out the details after setting up a rough approximation."
      },
      {
        "japanese": "パーティーにくるおおよその人数を把握する。",
        "english": "To figure out roughly how many people will come to the party."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/おおよそ",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-85"
  },
  "dojg": {
    "grammar_point": "およそ",
    "description": "An adverb representing the ideas “all; totally; mostly; approximately”.",
    "meaning": "Generally; commonly; all; quite entirely; totally; utterly; (not) at all; for the most part; mostly; almost; approximately; roughly; about; rough; general",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "526",
    "examples": [
      {
        "japanese": "(ksa).私はおよそ名作と言われている映画はすべて見ているつもりだ。",
        "english": "I'm convinced that I've watched all the movies that are  commonly considered masterpieces."
      },
      {
        "japanese": "(ksb).彼女はこういう根気のいる仕事にはおよそ向いていない。",
        "english": "She is not at all suited for work that requires perseverance  like this work does."
      },
      {
        "japanese": "(ksc).彼の考えていることはおよそ想像がつく。",
        "english": "I can make a fairly good guess about what he's thinking."
      },
      {
        "japanese": "(ksd).その学会にはおよそ１５００人の会員がいる。",
        "english": "That academic association has approximately 1,500 members."
      },
      {
        "japanese": "(a).およそ楽をして得られる技能で身につくものはない。",
        "english": "Generally, none of the skills you can learn easily will become  second nature."
      },
      {
        "japanese": "(b).およそ天才と言われる人は誰でも人には知れない重荷を背負っているものだ。",
        "english": "Generally, anyone who is called a genius carries a heavy burden  others can't see."
      },
      {
        "japanese": "(c).我々はおよそ不合理なこの制度に長い間縛られている。",
        "english": "We've been bound by this utterly irrational system for a long  time."
      },
      {
        "japanese": "(d).田宮先生は大学の政治的なことにはおよそ縁遠い人だった。",
        "english": "Professor Tamiya was totally removed from university politics."
      },
      {
        "japanese": "(e).彼には気の毒だが、彼の努力はおよそ意味のないものだった。",
        "english": "I'm sorry for him, but his effort was totally meaningless."
      },
      {
        "japanese": "(f).それは彼の普段の言動からはおよそ想像できない行動であった。",
        "english": "It was behaviour we couldn't even have imagined based on what  he usually said and did."
      },
      {
        "japanese": "(g).仕事は午前中でおよそ片づいたので今日は早く帰れそうだ。",
        "english": "I ﬁnished most of my work this morning, so it looks like I can  go home early today."
      },
      {
        "japanese": "(h).その大学のおよその情報はインターネットで得られる。",
        "english": "Most of the information on that university can be obtained via  the Internet."
      },
      {
        "japanese": "(i).この会社の年間取引額はおよそどのくらいですか。",
        "english": "Approximately what is the volume of this company's annual  business?"
      },
      {
        "japanese": "(j).現在中国に生息するジャイアントパンダの数はおよそ１千頭ということだ。",
        "english": "They say there are about 1,000 giant pandas living in China  now."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)およそ\n- Nounは\n- Where Adjective(い/な) has a negative meaning\n- およそ優れた研究者は\n- excellent researchers in general; all excellent researchers\n- (ii)およそ\n- Adjective(い/な)\n- およそつまらない\n- Quite boring\n- およそ不可能だ\n- Totally impossible\n- (iii)およそ\n- {Vnegative/Adjectiveいstemく/Adjectiveなstemで}ない\n- およそ向いていない\n- Someone is not at all suited for something\n- およそ面白くない\n- Something is not at all interesting\n- およそ経済的でない\n- Something is not economical at all\n- (iv)およそ\n- {V/Adjective(い/な}/Nounだ}\n- およそ分かる\n- Someone understands almost everything\n- およそ正しい\n- Something/someone is about right\n- およそ完成だ\n- Something is almost complete\n- (v)およそ\n- のNoun\n- およそ考え\n- A general idea\n- およそ見積もり\n- A rough estimate\n- (vi)およそ\n- Number(+Counter)\n- およそ十万人\n- Approximately 100,000 people",
    "part_of_speech": "Adverb (usually used in formal writing and formal speech)",
    "related": "【Related Expression: 一般に; 全く; まるで; 大体; おおむね】",
    "antonym": "",
    "source": "resources/original/dojg/all/およそ.yaml"
  }
}