{
  "grammar_point": "お〜する",
  "rank": 1,
  "bunpro": {
    "grammar_point": "お〜する",
    "jlpt": "N4",
    "meaning": "Humble verb form, used when the speaker performs an action for someone of higher status.",
    "meaning_warning": null,
    "details": {
      "Register": "Polite",
      "使用域": "敬語"
    },
    "writeup": "お〜するcomes from a form of polite speech in Japanese calledhumble speech. This type of speech is used to refer to the speaker and their actions. This is opposed tohonorific language, which refers exclusively to the listener and their actions.お〜するis almost exactly the same asお〜になる, as in it simply meansする.お〜するis regularly used with words of Japanese origin, whileご〜するwill be used with words of Chinese origin. Theするin this compound will attach directly to the ます stem of almost any verb.CautionWhile theするin this structure will attach directly to the ます stem of verbs, this does not mean that verbs that are alreadyするverbs will become しする. In the case ofするverbs, simply change theprefixto ご.In rare cases, お may be used instead of ご, when attached to words of Chinese origin. There is no specific rule for this, and they must be memorized on a case by case basis.Thankfully, the words of Chinese origin that use お instead of ご are extremely common verbs. This means that you will be exposed to almost all of them very quickly. All others may be assumed to use ご.Fun FactIn the same way thatお〜になるis a more common variation ofなさる(bothhonorific language),お〜するis a more common variation ofいたす(bothhumble speech).",
    "examples": [
      {
        "japanese": "僕がお守りします！",
        "english": "I am going to protect you!"
      },
      {
        "japanese": "今すぐにご確認します。",
        "english": "I will check right now."
      },
      {
        "japanese": "ご登録する方はこちらをクリックしてください。",
        "english": "For those who want to register, please click here."
      },
      {
        "japanese": "ご注文する時はこちらのベルを押してください。",
        "english": "When you are going to order, please press this bell."
      },
      {
        "japanese": "先輩にお電話するのがすきです。",
        "english": "I like to call my senpai."
      },
      {
        "japanese": "友達とお勉強するのは楽しいです。",
        "english": "It is fun to study with my friends."
      },
      {
        "japanese": "5分後にお電話します。",
        "english": "After 5 minutes, I will call you. (I will call you in five minutes)"
      },
      {
        "japanese": "5分後にお電話いたします。",
        "english": "After 5 minutes, I will call you. (I will call you in five minutes)"
      },
      {
        "japanese": "ドアをお閉めします。",
        "english": "I (will) humbly close the door."
      },
      {
        "japanese": "友達のお母さんにパソコンをお借りしました。",
        "english": "I humbly borrowed a computer from my friend's mother."
      },
      {
        "japanese": "お任せします。",
        "english": "I will humbly leave it up to you."
      },
      {
        "japanese": "先生をお呼びしてもよろしいでしょうか?",
        "english": "May I humbly call upon the teacher?"
      },
      {
        "japanese": "先生の分もお取りします。",
        "english": "I will humbly take the teacher's share."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/お-する",
    "false_friends": [
      {
        "term": "いたす",
        "meaning": "To do (Humble)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-82"
  },
  "dojg": {
    "grammar_point": "お〜する",
    "description": "A phrase which humbly expresses the speaker’s politeness to someone when describing the speaker’s action or state that involves or affects that person.",
    "meaning": "Humble verb form, used when the speaker performs an action for someone of higher status.",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "360",
    "examples": [
      {
        "japanese": "(a).私は先生のスーツケースをお持ちした・しました。",
        "english": "I carried my teacher's suitcase."
      },
      {
        "japanese": "(b).そのことは私がお話ししましょう。",
        "english": "I will tell you about that matter."
      },
      {
        "japanese": "(c).山村君は先生に本をお借りした。",
        "english": "Mr. Yamamura borrowed a book from his teacher."
      }
    ],
    "writeup": "## 1. おVerbますする is used when the speaker wants to be polite when talking about something he or his in-group member did or will do. For example, when a sales manager is talking to a customer, the manager uses this pattern to describe what his salesmen will do for the customer, as in (1).",
    "formation": "## \n\n- おVます\n- する\n- お話しする\n- Someone (will) talk\n- お教えする\n- Someone (will) teach",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: お~になる】",
    "antonym": "",
    "source": "resources/original/dojg/all/お～する.yaml"
  }
}