{
  "grammar_point": "かけ",
  "rank": 4,
  "bunpro": {
    "grammar_point": "かけ",
    "jlpt": "N3",
    "meaning": "Half-, Not yet finished, About to, Begin to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Being an unofficial helper verb,かけis what is known as a造語(neologism), and carries one specific meaning when used in conjunction with other words. This is  similar to向け.かけcomes from the verb掛ける 'to suspend', and may be attached to theconjunctive formor other verbs, in order to convey that they are 'unfinished'. Usually this translates as 'half (A)', 'about to (A)', or 'not yet finished (A)'.かけbehaves like a noun, so may be followed by thecase marking particleの when attached directly to another noun, or byだwhen at the end of a sentence.Occasionally, the verb掛ける itself may be used instead of the noun form,かけ.Fun FactAs the literal meaning of掛ける is 'to suspend', it expresses that something is stuck somewhere in the process of happening. This is similar to taking a photo of someone that is jumping. In the photo it will look like they are 'suspended', but that is only because one particular moment has been captured, somewhere between the start and the finish.かけconveys exactly the same meaning, and therefore may be interpreted differently, depending on the verb it is paired with.With verbs that express a momentary action (something that cannot be 'half' done),かけwill convey that the action was 'on the verge of' happening.However, with verbs that are ongoing actions,かけwill simply imply that they are 'in the process' of being done.",
    "examples": [
      {
        "japanese": "俺の食べかけだけど大丈夫?",
        "english": "This is half-eaten by me, is that okay?"
      },
      {
        "japanese": "これは私の飲みかけだ。",
        "english": "This is my half-drunken one."
      },
      {
        "japanese": "彼は死にかけの子犬を救った。",
        "english": "He saved a puppy that was about to die. (Half dead)"
      },
      {
        "japanese": "彼女は壊れかけのパソコンを買って直すのが趣味だ。",
        "english": "Her hobby is to buy half-broken computers and fix them. (Computers on the verge of breaking)"
      },
      {
        "japanese": "やばい、死にかけるところだった。",
        "english": "Wow, I was about to die right there. (Almost on the verge of dying)"
      },
      {
        "japanese": "飲みかけた水を捨てる。",
        "english": "I will throw away my half drunk water."
      },
      {
        "japanese": "先週の事故で死にかけそうになった。",
        "english": "I was on the verge of dying in an accident last week."
      },
      {
        "japanese": "壊れかけていた椅子に座ったら、椅子が壊れた。",
        "english": "When I sat on a chair that was on the verge of breaking, it broke."
      },
      {
        "japanese": "終わりかけだからちょっと待って。",
        "english": "I'm in the process of finishing, so can you wait a little."
      },
      {
        "japanese": "今日の宿題はもう終わり掛けです。",
        "english": "Today's homework is about to be finished. (Half-finished)"
      },
      {
        "japanese": "私は、何冊も読み掛けの本がある。",
        "english": "I have a lot of books that are half-read."
      },
      {
        "japanese": "食べ掛けのケーキでも良ければありますよ。",
        "english": "I have some half-eaten cake, if you would like."
      },
      {
        "japanese": "描き掛けの絵を早く完成させたい。",
        "english": "I want to finish this half-drawn picture quickly."
      },
      {
        "japanese": "この時計壊れ掛けだけど、ないよりはいいか。",
        "english": "This watch is half-broken, but is still better than nothing."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/かけ",
    "false_friends": [
      {
        "term": "たて",
        "meaning": "Freshly ~ed, Just ~ed",
        "kind": "antonym"
      },
      {
        "term": "るところだ",
        "meaning": "About to, On the verge of",
        "kind": "synonym"
      },
      {
        "term": "はじめる",
        "meaning": "To start, To begin to",
        "kind": "synonym"
      },
      {
        "term": "だす",
        "meaning": "To suddenly begin, To start doing",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-96"
  }
}