{
  "grammar_point": "かたがた",
  "rank": 8,
  "bunpro": {
    "grammar_point": "かたがた",
    "jlpt": "N1",
    "meaning": "Partly for (the purpose of), In addition to, Along with, By the way, And also to, Incidentally, While",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "旁is aconjunctionthat will be seen primarily in hiragana. This word will be translated as ‘in addition to doing (A), (B)’, ‘along with (A), (B)’, or ‘incidentally to (A), (B)’. Both (A) and (B) usually have an equal level of priority, but (B) will have the nuance of ‘while (A), also (B) in passing’.かたがたwill attach to the end of a noun that marks (A), while (B) will often, but not always, mark a verb of action.In cases where (A) is a noun that would usually take する, the する will be omitted entirely.Cautionかたがたis a formal structure that will primarily be seen in writing, but also has a tendency to be used as a part of either apologies or thanks. Due to this, it will tend to sound unnatural if there is no special purpose for the linked actions.",
    "examples": [
      {
        "japanese": "婚約の報告かたがた、お父様とお母様に会いに行きます。",
        "english": "I will go see (my partner’s) father and mother, partly for the purpose of letting them know about our engagement."
      },
      {
        "japanese": "妊娠の報告かたがた、相手の両親の家を訪ねた。",
        "english": "I visited my partner’s parents, partly for the purpose of letting them know about the pregnancy."
      },
      {
        "japanese": "お礼かたがた、そちらにお伺いをしたいと思っています。",
        "english": "I would like to come visit you, partly for the purpose of thanking you."
      },
      {
        "japanese": "本棚の整理かたがた、春の大掃除をした。",
        "english": "I did some spring cleaning, partly for the purpose of cleaning out my bookshelf. (Unnatural Japanese)"
      },
      {
        "japanese": "恩師の訪問：「本日は当時のお礼かたがた、卒業して以来どうしているかをご報告しに訪ねさせていただきました。」",
        "english": "Visiting a former teacher: 'Today I visited her to express my gratitude for that time in my life, and also to let her know how I have been doing since I graduated.'"
      },
      {
        "japanese": "​挨拶状：「まずは右ご挨拶かたがたお知らせまで。」",
        "english": "Greeting card: For now, this is only a notification and also greetings."
      },
      {
        "japanese": "結婚の報告かたがた、妻の兄弟の家を訪ねました",
        "english": "I visited my wife's sibling's house partly for the purpose of announcing our marriage."
      },
      {
        "japanese": "同じ会社で働く上司へのメール：「ご挨拶かたがた訪問をさせて頂きたいのですが、明日のご都合はいかがでしょうか。」",
        "english": "Email to a superior in the same company: 'I would like to pay you a visit to say hello and also other things. How would tomorrow be for you?'"
      },
      {
        "japanese": "同じ会社で働く上司へのメール：「まずはお礼かたがたご挨拶申し上げます。」",
        "english": "Email to a superior in the same company: 'For now, I would like to express my gratitude, and also greetings.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/かたがた",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-99"
  }
}