{
  "grammar_point": "か否か",
  "rank": 9,
  "bunpro": {
    "grammar_point": "か否か",
    "jlpt": "N1",
    "meaning": "Whether or not",
    "meaning_warning": "や否や is used to express \"as soon as\"",
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "否'no' is an interjection in Japanese that is primarily paired with theadverbial particleか 'or' when stating 'whether or not (A)'. The literal meaning is just '(A) or no'. This is a very formal expression that will mainly be seen in writing.か否かmay appear after almost any word in theirstandard forms.This structure is often paired with words like べき 'ought to', を問わず 'without questioning',にかかわらず'regardless of', and will be used to make determinations about the suitability of something based on a specific situation.",
    "examples": [
      {
        "japanese": "この授業を楽しむか否かは自分次第だ。",
        "english": "Whether you enjoy this class or not is up to you."
      },
      {
        "japanese": "怖いか否かは別として、この映画はとても面白かった。",
        "english": "Putting aside whether this movie was scary or not, it was really enjoyable."
      },
      {
        "japanese": "あの人が貧乏であるか否かは私たちには関係のないことです。",
        "english": "Whether that person is poor or not is none of our business."
      },
      {
        "japanese": "あの人がこの子の父親か否か、DNA検査をしなくてはわからない。",
        "english": "We will never know if that man is the father of this child or not without a DNA test."
      },
      {
        "japanese": "小説、語り手：「スウォン王は武力で反乱を鎮圧すべきか否か、について迷っていた。」",
        "english": "A novel, narrator: 'King Su-won was hesitant about whether or not he should put the rebellion down by force.'"
      },
      {
        "japanese": "記事のタイトル：「プロゲーマーは真のスポーツ選手か否か。eスポーツ業界が直面するビザの問題」",
        "english": "Article title: 'Are pro gamers real athletes or not? The visa problem that eSports faces.' (whether or not)"
      },
      {
        "japanese": "サイバーセキュリティ会社のサイト：「怪しいか否かの判断に迷うメールを受け取った場合は、どうぞそれを開かずにLain＠cyberland.xyzまでご連絡をお願いします。」",
        "english": "Cybersecurity company website: 'In the event that you receive an email in which you are unable to determine whether or not it is suspicious, do not open it and please contact us at Lain@cyberland.xyz.'"
      },
      {
        "japanese": "サイト、クッキーファイルについて：「利用者はそのクッキーを受け入れるか否かを決めることができますし、また、全部のクッキーを削除することもできます。」",
        "english": "Website, about cookie files: 'Users can decide whether or not they accept cookies. Users are also able to delete all accepted cookies anytime.'"
      },
      {
        "japanese": "イベントのサイト「参加資格：登録ユーザーであるか否かを問わず、どなたでもご参加可能」",
        "english": "Event website: 'Entry qualifications: Regardless of whether you are a registered user or not, anyone can participate.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/か否か",
    "false_friends": [
      {
        "term": "かどうか",
        "meaning": "Whether or not, If...or not",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-126"
  },
  "dojg": {
    "grammar_point": "か否か",
    "description": "A conjunctive phrase indicating that the speaker/writer is wondering whether something is the case or not.",
    "meaning": "Whether X or not",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "182",
    "examples": [
      {
        "japanese": "(ksa).このソフトが役に立つか否かは保証の限りではありません。",
        "english": "I cannot say (literally: guarantee) whether this software is  useful or not."
      },
      {
        "japanese": "(ksb).選挙の時に、有権者は候補者が倫理観のある政治家(である)か否かを見抜かなければならない。",
        "english": "In an election, the voter has to judge (literally: see through)  whether or not a candidate is a politician of integrity."
      },
      {
        "japanese": "(ksc).子供に携帯電話を持たせるべきか否かは議論が分かれる。",
        "english": "Opinions differ as to whether we should allow a child to have a  cell phone."
      },
      {
        "japanese": "(a).アメリカの大学では教授が外国人であるか否かは問題にならないが、日本ではそれがよく問題になるようだ。",
        "english": "In the U.S., whether or not a professor is a foreigner is not a  problem, but in Japan, it appears that it is frequently an issue."
      },
      {
        "japanese": "(b).家を探す場合、その地域が安全であるか否かが一番大事なポイントになる。",
        "english": "When you search for a house, whether or not the area is safe is  the most important point."
      },
      {
        "japanese": "(c).クラシック音楽を聞く時、私は旋律が美しいか否かよりその音楽が生命を感じさせるか否かに注意を払う。",
        "english": "When I listen to classical music, I pay attention to whether or  not it causes me to feel life rather than whether or not the melody is  beautiful."
      },
      {
        "japanese": "(d).大学の入試要項をよく読んでから受験するか否かを決めるべきだ。",
        "english": "You should decide whether or not to take the entrance examination  after reading the university's guidelines carefully."
      },
      {
        "japanese": "(e).愛されたら愛しかえすべきか否かという疑問は愚問です。",
        "english": "The question of whether or not one should return love when one  is loved is a silly one."
      },
      {
        "japanese": "(f).容疑者に遺体を見せると、真犯人か否かが分かることがある。",
        "english": "There are cases in which you can tell whether or not a suspect  is the real culprit when you show him or her the dead body."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjectiveい} informal\n- か否か\n- {来る/来た}か否か\n- Whether or not someone will come/came\n- {面白い/面白かった}か否か\n- Whether or not something is/was interesting\n- (ii){Noun/Adjectiveな} stem\n- {∅/である/だった/であった}か否か\n- 学生{∅/である/だった/であった}か否か\n- Whether or not someone is/was a student\n- 元気{∅/である/だった/であった}か否か\n- Whether or not someone is/was healthy\n- (iii)Vinformal nonpast\n- べき(である)か否か\n- {Noun/Adjectiveなstem}\n- であるべきか否か\n- 行くべき(である)か否か\n- Whether or not someone should go there\n- 学生であるべきか否か\n- Whether or not someone should be a student\n- 質素であるべきか否か\n- Whether or not someone should be frugal",
    "part_of_speech": "Phrase (usually used in formal writing and formal speech)",
    "related": "【Related Expression: か~ないか; かどうか】",
    "antonym": "",
    "source": "resources/original/dojg/all/か否か.yaml"
  }
}