{
  "grammar_point": "が (subject marker)",
  "rank": 0,
  "bunpro": {
    "grammar_point": "が (subject marker)",
    "jlpt": "N5",
    "meaning": "Particle marking the grammatical subject of the sentence.",
    "meaning_warning": "が emphasizes what comes before it, while は emphasizes what comes after it",
    "details": {
      "Part of Speech": "Case Marking Particle",
      "Register": "Standard",
      "品詞": "助詞",
      "単語の種類": "格助詞",
      "使用域": "一般"
    },
    "writeup": "が is considered to be the subject marker in Japanese. This means that it marks someone or something that is performing an action, or it identifies someone or something as having a specific feature (this is usually a feature that the listener is not aware of).In both of these sentences, が puts focus on the thing performing an action/existing in some way (as opposed to any other thing). Because of this, が is usually said to highlight what comes before it, while は highlights what comes after it.が always shows the 'target' of a statement, when other targets also exist. This is why が is used to describe situations that are happening either 'in the moment', or 'individually of other things'.Because the group in this sentence is only one group out of many possible 'groups of people' that could be described, が will be used.Cautionが is not usually used to describe something about yourself, unless you are intentionally describing yourself compared to other people. If you want to talk about yourself 'in general terms', は will sound more natural (there are exceptions).",
    "examples": [
      {
        "japanese": "お茶が冷たいです。",
        "english": "The tea is cold."
      },
      {
        "japanese": "何がいい?",
        "english": "What is good? (What would you like?)"
      },
      {
        "japanese": "それがいいです。",
        "english": "That is good. (That is what I would like)"
      },
      {
        "japanese": "カレーが辛い。",
        "english": "The curry is spicy. (The curry is the thing that is spicy)"
      },
      {
        "japanese": "木が高い。",
        "english": "The tree is tall. (The tree is the thing that is tall)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/が",
    "false_friends": [
      {
        "term": "は",
        "meaning": "As for... (Highlights sentence topic)",
        "kind": "synonym"
      },
      {
        "term": "を",
        "meaning": "Object marking particle",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-127"
  },
  "dojg": {
    "grammar_point": "が①",
    "description": "A particle which indicates the subject.",
    "meaning": "Particle marking the grammatical subject of the sentence.",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "118",
    "examples": [
      {
        "japanese": "(ks).雨が降っている・います。",
        "english": "Rain is falling."
      },
      {
        "japanese": "(a).私の部屋にはステレオがあります。",
        "english": "There is a stereo in my room."
      },
      {
        "japanese": "(b).あ、のり子が走っている。",
        "english": "Oh, Noriko is running."
      },
      {
        "japanese": "(c).A:このレストランは何が美味しいですか。B:ステーキが美味しいです。",
        "english": "A: What is good in this restaurant? B: Steak is good."
      }
    ],
    "writeup": "## 1. が marks the subject of a sentence when the information expressed by the subject is first introduced in a discourse. When the subject is presented as the topic (that is, the information has already been introduced into the discourse), however, the topic marker は replaces が. (⇨ は1) Consider the following discourse, a typical opening in folktales, which illustrates the different uses of が and は.",
    "formation": "##",
    "part_of_speech": "Particle",
    "related": "【Related Expression: は1】",
    "antonym": "",
    "source": "resources/original/dojg/all/が①.yaml"
  }
}