{
  "grammar_point": "がる",
  "rank": 1,
  "bunpro": {
    "grammar_point": "がる",
    "jlpt": "N4",
    "meaning": "To feel, To think, To act as if, To want, To desire",
    "meaning_warning": "がる is used inたがるconstruction, which is simplyたい+がる.",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "がるis aう-Verbthat is primarily used as asuffixin Japanese. When used in this way, it means 'to act like (A)', or 'to show signs of being (A)', where (A) is the word that it is attached to.To useがる, you will need to link it to the stem form of anい-Adjective(simply remove the い), or to the stem form of aな-Adjective(do not include the な).がるis a verb which means 'to give the impression of (A)', or 'to act like (A)'. This is very important in Japanese, as you would not usually say how somebody else feels, unless they told you directly and you are simply repeating what you heard (in which case you would use the quotation particleと).When you want to express the way you 'think' that someone else feels, but don't have any direct information about it, that is whenがるwould be natural to use. For example, if you see someone shivering in the cold, you would say something like the following.The main difference betweenがる, andがっている, is thatがるwill be used when a person usually/always acts a certain way, whereasがっているis more about the way someone/something is acting in any specific moment.Cautionがるmay also be used to describe yourself (in the third person). This is when you want to express the way you think that you act/are acting, or a way you assume other people view your behavior.Fun FactThe use ofがっているto express an 'in the moment' way that someone is acting, is slowly becoming less and less common in modern Japanese. Regularly,そうwill be used instead, to express that someone (or something) 'seems' a certain way.",
    "examples": [
      {
        "japanese": "彼はいつも女の子の前では強がるけど友達の中では彼は一番の怖がりだ。",
        "english": "He always acts tough in front of girls, but amongst our friends he is the biggest scaredy-cat."
      },
      {
        "japanese": "犬が嫌がる事をしてはいけない。",
        "english": "You must not do anything that the dog would not like."
      },
      {
        "japanese": "トムはこの新しいゲームを欲しいと思うよ。",
        "english": "I think Tom would want this new game."
      },
      {
        "japanese": "あの人、寒がっている。ジャケット着ればいいのに。",
        "english": "That person seems like they feel cold. It would be better if he wore his jacket. (Natural Japanese, as がる shows how he 'appears to be acting', rather than what he is actually feeling)"
      },
      {
        "japanese": "この子はいつも新しいおもちゃを欲しがる。",
        "english": "This kid always wants new toys."
      },
      {
        "japanese": "キムは新しいパソコンをほしがっている。",
        "english": "Kim is wanting a new computer."
      },
      {
        "japanese": "俺はいつも人の前では強がる。",
        "english": "I always act tough in front of people. (I probably always appear to act tough)"
      },
      {
        "japanese": "私は今、犬をほしがっているけど、マンションに住んでいるからまだ飼えない。",
        "english": "Right now, I am wanting a dog, but since I live in an apartment, I can't get one yet. (I am currently acting like I want a dog)"
      },
      {
        "japanese": "あの人、暑がっているね。",
        "english": "That person looks like they are hot, don't you think. (They're acting like they're hot)"
      },
      {
        "japanese": "あの人、暑そうだね。",
        "english": "That person looks like they are hot, don't you think. (They seem hot)"
      },
      {
        "japanese": "私の猫は怖がる。",
        "english": "My cat is jumpy. (Acts scared)"
      },
      {
        "japanese": "私の弟は強がる。",
        "english": "My younger brother acts tough."
      },
      {
        "japanese": "あの子はゲームをほしがる。",
        "english": "That kid (always) wants games."
      },
      {
        "japanese": "初めての飛行機なので怖いと思うけど、怖がらないでね。",
        "english": "This is your first time on an airplane so I think it might be scary, but don't feel scared."
      },
      {
        "japanese": "映画を見て、面白がっています。",
        "english": "Watching a movie and showing signs of interest."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/がる",
    "false_friends": [
      {
        "term": "たい",
        "meaning": "Want to do",
        "kind": "synonym"
      },
      {
        "term": "がほしい",
        "meaning": "To want something, To be in need of",
        "kind": "synonym"
      },
      {
        "term": "てほしい",
        "meaning": "I want you to",
        "kind": "synonym"
      },
      {
        "term": "たがる",
        "meaning": "To want to (Third person)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-141"
  },
  "dojg": {
    "grammar_point": "がる",
    "description": "An auxiliary verb attached to a psychological/physiological adjective meaning a person other than the speaker shows signs of ~",
    "meaning": "Show signs of ~",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "123",
    "examples": [
      {
        "japanese": "(ksa).一男はスポーツカーを欲しがった・がりました。",
        "english": "Kazuo showed signs of wanting a sports car."
      },
      {
        "japanese": "(ksb).上田さんはアイスクリームを食べたがった・がりました。",
        "english": "Mr Uedo showed signs of wanting to eat ice cream."
      },
      {
        "japanese": "(a).スーザンは一人で淋しがっています。",
        "english": "Susan feels lonely by herself."
      },
      {
        "japanese": "(b).子供が眠たがっている。",
        "english": "My child wants to go to sleep."
      }
    ],
    "writeup": "## 1. There is a group of adjectives which, in the present tense, usually requires the first person (or a person with whom the speaker can empathize) as subject. If the subject of a sentence in which these adjectives occur is not the first person (or one with whom the speaker can empathize), then がる is attached to the adjective. Observe the accompanying change of particles from が into を.\n\n- ⎧らない\n- informal, negative, nonpast\n- ⎢ります\n- formal, nonpast\n- ⎢る\n- informal, nonpast\n- 欲しが\n- ⎨れば\n- conditional\n- ⎢ろう\n- volitional\n- ⎢って\n- て form\n- ⎩ った\n- informal, past",
    "formation": "## \n\n- Adjective い/な stem\n- がる\n- うれしがる\n- Someone shows signs of being glad\n- めんどうがる\n- Someone shows signs of being bothered",
    "part_of_speech": "Auxiliary Verb (Group 1)",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/がる.yaml"
  }
}