{
  "grammar_point": "がてら",
  "rank": 8,
  "bunpro": {
    "grammar_point": "がてら",
    "jlpt": "N1",
    "meaning": "On the occasion of, While … as well, While …  (one is) at it, During, Along the way",
    "meaning_warning": "Some Japanese use it in a way similar to ながら, like in ドライブがてら話し合った",
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "がてらis a neologism that is used in the same way as anadverbial particlein modern Japanese, and will connect to theconjunctive formof verbs, and to nouns. It is similar to ながら in that it will be translated as 'while (A), (B)', 'during (A), (B)', or 'on the occasion of (A)'.When (A) is a noun, it will almost always be anounthat signifies some sort of physical movement.Unlike ながら,がてらfocuses more on (A) being a good opportunity which can be utilized or taken advantage of in order to do (B).Fun Factがてらis a vocal change of がてり, which originally comes from an abbreviation of theconjunctive formof糅つ, かて 'to mix together', and あり. So かてあり was abbreviated to かてり, which then went through sound changes to がてり andがてら. However, the 'being mixed together' meaning is still kept in the modern day nuance of this grammar point.",
    "examples": [
      {
        "japanese": "弟を駅から迎えがてらに、今夜の夕飯の買い物をしに行く。",
        "english": "I will go grocery shopping for tonight's dinner on my way to pick up my brother as well."
      },
      {
        "japanese": "友達の家に行きがてら、近くの神社にお参りに行った。",
        "english": "While going to my friend's house, I went to pray at the shrine nearby as well."
      },
      {
        "japanese": "ワンちゃんの散歩がてらに、ペットショップにいってくる。",
        "english": "While taking my dog on a walk, I am going to go to the pet store as well."
      },
      {
        "japanese": "運動がてらに会社まで自転車で行くことにした。",
        "english": "On the occasion of exercising, I decided to ride the bicycle to work."
      },
      {
        "japanese": "「イノシシの散歩がてら、ちょっとコンビニまで行ってきます。」",
        "english": "'While taking a walk with my pet wild boar, I will go to the convenience store as well.'"
      },
      {
        "japanese": "「お花見がてら、公園を散歩しよう。」",
        "english": "'Let's take a walk in the park while viewing the cherry blossoms as well.'"
      },
      {
        "japanese": "回顧録：「ヒースロー空港への移動がてら、観光スポットを訪れた。」",
        "english": "Memoir: 'I visited some tourist attractions on my way to Heathrow Airport as well.'"
      },
      {
        "japanese": "「帰りがてら手紙出してくるね。」",
        "english": "I'll post the letter on my way home as well."
      },
      {
        "japanese": "友達との話：「じゃあ買い物がてら、紅葉を見に行かないか?」",
        "english": "Chat between friends: 'So, why don't we view the autumn leaves while shopping as well?'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/がてら",
    "false_friends": [
      {
        "term": "ついでに",
        "meaning": "While you are at it, On the occasion",
        "kind": "synonym"
      },
      {
        "term": "ながら",
        "meaning": "While ~ing, During, As",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-137"
  }
}