{
  "grammar_point": "がけに",
  "rank": 6,
  "bunpro": {
    "grammar_point": "がけに",
    "jlpt": "N2",
    "meaning": "On the way to, As you go",
    "meaning_warning": "Kanji is rarely used",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Although not used much in modern Japanese, thesuffix掛け 'support', or 'hanger' followed by に may occasionally appear after the ます-stem of verbs. When seen used this way,掛けにsimply means 'on the way', 'as you go', or 'while doing (A)'. (B) may just be considered as something done while doing (A), or as being done specifically because (A) is a good opportunity to do it.This structure may be used either with or without kanji, so it will be important to remember both.Fun-fact -掛ける is one of the more difficult verbs in Japanese, as it does not have an exact counterpart in English. However, in most cases it just means to lay, extend, or place something across either a physical or metaphorical surface or span. In this way, it may help to remember (A) as the span from which (B) will occur.",
    "examples": [
      {
        "japanese": "帰りがけに駅前のたこ焼き屋でたこ焼きを買った。",
        "english": "On my way home, I bought some takoyaki from the takoyaki store in front of the station."
      },
      {
        "japanese": "今日は学校への行きがけにコンビニで弁当を買う。",
        "english": "Today, on my way to school, I will buy lunch at the convenience store."
      },
      {
        "japanese": "お父さん、通りがけにサービスエリアにでも寄って行こ！",
        "english": "Dad, let's stop by the service area on the way!"
      },
      {
        "japanese": "友達との話、A：「彼女が病気になった。」B：「そうなら帰り掛けに訪問したほうがいい。彼女も喜ぶだろう。」",
        "english": "Chat between friends, A: 'My girlfriend got sick.'B: 'If so, then you should visit her on your way home. She will be happy.'"
      },
      {
        "japanese": "先生は生徒と話している：「タカスさん、このプリントを帰り掛けにアイサカさんに持って行ってください。」",
        "english": "A teacher is talking with a student: 'Takasu, please bring this handout to Aisaka on the way home.'"
      },
      {
        "japanese": "病気の友達の見舞いに行く時、友達との話：「病院への行き掛けに花屋に寄って花束を買おう。」",
        "english": "Visiting a sick friend, chat between friends: 'Let's drop by the florist on the way to the hospital, and buy a bouquet.'"
      },
      {
        "japanese": "女の子の噂話：「さっきあいつ、来掛けに妙なことを言ってたね。」",
        "english": "Girls gossiping: 'Just now, on the way here, that dude was saying weird things.'"
      },
      {
        "japanese": "親と子供の話：「子供の頃、学校への行き掛けにこの駄菓子屋によく立ち寄ったものだ。」",
        "english": "Chat between parent and child: 'During my childhood, I often stopped by this small-time candy store on my way to school.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/がけに",
    "false_friends": [
      {
        "term": "途中に・途中で",
        "meaning": "On the way, Partway, In the middle of",
        "kind": "synonym"
      },
      {
        "term": "ついでに",
        "meaning": "While you are at it, On the occasion",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-133"
  }
}