{
  "grammar_point": "がみられる",
  "rank": 2,
  "bunpro": {
    "grammar_point": "がみられる",
    "jlpt": "N4",
    "meaning": "Can see, Can be seen, Can observe, Can be observed, Be evident, Chance to see something",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Unlike見える'to be visible', which focuses on whether something can be seen or not,見られる(thepotentialform of見る) focuses on the viewer's physical ability to see something. Due to thisが見られるis used to highlight things that require some form of 'effort' to see, like 'changes', 'trends', etc.As a result of the 'effort' that is required,が見られるis often translated as 'for (A) to be evident', 'it can be observed that (A)', 'it can be seen that (A)', and other similar structures. To use見られる, simply add it after the noun that you would like to show as being 'evident'.Asられるis both thepotentialandpassiveform of見る, it may be interpreted either way. However, in the case of ラ抜き言葉(ら removed verbs), only可能(possibility) may be expressed, not受け身(passivity).",
    "examples": [
      {
        "japanese": "この部屋からは富士山が見られる。",
        "english": "Mount Fuji can be seen from this room. (If you look closely, and it is a clear day)"
      },
      {
        "japanese": "奈良に行くと、横断歩道を渡るシカが見られる。",
        "english": "If you go to Nara, you can observe deer crossing the crosswalk. (If you are lucky, and the timing is right)"
      },
      {
        "japanese": "最近はタッチパネルが付いている冷蔵庫が見られる。",
        "english": "Recently, refrigerators with touch panels can be seen."
      },
      {
        "japanese": "最近はタッチパネルが付いている冷蔵庫が見れる。",
        "english": "Recently, you can see refrigerators with touch panels."
      },
      {
        "japanese": "夏には、ここでクマが見られます。",
        "english": "In summer, bears can be seen here."
      },
      {
        "japanese": "キウイフルーツは皮をむいて食べるのが一般的ですが、皮をむかないで食べる人も見られます。",
        "english": "Kiwifruit is generally eaten after peeling the skin, but people who eat it without peeling the skin can also be observed."
      },
      {
        "japanese": "最近の技術で地球にいながらブラックホールの写真が見られます。",
        "english": "With modern technology, we can observe photographs of black holes while being on earth."
      },
      {
        "japanese": "最近ガラスでできているスマホが見られる。",
        "english": "Recently, smartphones that are made of glass can be seen."
      },
      {
        "japanese": "いつか姫路城が見られるといいな。",
        "english": "I hope I can see Himeji Castle one day. (chance to be seen)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/がみられる",
    "false_friends": [
      {
        "term": "見える",
        "meaning": "To be visible, To seem, To be in sight",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-140"
  }
}