{
  "grammar_point": "がたい",
  "rank": 5,
  "bunpro": {
    "grammar_point": "がたい",
    "jlpt": "N3",
    "meaning": "Hard to, Difficult to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Coming from the same kanji as難しい 'difficult',難い is asuffixthat also means 'difficult'. However, in the case ofがたい, it will be attached to theconjunctive formof verbs, and conveys that '(A) is difficult to do'.がたいis almost always written without kanji in this meaning.Compared toにくい, which can simply imply that something is 'uncomfortable' to do,がたいrefers almost exclusively to困難であること 'things that involve a high degree of difficulty, distress, or infeasibility'. Due to this,がたいwill come across as far stronger thanにくい, and may imply that a certain task is almost impossible.Summed up, these nuances basically translate as the following:にくい- Something is difficult based on someone's opinion, experience, or general feeling.がたい- Something is difficult based on the task itself having a high level of difficulty.",
    "examples": [
      {
        "japanese": "あいつが言う事は信じがたいが、今は信じるしかない。",
        "english": "It is hard to believe what he says, but we have no choice but to trust him."
      },
      {
        "japanese": "言いがたかったから言わなかったけど、シャツ反対だよ。",
        "english": "I didn't say this because it's hard to say, but your shirt is inside out."
      },
      {
        "japanese": "彼の声は聞こえにくい。",
        "english": "His voice is a bit tricky to hear. (It is kind of hard to hear his voice, based on my ability/feeling)"
      },
      {
        "japanese": "この話が信じがたいのは分かるが、信じてくれ！",
        "english": "I understand that this story is impossible to believe, but please believe me! (Believing something like this is not easy)"
      },
      {
        "japanese": "皆から近寄りがたいってよく言われます。",
        "english": "I am often told that I am hard to approach."
      },
      {
        "japanese": "あの人の言っていることは信じがたいですね。",
        "english": "It's hard to believe what that person is saying."
      },
      {
        "japanese": "皆はその映画が面白いって言っているけど、僕はその映画が成功するとは言いがたい。",
        "english": "Everyone is saying that that movie is interesting, but I find it hard to say that it will succeed. (Casual)"
      },
      {
        "japanese": "忘れがたい出来事に遭遇した。",
        "english": "I encountered an event that is nearly impossible to forget."
      },
      {
        "japanese": "その人は信じがたいほど勇敢だった。",
        "english": "That person was brave to the point that was nearly impossible to believe."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/がたい",
    "false_friends": [
      {
        "term": "ようがない・ようもない",
        "meaning": "There's no way to, It's impossible to",
        "kind": "synonym"
      },
      {
        "term": "にくい",
        "meaning": "Difficult to, Hard to",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-135"
  },
  "dojg": {
    "grammar_point": "がたい",
    "description": "An auxiliary adjective which expresses the idea that for someone to do something is virtually impossible or impossible.",
    "meaning": "Cannot; un—able; can hardly; difficult to; impossible",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "50",
    "examples": [
      {
        "japanese": "(ksa).彼のしたことは許しがたい。",
        "english": "What he did is unforgivable."
      },
      {
        "japanese": "(ksb).この旅行は私にとって忘れがたい思い出になるだろう。",
        "english": "This trip will be an unforgettable one  (literally: memory) for me."
      },
      {
        "japanese": "(a).彼の行為は理解しがたい。",
        "english": "His behaviour is hard to understand."
      },
      {
        "japanese": "(b).あの先生は偉すぎて私には近寄りがたい。",
        "english": "That professor is so respected that I can  hardly approach him."
      },
      {
        "japanese": "(c).この二つの作品は甲乙付けがたい。",
        "english": "Between these two works, it is hard to say  that one is better than the other."
      },
      {
        "japanese": "(d).このプロジェクトは成功したとは言いがたい。",
        "english": "It is hard to say that this project was a  success."
      },
      {
        "japanese": "(e).ジョーンズ氏は得がたい人物だ。",
        "english": "Mr. Jones is an irreplaceable person  (literally: a person hard to get)."
      },
      {
        "japanese": "(f).我々は彼の犯行に関する動かしがたい証拠をつかんだ。",
        "english": "We obtained an indisputable piece of evidence  concerning his crime."
      },
      {
        "japanese": "(g).私は過去に彼から耐えがたい屈辱を受けた。",
        "english": "I was intolerably humiliated by him in the  past. (literally: received an intolerable humiliation from him.)"
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vます\n- がたい\n- 信じがたい\n- Hard to believe; unbelievable",
    "part_of_speech": "Auxiliary Adjective (い)",
    "related": "【Related Expression: かねる; 難い; づらい】",
    "antonym": "",
    "source": "resources/original/dojg/all/がたい.yaml"
  }
}