{
  "grammar_point": "が気になる",
  "rank": 6,
  "bunpro": {
    "grammar_point": "が気になる",
    "jlpt": "N2",
    "meaning": "To be interested in, To be concerned about",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "One of the many collocations in Japanese based on気'attention', or 'focus', is気になる. This is just a combination of the noun気, に, and the う-Verb なる 'to become'. Also, 気になる will come after (A) が, where (A) marks the thing that is drawing the 'attention' or 'focus' of the speaker.The most common translations for this structure are 'to be interested in (A)', or 'to be concerned about (A)'. This grammar pattern will appear before nouns, and noun-like phrases.Caution - Unlike気にする, which implies more that the speaker in intentionally putting their 'focus' on (A) due to it being difficult to ignore, the use of なる just highlights that (A) is 'becoming' something that is being focused on naturally, due to either the speakers concern or interest in the result.",
    "examples": [
      {
        "japanese": "家自体は良いと思うんですけど、やっぱり値段が気になります。なんでこんなに安いんですか?",
        "english": "I think the house itself is nice, however I am concerned about the price. Why is it so cheap?"
      },
      {
        "japanese": "私は高橋さんが気になる。",
        "english": "I am interested in Takahashi-san."
      },
      {
        "japanese": "やっぱりお前がさっき言ったことが気になる。",
        "english": "I am still concerned about what you said earlier."
      },
      {
        "japanese": "私は好きな人の考えていることが気になる。",
        "english": "I am interested in what the person I like is thinking about."
      },
      {
        "japanese": "私が気にすることは彼が良い人かどうかだけです。",
        "english": "All I care about is whether he is a good person or not."
      },
      {
        "japanese": "私が気になることは彼が良い人かどうかだけです。",
        "english": "The only thing that I am concerned about is whether he is a good person or not."
      },
      {
        "japanese": "最近、芸能界が気になる。",
        "english": "Recently, I have become interested in the entertainment world."
      },
      {
        "japanese": "あの工場見学が気になる。",
        "english": "I am interested in taking a tour of that factory."
      },
      {
        "japanese": "この香水を付けている人が気になる。",
        "english": "I am interested in people who wear this perfume. (concerned with)"
      },
      {
        "japanese": "友達の日本語のアクセントが気になる。出身はどこなんだろう…",
        "english": "I am interested in my friend's Japanese accent. I wonder where he is from."
      },
      {
        "japanese": "この足跡が気になる。もしかしたら熊の足跡かもしれません。",
        "english": "I am concerned about these tracks. It is possible that they are bear tracks."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/が気になる",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-143"
  }
}