{
  "grammar_point": "が早いか",
  "rank": 9,
  "bunpro": {
    "grammar_point": "が早いか",
    "jlpt": "N1",
    "meaning": "As soon as, No sooner than, The instant that, No sooner had",
    "meaning_warning": "While it can be used with the past form, non-past is more common.",
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "が早いかis an expression in Japanese that groups with verbs, for the purpose of indicating an action which is immediately followed by a second, often unexpected action. It is a combination of the case-marking particle が, the い-Adjective早い 'soon', and theadverbial particleか. It is often translated as 'no sooner than (A), (B)', or 'the instant that (A), (B)'. The more literal translation, taking into account the use of か, is '(A), or possibly sooner, (B)'. This just illustrates the instantaneousness of the (B) action in that (A) was unable to be determined as actually completed before (B) started.This grammar pattern is formal, and will follow verbs in their dictionary or past tense forms. The verb that comes in the (B) phrase will always be in the past tense.(A) will tend to be actions that happen momentarily, or having a clearly defined finish point. For actions that don't have a clearly defined finish point,終わる 'to finish' will often be linked to the stem form, in order to specify the end. Additionally, while the (B) action will often be unexpected, it will also usually be volitional, that is to say something done intentionally.CautionDue toが早いかalways expressing something in the past, it cannot be used to express wishes or intentions for the future. Additionally, it will not highlight the speaker's own actions.",
    "examples": [
      {
        "japanese": "彼女は彼が書いた手紙を読むが早いか、悲しさのあまりで泣き始めた。",
        "english": "As soon as she read the letter from her boyfriend, she started to cry out of sadness."
      },
      {
        "japanese": "息子は食卓に座るが早いか、並べてあった夕食を吸い込むように食い上げた。",
        "english": "As soon as my son sat at the dining table, he ate all the food that was out as if he sucked them up."
      },
      {
        "japanese": "木村くんはアラームが鳴ったが早いか、スヌーズボタンを押した。",
        "english": "As soon as the alarm went off, Kimura-kun pressed the snooze button."
      },
      {
        "japanese": "警察官は犯人を見つけたが早いか、犯人に飛びつき手錠をかけた。",
        "english": "As soon as the police officer saw the suspect, he jumped onto him and handcuffed him."
      },
      {
        "japanese": "雨が止むが早いか、出かけるつもりだ。",
        "english": "As soon as the rain stops, I am planning to go out. (Unnatural Japanese)"
      },
      {
        "japanese": "俺は毎日家に荷物を置くが早いか、友達の家に行く。",
        "english": "I go to my friends house as soon as I drop my stuff off at home, everyday. (Unnatural Japanese)"
      },
      {
        "japanese": "お母さんがケーキを焼き上げるが早いか、お父さんが食べ始めた。",
        "english": "As soon as mom had baked the cake, dad started eating it."
      },
      {
        "japanese": "黒ずくめの男は探偵を見つけたが早いか、疾風のごとく駆け出した。",
        "english": "As soon as the man dressed completely in black noticed the detective, he dashed off like the wind."
      },
      {
        "japanese": "夜、幼い魔法使いが窓を開けるが早いか、白フクロウが飛び込んできた。",
        "english": "At night, as soon as the young wizard opened the window, a white owl flew in."
      },
      {
        "japanese": "自動ドアが開くが早いか、まもなく人々は電車に乗り込んだ。",
        "english": "As soon as the automatic doors opened, people promptly entered the train."
      },
      {
        "japanese": "小説：「田中は目が覚めたが早いかベッドから飛び起きた。」",
        "english": "Novel: 'As soon as Tanaka opened his eyes, he jumped out of bed.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/が早いか",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-142"
  },
  "dojg": {
    "grammar_point": "が早いか",
    "description": "A conjunction indicating that as soon as something happens, something else happens.",
    "meaning": "As soon as; the moment; no sooner ~ than",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "99",
    "examples": [
      {
        "japanese": "(ks).彼は朝起きるが早いか、シャワーを浴びた。",
        "english": "As soon as he woke up he took a shower."
      },
      {
        "japanese": "(a).彼女は日本に着くが早いか友人に電話をかけた。",
        "english": "The moment she arrived in Japan she called her friend."
      },
      {
        "japanese": "(b).彼は私がいるのを見るが早いか、部屋を出て行ってしまった。",
        "english": "As soon as he saw me, he left the room."
      },
      {
        "japanese": "(c).猫は鼠を捕まえるが早いか、食べ始めた。",
        "english": "The moment the cat caught the mouse, it started to eat it."
      },
      {
        "japanese": "(d).電車はジョンが乗るが早いか、動き始めた。",
        "english": "As soon as John got on the train, it started to move."
      },
      {
        "japanese": "(e).ディーンは奇麗な女の子を見かけるが早いか、近寄って行って話しかけた。",
        "english": "No sooner did Dean see the pretty girl than he approached her  and started talking to her."
      },
      {
        "japanese": "(f).子供たちはパンが焼けるが早いか、全部食べてしまった。",
        "english": "As soon as the bread was baked, the children ate it all."
      },
      {
        "japanese": "(g).ひったくりは金を奪うが早いか、自転車で逃げた。",
        "english": "As soon as the thief (literally: snatcher) snatched my money,  he ﬂed by bike."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vinformal nonpast\n- が早いか\n- 食べるが早いか\n- As soon as someone ate",
    "part_of_speech": "Conjunction (usually used in formal writing and formal speech)",
    "related": "【Related Expression: や否や】",
    "antonym": "",
    "source": "resources/original/dojg/all/が早いか.yaml"
  }
}