{
  "grammar_point": "くらい (to the extent)",
  "rank": 5,
  "bunpro": {
    "grammar_point": "くらい ②",
    "jlpt": "N3",
    "meaning": "To the extent that, So…that, About the only thing that...",
    "meaning_warning": "くらい and ぐらい may be used 100% interchangeably, but ぐらい is far more common in speech",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Often, thenounくらいis used as anadverbial particle. This use ofくらい(or ぐらい) expresses the limit of something, in a similar way to ほど. This means that it can be translated as 'about (A)', 'so (A) that (B)', or '(A) to the extent of (B)'. Let's take a look at a few examples.Despite translating in the above ways, we can see that this use ofくらいis similar to the standard kanji use位, which literally means a 'rank', or 'grade' of something. What this means is that (A) will usually be considered to be at the 'grade' of something that was required in order to cause/allow (B).",
    "examples": [
      {
        "japanese": "今日はもう一生走りたくないくらい走った。",
        "english": "Today, I ran so much that I don't want to run again in my whole life."
      },
      {
        "japanese": "わたしも叫びたいくらい、怖かった。",
        "english": "I was so scared that I wanted to scream too."
      },
      {
        "japanese": "5連休が必要なぐらい疲れています。",
        "english": "I am tired to the extent that it is necessary for me to have 5 days off."
      },
      {
        "japanese": "俺もキヨミさんくらいピアノが弾けるようになりたい。",
        "english": "I want to be able to play the piano to about the level of Kiyomi-san."
      },
      {
        "japanese": "寝るしかしたくないくらい、疲れている。",
        "english": "I am so tired that I don't want to do anything but sleep."
      },
      {
        "japanese": "プロ選手ぐらい上手になりたい。",
        "english": "I want to be skilled to the extent that pro athletes are."
      },
      {
        "japanese": "少し日本語を話せるぐらい勉強したことがある。",
        "english": "I have studied to the extent that I can speak a little Japanese."
      },
      {
        "japanese": "兄は久し振りにアメリカから帰った。兄だとわからないくらい変わってしまった。",
        "english": "My brother returned home for the first time in a long time from America. He changed, to the extent that I didn't recognize that it was him."
      },
      {
        "japanese": "みんなを泣かすくらいスパイシーなチリのサラダを作った。",
        "english": "I made a chili salad so spicy that it made everyone cry."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/くらい2",
    "false_friends": [
      {
        "term": "くらい ①",
        "meaning": "About, Approximately",
        "kind": "synonym"
      },
      {
        "term": "まで",
        "meaning": "Even, To even, To the extent of",
        "kind": "synonym"
      },
      {
        "term": "ほど",
        "meaning": "The more, About, To the extent that, So much… that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-151"
  },
  "dojg": {
    "grammar_point": "くらい",
    "description": "A particle which is used to express the degree of a state.",
    "meaning": "To the extent that; so ~ that ~ (almost) ~; at least; the only ~; rather than ~",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "151",
    "examples": [
      {
        "japanese": "(ksa).私達は一歩も歩けないくらい疲れていた。",
        "english": "We  were so tired that we couldn't even take a step. (literally: We were tired to  the extent that we couldn't even walk one step.)"
      },
      {
        "japanese": "(ksb).今晩は暖かいのでストーブが要らないくらいだ。",
        "english": "It  is so warm this evening that we (almost) don't need a heater."
      },
      {
        "japanese": "(ksc).山田さんくらいよく物を忘れる人はいない。",
        "english": "There's  no one who is as forgetful as Yamada (literally: who forgets things as much as  Yamada does)."
      },
      {
        "japanese": "(ksd).私は料理は下手ですが、ご飯くらい(は)炊けます。",
        "english": "I  am a poor cook (literally: bad at cooking), but I can at least cook rice."
      },
      {
        "japanese": "(kse).今この仕事が出来るのは彼くらいのものだ。",
        "english": "He  is the only person who can do this job now. (literally: The person who is  capable enough to do this job is he.)"
      },
      {
        "japanese": "(ksf).そんなことをするくらいなら死んだ方がましだ。",
        "english": "I  would rather die than do such a thing."
      },
      {
        "japanese": "(a).その家は直しようがないくらい傷んでいた。",
        "english": "That  house was so damaged that it couldn't be repaired. (literally: That house was  damaged to the extent that it couldn't be repaired.)"
      },
      {
        "japanese": "(b).次郎はひどく酔っていて立っていられないくらいだった。",
        "english": "Jiro  was so drunk that he couldn't hold himself upright."
      },
      {
        "japanese": "(c).こんな本、十ドルでもまだ高いくらいだ。",
        "english": "Even  ten dollars would still be too expensive for a book like this."
      },
      {
        "japanese": "(d).内田さんくらいかわいそうな人はいない。",
        "english": "This  is no one who is as pitiful as Uchida."
      },
      {
        "japanese": "(e).あの時くらい苦しかった時はない。",
        "english": "I  have never suffered as much as I did that time."
      },
      {
        "japanese": "(f).信頼していた人に裏切られる(こと)くらい辛いことはない。",
        "english": "There  is nothing as painful as being betrayed by someone you have trusted."
      },
      {
        "japanese": "(g).いくら安い所でもシャワーくらい付いているでしょう。",
        "english": "Even  though it is a cheap place, there should at least be a shower."
      },
      {
        "japanese": "(h).そんな物に二万円も出すのはあなたくらいのものですよ。",
        "english": "You  are the only person who would pay as much as 20,000 yen for such a thing."
      },
      {
        "japanese": "(i).あんな男の下で働くくらいなら乞食になった方がましだ。",
        "english": "I  would rather be a beggar than work under such a man."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Sinformal\n- くらい\n- The same as relative connection rules\n- 泳げるくらい\n- To the extent that one can swim\n- (先生も) 出来なかったくらい\n- To the extent that (even our teacher) couldn’t do it\n- 恐ろしいくらい\n- To the extend that (I) am frightened\n- 気の毒なくらい\n- To the extent that (i) feel sorry\n- (ii)Noun\n- くらい\n- 山田さんくらい\n- To Yamada’s degree",
    "part_of_speech": "Particle",
    "related": "【Related Expression: ほど】",
    "antonym": "",
    "source": "resources/original/dojg/all/くらい.yaml"
  }
}