{
  "grammar_point": "くる (come)",
  "rank": 0,
  "bunpro": {
    "grammar_point": "くる",
    "jlpt": "N5",
    "meaning": "To come",
    "meaning_warning": null,
    "details": {
      "Part of Speech": "Independent Word",
      "Register": "Standard",
      "品詞": "動詞",
      "単語の種類": "自立語",
      "使用域": "一般"
    },
    "writeup": "来る is one of only two main verbs in Japanese that do not follow the standard rules of conjugation for Godan and Ichidan verbs. The other primary verb being する . 来る means 'to come', or 'to be coming'.来る will always have the particle に or へ attached to the location that someone 'will come', or 'has come'.The reason that 来る is called a か-column irregular conjugation verb in Japanese is because the る in 来る does not conjugate, but is dropped. This leaves the く being the part that conjugates. Because of this, 来る has qualities of both る-Verbs (the る being dropped), and う-Verbs (the remaining く changing depending on the conjugation). Here are some examples of how 来る changes.(き)た, (く)る, (こ)ない.来る will often be seen as 来 ている when someone has come to a place and remains there. This is due to ている meaning 'to exist in the state of an action', rather than being exactly the same as '(A)~ing' in English. Because of this, 来 ている can mean either 'to be somewhere that one has come', or 'to be coming'.Sometimes the difference between these two will not be clear unless there is further context.Caution来 ている (for existing at a place) is only used for places that people 'temporarily' go, so will not be used when you are at your home/work.",
    "examples": [
      {
        "japanese": "トムはここにくる。",
        "english": "Tom will come here."
      },
      {
        "japanese": "バスがくる。",
        "english": "The bus will come."
      },
      {
        "japanese": "彼はバスできます。",
        "english": "He will come by bus."
      },
      {
        "japanese": "友達もきますか。",
        "english": "Will your friend come too?"
      },
      {
        "japanese": "明日きます。",
        "english": "I will come tomorrow."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/くる",
    "false_friends": [
      {
        "term": "へいく",
        "meaning": "To go to, To head toward",
        "kind": "synonym"
      },
      {
        "term": "てくる",
        "meaning": "To come to, To become, To continue, To be starting to, Has been ~ing",
        "kind": "synonym"
      },
      {
        "term": "いらっしゃる",
        "meaning": "To be (Honorific), To come (Honorific), To go (Honorific)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-152"
  },
  "dojg": {
    "grammar_point": "来る・くる①",
    "description": "Someone or something moves in a direction towards the speaker or the speaker’s viewpoint or area of empathy.",
    "meaning": "Come; visit; show up",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "219",
    "examples": [
      {
        "japanese": "(ks).田中さんが明日うちへ・に来る・来ます。",
        "english": "Mr. Tanaka will come to my house tomorrow."
      },
      {
        "japanese": "(a).ナンシーは昨日パーティーに来ましたか。",
        "english": "Did Nancy come to the party yesterday?"
      },
      {
        "japanese": "(b).来週木口さんが名古屋に来るそうだ。",
        "english": "I was told that Mr. Kiguchi is coming to Nagoya next week."
      },
      {
        "japanese": "(c).もし、もし、家内が来たら直ぐ帰るように言って下さい。",
        "english": "Hello, please tell my wife to come home right away if she (literally: comes to see you) drops by."
      },
      {
        "japanese": "(d).今日はまだ新聞が来ない。",
        "english": "Today's newspaper hasn't come yet."
      },
      {
        "japanese": "(e).僕の研究室に明日来て下さい。",
        "english": "Please come to my office tomorrow."
      }
    ],
    "writeup": "## から commonly describes a movement towards a place where the speaker physically exists, as in Key Sentence and Example (d). However, it can also describe a movement in a direction where the speaker has placed his viewpoint or where he feels strong empathy. For example, in Example (a) the speaker, who apparently did not attend the party, is taking the viewpoint of the hearer, who did attend. In Example (c) the speaker is phoning and is not at the hearer's house, yet he is taking the hearer's viewpoint, a typical example of the psychological fusion between speaker and hearer. In Example (b), it is possible that the speaker lives nearer Nagoya than Mr. Kiguchi does and feels that Mr. Kiguchi is entering his (the speaker's) territory or area of strong empathy. And again, in Example (e), the use of 来る indicates that the speaker's office as well as his house can be considered his territory or area of empathy.",
    "formation": "##",
    "part_of_speech": "Verb (Irregular)",
    "related": "【Related Expression: 行く1】",
    "antonym": "",
    "source": "resources/original/dojg/all/来る・くる①.yaml"
  }
}