{
  "grammar_point": "ぐらいなら",
  "rank": 8,
  "bunpro": {
    "grammar_point": "ぐらいなら",
    "jlpt": "N1",
    "meaning": "Would rather...than, Rather than, Better off",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "くらいならwill often be translated as 'would rather (B) than (A)', or 'better off (B) than (A)'. It is a grammar pattern that combines theadverbial particleusages of くらい 'about' and なら 'if' to imply that 'if it gets to the extent of (A), then (B)', where (B) will be something that is preferable.くらいならwill be used directly following verbs in theirdictionary forms.As this structure emphasizes (A) as being something that is undesirable, (B) will often contain statements that offer a solution, suggestion, or opinion, such as ほうがいい 'would be better to', ほうがましだ 'would be less bad', なさい 'do!'.CautionAlthoughくらいならwill always follow a verb indictionary form, the second half of the sentence may imply that (A) has actually already happened, and the speaker is wishing that it hadn't. In these cases,くらいならalmost always translates to 'if I had known that (A), then I would have (B)'.",
    "examples": [
      {
        "japanese": "あの地域に引っ越すくらいなら、死んだ方がマシだ。",
        "english": "I would rather die, than move to that neighborhood."
      },
      {
        "japanese": "あの先輩の下で働くぐらいなら、一人で働いた方がいいと思うよ。",
        "english": "I think you would be better off working alone, than working under that senpai."
      },
      {
        "japanese": "何十万もかけて直すくらいなら、もう少し出して新しい車を買った方がいい。",
        "english": "I would rather buy a new car that is a little expensive than pay thousands of dollars to fix this car."
      },
      {
        "japanese": "え、前使ってたパソコン捨てちゃったの?捨てるくらいなら俺が買ったのに。",
        "english": "What… You threw away the computer you were using? I would have bought it from you rather than you throw it away."
      },
      {
        "japanese": "あんな奴に頼むぐらいなら、自分でやればよかった。",
        "english": "I should have done it myself, rather than asking a person like that to do it."
      },
      {
        "japanese": "A：「彼に助けを求めたらどう?」B：「彼に助けを求めるくらいなら、むしろピラニアだらけの池を泳いだほうがましだぞ。」",
        "english": "A: 'What about asking him for help?'B: 'I would rather swim through a pond full of piranha than ask him for help.'"
      },
      {
        "japanese": "「その仕事は絶対に嫌だ。それに戻るくらいなら死んだほうがましだ。」",
        "english": "'I really hate that job. I would rather die than go back.'"
      },
      {
        "japanese": "「小さなことに目くじらを立てる人と一緒に生活するくらいならホームレスになったほうがましだ。」",
        "english": "'I would rather become homeless than live together with a person who nitpicks every little thing I do.'"
      },
      {
        "japanese": "A：「愛Phoneの画面の修理は3万円からするよ。どうしようかな?」B：「とっても高いよね！修理するくらいなら新しいのを買っちゃった方がいいかなあ。」",
        "english": "A: 'My aiPhone screen repair cost starts at about 30000 yen! What should I do?'B: 'Wha, that's super expensive! You would be better off buying a new one rather than repairing it.'"
      },
      {
        "japanese": "「やらずに後悔するくらいなら、いっそやってみなさいよ。」",
        "english": "'Rather than regret not doing it, try it!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ぐらいなら",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-154"
  }
}