{
  "grammar_point": "こととて",
  "rank": 8,
  "bunpro": {
    "grammar_point": "こととて",
    "jlpt": "N1",
    "meaning": "Due to, Since, On account of, Because",
    "meaning_warning": "こととて in some contexts can also mean “even”",
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "こととてis a combination of the noun こと 'thing', and thebinding (adverbial) particleとて, which is used for presenting reasons. It will be translated as 'due to (A)', or 'because of (A)'. This is a fairly old-fashioned expression, and will almost exclusively be used in writing in modern Japanese.To useこととて, attach it to the end of a verb, or a noun followed by the case-marking particle の.こととてwill primarily be used when asking for forgiveness for something. Due to this, when appearing after verbs, the verb will usually be in past tense, or have been negated with either ない or ぬ. This highlights something that was done and shouldn't have been, or wasn't done and should have been.In many cases, (A) will be something for which the negative result of (B) is obvious, or to be expected.Fun Factとて is thought to either be a combination of the case-marking particle と and theconjunction particleて, or theconjunctive formof theclassical auxiliary verbたり, と, and theconjunction particleて. As the origin is unclear, it will be best to think of it as its own structure, that carries its own original meaning.",
    "examples": [
      {
        "japanese": "あの事件は20年前に起こったこととて、世間からは忘れられているだろう。",
        "english": "Due to that incident happening 20 years ago, it probably has been forgotten by the public."
      },
      {
        "japanese": "商品についてあまり知らぬこととて、お客様の信頼を失ってしまった。",
        "english": "Due to me lacking knowledge about the product, I unfortunately lost credibility."
      },
      {
        "japanese": "新人のこととて、まだ分からないことがたくさんありますが、これからよろしくお願いいたします。",
        "english": "Since I am still new, there are many things I don't know, but please take good care of me."
      },
      {
        "japanese": "突然のこととて、前の車を避けきれませんでした。",
        "english": "Due to it being a sudden event, I was not able to avoid the car in front of me."
      },
      {
        "japanese": "時代劇。A：「あなたのお父さんによろしくお伝えください。」B：「お父さんは遥か昔に亡くなりました。」A：「そうでしたか。知らぬこととて、失礼をお許しください。」",
        "english": "A period drama, A: 'Please, send my greetings to your father.'B: 'My father passed away long ago.'A: 'Is that so? Please, forgive my rudeness due to my lack of knowledge.'"
      },
      {
        "japanese": "古い手紙：「取り込み中のこととてご迷惑をおかけしましたがなにとぞご寛容のほどお願い申し上げます。」",
        "english": "Old letter: 'I have caused you a lot of trouble due to being busy, but I would kindly ask for your understanding.'"
      },
      {
        "japanese": "「仕事になれぬこととて間違いをしてしまいました。申し訳ございません。」",
        "english": "'I made a mistake due to not being accustomed to the work. For that I am awfully sorry.'"
      },
      {
        "japanese": "「田舎のこととて年齢や学年に関係なく生徒が勉強する教室が1教室だけしかなかった。」",
        "english": "Since it was the countryside, there was only one classroom where school children studied, regardless of their age or grade."
      },
      {
        "japanese": "「子供がやったこととて、親としてお詫び申し上げます。」",
        "english": "'Since my child did it, I would like to apologize as their parent.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/こととて",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-171"
  }
}