{
  "grammar_point": "さ (filler)",
  "rank": 4,
  "bunpro": {
    "grammar_point": "さ - Filler",
    "jlpt": "N3",
    "meaning": "Like, You know, You see, Listen, Uhh",
    "meaning_warning": null,
    "details": {
      "Register": "Casual",
      "使用域": "タメ語"
    },
    "writeup": "さis a感動詞(interjection) in Japanese that has three primary uses. These are as follows:誘い、促し - To invite, incite, or draw attention to something.驚き、当惑し - The express surprise, confusion, or bewilderment.話の流れを抑える - To control or keep in check the flow of a conversation.In this lesson, we will be focusing on the second meaning (to express surprise, confusion, or bewilderment). In English, this is used in a very similar way to 'like', 'you know', 'uhh', and other short phrases that are employed when a speaker is searching for the right thing to say, and is filling the silence. Thisさmay be used in any position within a sentence, simply to create thinking time.The 'confusion' that thisさexpresses is not necessarily a bad thing, and is used by many people to simply express that they have not finished talking yet.",
    "examples": [
      {
        "japanese": "あのさ、私さあ、この前さあ、お金貸したじゃん?あれさあ、返してくれない?",
        "english": "Hey, um… I, uhh, lent you, like, money before, right? You know… can you give that back to me?"
      },
      {
        "japanese": "ね〜聞いてよ。彼女がさ、急に別れたいっていって来たんだけどどうすればいいの。",
        "english": "Heyyy, listen to this. You know my girlfriend? She suddenly came to me saying that she wants to break up with me, what should I do."
      },
      {
        "japanese": "来週箱根に行くんだけどさ…どこか美味しいところ知らない?",
        "english": "I am going to Hakone next week, soooo… Do you know any good restaurants?"
      },
      {
        "japanese": "夜中に急に娘から電話が来てさあ...本当にビックリしたよ。",
        "english": "You know, my daughter suddenly called me in the middle of the night, and… I was really worried."
      },
      {
        "japanese": "「内緒だけどさ、彼宝くじに当たったんだよ。」",
        "english": "'Between us, you see, he won the lottery.'"
      },
      {
        "japanese": "A：「私さぁ、明日から5連休なんだ！」B：「いいなぁー」",
        "english": "A: 'I have, you see, a 5 day weekend starting from tomorrow.'B: 'Lucky!'"
      },
      {
        "japanese": "上司が部下に仕事の進捗を聞く：「あのさ、この前お願いした資料だけど、進捗どう?」",
        "english": "Superior asking a subordinate about work progress: 'Listen, is there any progress with the documents I requested earlier?'"
      },
      {
        "japanese": "「今朝さあ、母さんに怒られたよ。」",
        "english": "'I got scolded by mom in the morning, you know.'"
      },
      {
        "japanese": "友達との会話：「あのさ、俺、彼女ができたんだ！」",
        "english": "Chat between friends: 'Listen, I got myself a girlfriend!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/さ-filler",
    "false_friends": [
      {
        "term": "さ - Interjection",
        "meaning": "All right, There we go, Now, You see, Well (I don't know, let me see)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-188"
  }
}