{
  "grammar_point": "さえ",
  "rank": 5,
  "bunpro": {
    "grammar_point": "さえ",
    "jlpt": "N3",
    "meaning": "Even",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "さえis anadverbial particlein Japanese that is used to place emphasis on something existing in certain state. It is often translated as 'even'.さえhas three primary meanings, which are as follows:Analogical Reasoning:類推- Analogy, (A) is an outstanding example of something.Limit:限定- Limit, (A) is all that is needed for something.Addition:添加- (A) compounds something that is pre-existing.さえis regularly paired with other particles and is often followed by verbs in negative form, with the overall meaning usually being determined by what part (B) of the sentence is conveying. Let's look at a few examples.In each of these cases, we can see howさえis showing that (A) is an extreme example of something.Fun Factは, も, でも, andさえare alladverbial particlesthat can be thought of as having a relationship toward, and away from what is 'expected' in any given situation. This relationship can be seen here:(A) は - (A) is completely expected, there is nothing unusual.(A) も - (A) will be included as part of what is expected, but can be unusual.(A) でも - (A) may or may not be included as part of what is expected, and can be unusual.(A)さえ- (A) is separated completely from what is expected, and is unusual.Due to this unexpected and unusual situation thatさえalways presents, it is regularly translated as 'let alone (A)', or 'not to mention (A)'.",
    "examples": [
      {
        "japanese": "上級者の彼でさえ出来ないのに、あなたが出来るわけがないでしょう。",
        "english": "Even someone in the advanced class level can't do it, there is no way you can do it."
      },
      {
        "japanese": "彼女は親にさえ知らせずに彼氏と結婚をした。",
        "english": "She got married to her boyfriend, even without telling her parents."
      },
      {
        "japanese": "彼はストレスのせいで、晩飯を食べることさえ出来なくなった。",
        "english": "Due to him being stressed, he couldn't even eat."
      },
      {
        "japanese": "タナカ君は酷くない?彼女を傷つけたのに、謝りさえしなかったらしいよ。",
        "english": "Don't you think Tanaka-kun is a jerk? He hurt his girlfriend, but he didn't even apologize."
      },
      {
        "japanese": "そんなの放っておいてさえいたら、すぐ直るよ。",
        "english": "Even if you leave it as it is, it will get well quickly."
      },
      {
        "japanese": "このレベルはプロでさえ難しいというのに、よくできたね。",
        "english": "I am impressed you were able to do this, let alone that it is difficult even for professionals."
      },
      {
        "japanese": "トムがこんなに漢字を知っているのは凄いと思うよ。日本人でさえ漢字は難しいのに。",
        "english": "Tom, I think it is impressive that you know this many kanji. Not to mention that it is difficult even for Japanese people."
      },
      {
        "japanese": "富士山の頂上は夏でさえ寒い。",
        "english": "It is cold on the summit of Mt. Fuji even in summer."
      },
      {
        "japanese": "そんな初歩的なことは、子供でさえ知っている。",
        "english": "Even children know things that basic."
      },
      {
        "japanese": "小さい戦いさえ、私はしたことがない。",
        "english": "I've never even been in a small fight."
      },
      {
        "japanese": "祖父は若い頃、戦時中に遠くまで戦闘に向かった。日本にさえ戦いに行ったことがある。",
        "english": "When my grandfather was young, he fought in far off lands during the war. He even went to Japan."
      },
      {
        "japanese": "あのことについてさえ知っているんです。",
        "english": "I even know about that thing."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/さえ",
    "false_friends": [
      {
        "term": "まで",
        "meaning": "Even, To even, To the extent of",
        "kind": "synonym"
      },
      {
        "term": "割に",
        "meaning": "Although, Despite, Rather...for, Unexpectedly, Comparatively, Considering",
        "kind": "synonym"
      },
      {
        "term": "ても",
        "meaning": "Even if, Even though",
        "kind": "synonym"
      },
      {
        "term": "さえ〜ば",
        "meaning": "If only…then, As long as..., Provided..., Only thing ... needs for ... is ...",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-190"
  },
  "dojg": {
    "grammar_point": "さえ",
    "description": "An emphatic particle which expresses the idea of \"even\" in non-conditional clauses (or sentences) or the idea of \"only\" in conditional clauses.",
    "meaning": "Even; if ~ only; if ~ just; as long as; the only thing ~ need is",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "363",
    "examples": [
      {
        "japanese": "(ksa).彼女は現代日本語は勿論古典さえ読める。",
        "english": "She  can read even classical Japanese, not to mention modern Japanese."
      },
      {
        "japanese": "(ksb).この研究所にはアメリカからさえ研究者が来る。",
        "english": "Researchers  even from America visit this lab."
      },
      {
        "japanese": "(ksc).その歌は子供でさえ知っている。",
        "english": "Even  children know this song."
      },
      {
        "japanese": "(ksd).ここに置いておきさえすれば後はここの人が全部やってくれます。",
        "english": "If  you just leave it here, the people in this place will take care of the rest."
      },
      {
        "japanese": "(kse).この仕事さえ片付いたら後は楽なんです。",
        "english": "If  we can only finish (literally: If we only finish) this work, the rest will be  easy."
      },
      {
        "japanese": "(a).彼はもうおかゆさえ喉を通らなかった。",
        "english": "He  was no longer able to eat even porridge."
      },
      {
        "japanese": "(b).私はその写真を大人には勿論子供にさえ見せた。",
        "english": "I  showed the picture even to kids, not to mention adults."
      },
      {
        "japanese": "(c).彼は私の言うことを聞こうとさえしない。",
        "english": "He  doesn't even try to listen to me."
      },
      {
        "japanese": "(d).山田にさえ出来たんだから君にも出来るよ。",
        "english": "Even  Yamada could do it, so you can do it, too."
      },
      {
        "japanese": "(e).先生でさえこの問題を解くのに二時間もかかった。",
        "english": "Even  my teacher took (as much as) two hours to solve this problem."
      },
      {
        "japanese": "(f).クレジットカードさえあればいつでも入会出来ます。",
        "english": "You  can join our club any time if you only have a credit card."
      },
      {
        "japanese": "(g).君さえ承知してくれたら今すぐこのプロジェクトを始めるつもりだ。",
        "english": "As  long as you agree (to our plan), we are planning to begin this project right  away."
      },
      {
        "japanese": "(h).まじめに勉強してさえいれば試験は大丈夫だ。",
        "english": "As  long as you study seriously, you'll do okay on the exam (literally: the exam  will be all right)."
      },
      {
        "japanese": "(i).手を上げさえすればすぐ警官が飛んでくる。",
        "english": "If  you just raise your hand, a policeman will rush to you."
      },
      {
        "japanese": "(j).高くさえなければ売れるはずだ。",
        "english": "It  should sell as long as it's not expensive."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun\n- さえ\n- 鹿さえ出る\n- Even deer appear\n- 刺身さえ食べる\n- Eat even sashimi\n- (ii)Noun(Particle)\n- さえ\n- アフリカ(へ/に)さえ行った\n- Went even to Africa\n- (iii)Noun Particle\n- さえ\n- こんな街にさえある\n- Exist even in such a town\n- 私にさえ分かる\n- Understandable even to me\n- 学校でさえ教える\n- Teach even at school\n- 犬とさえ遊ぶ\n- Play even with a dog\n- 中国からさえ来る\n- Come even from China\n- (iv)Noun (Particle)\n- でさえ\n- 専門家でさえ分からない\n- Even professionals don’t understand (literally: one doesn’t understand something even if he is a professional)\n- 果物でさえ食べない\n- Don’t eat even fruit (literally: don’t eat something even if it is fruit)\n- 私からでさえもらわない\n- Don’t accept (something) even from me (literally: don’t receive something even if it is from me)\n- (v)Vて\n- さえ(いる/もらう/etc.)\n- 読んでさえいない\n- Have not even read\n- 見てさえ分からない\n- Don’t understand even by looking at\n- (vi)Vます\n- さえする\n- 書きさえする\n- Even write\n- (vii)Adjective い stem\n- くさえある\n- 安くさえある\n- Be even inexpensive\n- (viii){Adjective な stem/Noun}\n- でさえある\n- 便利でさえある\n- Be even convenient\n- 学者でさえある\n- Be even a scholar",
    "part_of_speech": "Particle",
    "related": "【Related Expression: まで; も; すら】",
    "antonym": "",
    "source": "resources/original/dojg/all/さえ.yaml"
  }
}