{
  "grammar_point": "さえ〜ば",
  "rank": 4,
  "bunpro": {
    "grammar_point": "さえ〜ば",
    "jlpt": "N3",
    "meaning": "If only…then, As long as..., Provided..., Only thing ... needs for ... is ...",
    "meaning_warning": "たら can be used instead of ば form, but it is rarely the case.",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "As a set expression,さえ〜ばis a combination of theadverbial particleさえ, and theconjunction particleば. It is used to highlightassumption, and presents (A) as a extreme limitation that is required to achieve (B), hypothetically. This structure may be translated as 'if only (A), then (B)', 'the only thing needed for (A) is (B)', or 'as long as (A), (B)'.さえmay be grouped with any word, but will require theconjunctive form, or て form before it when grouped with verbs. It also regularly appears after other particles, forming a dual-particle meaning.This use ofさえis an example oflimit, with (A) being a hypothetical limit presented by theばparticle. It is also possible to seeさえwith other hypothetical indicators (such asたら), but is quite rare in modern Japanese, asさえ〜ばis considered a set pattern.This limitation is also sometimes referred to as a'stipulation', or 'condition'.",
    "examples": [
      {
        "japanese": "この薬を毎日飲みさえすれば、すぐに治りますよ。",
        "english": "As long as you drink this medicine every day, it will heal quickly."
      },
      {
        "japanese": "もっと若い頃からお金を貯めてさえいれば、今頃デカい家を買えてたかも。",
        "english": "If only I had saved up money since I was young, by now, I would have been able to buy a big house."
      },
      {
        "japanese": "あの背が高い人さえ横にずれてくれれば、ちゃんと見えるのにな。",
        "english": "If only that tall person moved to the side, (then) I would be able to see."
      },
      {
        "japanese": "タナカさんは若くさえあれば、あんな人でも雇う。",
        "english": "Tanaka-san will hire anyone, so long as they are young."
      },
      {
        "japanese": "家の前の道さえ広ければSUVが買えたのに。",
        "english": "I would have been able to buy an SUV, if only the street in front of my house was bigger."
      },
      {
        "japanese": "僕は静かでさえあればどこでも寝れます。",
        "english": "As long as it is quiet, I can sleep anywhere."
      },
      {
        "japanese": "バンドメンバー募集中。ギターさえ弾けたら誰でもオッケーです。",
        "english": "Looking for a new band member. Anyone is okay, so long as you can play the guitar."
      },
      {
        "japanese": "日本で英語さえ話せたら、どこでも働けます。",
        "english": "As long as you can speak English in Japan, you can work anywhere."
      },
      {
        "japanese": "妹は暇さえあれば、運動する。",
        "english": "Only if my sister has free time, then she will exercise."
      },
      {
        "japanese": "死体さえ発見できれば、警察が解決をする。",
        "english": "Provided the police can find the body (then) they will solve the case. (if only..)"
      },
      {
        "japanese": "彼は自分さえ良ければ、いいと思っている。",
        "english": "He thinks that as long as it is good for him, it is good (for everyone). (only if)"
      },
      {
        "japanese": "天気さえ良ければテニスできるのに…(良い)",
        "english": "If only the weather was good, then I would play tennis."
      },
      {
        "japanese": "君さえいれば、他には何もいらない。",
        "english": "I don't need anything else, as long as I have you. (if only you exist)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/さえ-ば",
    "false_friends": [
      {
        "term": "さえ",
        "meaning": "Even",
        "kind": "synonym"
      },
      {
        "term": "限り",
        "meaning": "As long as, While… is the case, Limited to",
        "kind": "synonym"
      },
      {
        "term": "からには",
        "meaning": "As long as, Since, Given",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-191"
  }
}