{
  "grammar_point": "ずに",
  "rank": 4,
  "bunpro": {
    "grammar_point": "ずに",
    "jlpt": "N3",
    "meaning": "Without doing",
    "meaning_warning": "に can be omitted",
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "Although it is not considered to be one of the primary 18auxiliary verbsthat are used in modern Japanese, ず is aclassical auxiliary verbthat has the same role as ぬ, and ない. This role is negating the verb that it is attached to. ずに is simply the addition of thecase marking particleに to ず. Together, they mean 'without doing', in a similar way to ないで.To use ずに, attach it to theindeterminate formof the verb that you wish to express as 'without doing (A)'. This is the same form used with ない.ずに is quite a bit more formal than ないで, but still frequently used in modern Japanese. Especially as part of set phrases, like ずにすむ (which we will learn about in another lesson).CautionWhen used with aするverb,するwill become せずに, not しずに. Both せ and し areindeterminate formsofする. し, the more common form that is used in east Japan appears with ない.",
    "examples": [
      {
        "japanese": "朝ご飯を食べずに仕事に行ったから、仕事中に倒れた。",
        "english": "Because I went to work without eating breakfast, I fainted in the middle of my job."
      },
      {
        "japanese": "水を飲まずに運動をしていたから、頭が痛い。",
        "english": "Because I exercised without drinking water, I have a headache."
      },
      {
        "japanese": "勉強せずにテストを受けたから、テストの点数が低かった。",
        "english": "Because I took the test without studying, I got a low score."
      },
      {
        "japanese": "あんまり無理をせずに頑張ってくださいね。",
        "english": "Please do your best without trying too hard."
      },
      {
        "japanese": "彼は朝ごはんを食べずに仕事に行きました。",
        "english": "He left for work without eating breakfast."
      },
      {
        "japanese": "休まず、一日中ゲームをやり続けた。",
        "english": "Without taking a break, I continued to play video games throughout the day."
      },
      {
        "japanese": "試合に一回も負けず、優勝した。",
        "english": "Without losing a single game, they won the championship."
      },
      {
        "japanese": "悩まずに生きるなんて不可能なのかもしれない。",
        "english": "It might not be possible to live without worrying."
      },
      {
        "japanese": "肩の力を抜いて、力まずにスウィングした方がいいですよ。",
        "english": "You'd better relax your shoulder and swing without straining yourself."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ずに",
    "false_friends": [
      {
        "term": "ないで",
        "meaning": "Without doing, Not ~ and ~",
        "kind": "synonym"
      },
      {
        "term": "ことなく",
        "meaning": "Without ~ing",
        "kind": "synonym"
      },
      {
        "term": "ずにはいられない",
        "meaning": "Cannot help doing something, Cannot resist doing something",
        "kind": "synonym"
      },
      {
        "term": "ずに済む",
        "meaning": "Get by without doing something, To get away with",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-222"
  }
}