{
  "grammar_point": "ずして",
  "rank": 10,
  "dojg": {
    "grammar_point": "ずして",
    "description": "A phrase meaning “without doing something”.",
    "meaning": "Without ~ing; before (~ing); with no ~; if ~ do not; when ~ do not",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "753",
    "examples": [
      {
        "japanese": "(ks).インカ帝国を知らずして南米大陸を語ることはできない。",
        "english": "You cannot talk about the South American continent without some  knowledge of the Inca Empire."
      },
      {
        "japanese": "(a).我々のチームは最終日の最終戦を待たずして優勝が決定した。",
        "english": "Our team won the championship before (literally: without  waiting for) the ﬁnal game on the ﬁnal day."
      },
      {
        "japanese": "(b).自分の義務を果たさずして人の責任を問うべきではない。",
        "english": "You should not call others to account when you have not  performed your own duties."
      },
      {
        "japanese": "(c).文雄は宝くじが当たって労せずして大金を得た。",
        "english": "Fumio won the lottery, receiving a large sum of money with no  effort."
      },
      {
        "japanese": "(d).新しい議長の選出で期せずしてみんなの意見が一致した。",
        "english": "In the election for a new chairman, unexpectedly (literally:  without expecting), everybody agreed (on who it should be)."
      },
      {
        "japanese": "(e).今勉強せずしていつするのか?",
        "english": "If we/you don't study now, when will you study?"
      },
      {
        "japanese": "(f).荒木氏は自分の設計した建物の完成を見ずして亡くなってしまった。",
        "english": "Mr. Araki died before (literally: without) seeing the  completion of the building he'd designed."
      },
      {
        "japanese": "(g).ウイルスに感染した電子メールを社外の個人、団体に送信してしまい、意図せずして加害者になってしまった。",
        "english": "I became an offender without meaning to after sending a  virus-infected e-mail to individuals and groups outside my company."
      },
      {
        "japanese": "(h).敵を知らずしては戦えない。",
        "english": "You cannot ﬁght without knowing your enemy."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vnegative\n- ずして\n- Exception: する→せずして\n- 待たずして\n- Without waiting\n- 練習せずして\n- Without practicing",
    "part_of_speech": "Phrase (usually used in formal writing and formal speech)",
    "related": "【Related Expression: ずに; ないで】",
    "antonym": "",
    "source": "resources/original/dojg/all/ずして.yaml"
  }
}