{
  "grammar_point": "せい",
  "rank": 5,
  "bunpro": {
    "grammar_point": "せいで",
    "jlpt": "N3",
    "meaning": "Because of, Due to, Blame",
    "meaning_warning": "Can express blame or fault, で can be omitted at the end of a sentence",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Although written almost exclusively in hiragana, せい is anounthat may be better understood from its kanji,所為, meaning 'doings'. せい is used to convey negative results that occurred due to the behavior or actions of another person/thing. Because of this, common translations of せい are 'fault', 'due to', or 'because of'.As せい is a noun, it may be used after theattributive formof any other word. Thecase marking particleで will also regularly be seen after せい, especially when conveying the (B) result that occurred 'with' or 'by means of' those 'doings'.Fun FactThe 'doings' that所為represents is similar to the negative 'doings' that is used in English to place blame. This can be seen in phrases such as 'it was the weather's doings', or 'ah, so the missing cookies were your doings!'",
    "examples": [
      {
        "japanese": "昨日夜遅くまで起きていたせいで寝坊した。",
        "english": "Because I stayed up late last night, I overslept today."
      },
      {
        "japanese": "外が寒いせいで風邪を引いた。",
        "english": "Because it is chilly outside, I caught a cold."
      },
      {
        "japanese": "犬の手術の事が心配なせいで今日は寝れなさそう。",
        "english": "Due to me being worried about my dog's surgery, it doesn't seem like I am going to be able to sleep."
      },
      {
        "japanese": "大雪のせいで道が渋滞してる。",
        "english": "Because of the heavy snow, the road is congested."
      },
      {
        "japanese": "遅刻したのは渋滞のせいだ！",
        "english": "Me being late is the traffic's doing!"
      },
      {
        "japanese": "台風のせいでまた予定が変わったよ。",
        "english": "Due to the typhoon's doings, my plans have changed again."
      },
      {
        "japanese": "トムは暑さのせいで気を失った。",
        "english": "Tom passed out because of the heat."
      },
      {
        "japanese": "トムがお皿を割ってしまったせいで、私は怪我をしてしまった。",
        "english": "I got injured because Tom broke a plate."
      },
      {
        "japanese": "気分が悪くなったせいで、仕事を休んでしまった。",
        "english": "Because I wasn't feeling well, I took the day off."
      },
      {
        "japanese": "雨のせいでせっかくの遠足が中止になってしまった。",
        "english": "The long awaited trip was cancelled because of the rain."
      },
      {
        "japanese": "湿気のせいでカビがひどい。",
        "english": "The mold is out of control because of the humidity."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/せいで",
    "false_friends": [
      {
        "term": "ために",
        "meaning": "Due to, Because of, As a result of",
        "kind": "synonym"
      },
      {
        "term": "おかげで",
        "meaning": "Thanks to, Because of",
        "kind": "synonym"
      },
      {
        "term": "につき",
        "meaning": "Due to, On account of, Each or every",
        "kind": "synonym"
      },
      {
        "term": "そのため(に)",
        "meaning": "For that reason, Because of that, To that end",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-227"
  },
  "dojg": {
    "grammar_point": "せい",
    "description": "A dependent noun expressing a cause which brings about an undesirable result.",
    "meaning": "Because; due to",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "378",
    "examples": [
      {
        "japanese": "(ksa).今年は不況のせいで車があまり売れない。",
        "english": "Because  of the depression, cars are not selling well this year."
      },
      {
        "japanese": "(ksb).寝不足のせいか体に力が入らない。",
        "english": "Because  of lack of sleep, I suppose, I feel weak (literally: the body has no power)."
      },
      {
        "japanese": "(ksc).私が失敗したのは彼のせいだ。",
        "english": "It  is because of him that I failed."
      },
      {
        "japanese": "(ksd).昨夜飲みすぎたせいで今日は頭がふらふらする。",
        "english": "I  am dizzy today because I drank too much last night."
      },
      {
        "japanese": "(a).最近運動不足のせいで体重が増えた。",
        "english": "I've  gained weight because of lack of exercise these days."
      },
      {
        "japanese": "(b).雨が少なかったせいで今年は米が不作だそうだ。",
        "english": "It  is reported that because there was little rain, we are going to have a bad crop  of rice this year."
      },
      {
        "japanese": "(c).年のせいか最近耳が聞こえにくくなった。",
        "english": "Due  to my age, I suppose, I cannot hear well these days."
      },
      {
        "japanese": "(d).新しい土地に来て水が変わったせいか近頃お腹の調子がよくない。",
        "english": "Maybe  because I have moved to a new place and the water is different, my stomach is  uncomfortable these days."
      },
      {
        "japanese": "(e).目が悪くなったのは一日中コンピュータを使って仕事をしているせいだ。",
        "english": "It  is because you work with a computer all day that your eyesight has  deteriorated."
      },
      {
        "japanese": "(f).彼はよく自分の失敗を人のせいにする。",
        "english": "He  often blames others for his own failure (literally: claims that his own failure  is due to others)."
      },
      {
        "japanese": "(g).これは誰のせいでもない。",
        "english": "This  is (due to) no one's fault."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Nounの\n- せい(で/か/etc.)\n- 過労のせいで\n- Because of overworking\n- (ii)Sinformal\n- せい(で/か/etc.)\n- The same as the relative clause formation\n- 働きすぎたせいで\n- Because someone worked too hard",
    "part_of_speech": "Noun",
    "related": "【Related Expression: おかげ; 為(に)】",
    "antonym": "",
    "source": "resources/original/dojg/all/せい.yaml"
  }
}