{
  "grammar_point": "ぜんぜん",
  "rank": 2,
  "bunpro": {
    "grammar_point": "ぜんぜん",
    "jlpt": "N4",
    "meaning": "(Not) at all",
    "meaning_warning": "Slang: totally・completely, exceptionally",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "In Japanese, there are several adverbs that are traditionally used exclusively with negative expressions (containing ない).全然is one of them. When used at the beginning of a ない (or ません) containing phrase,全然(ぜんぜん)has the meaning of 'completely not (A)', or 'not (A) at all'.In writing, it is equally as natural to use either全然as kanji, or hiragana only, so both forms may be used confidently.ぜんぜんis more flexible (and friendly sounding) in casual conversation than全く, a similar expression which has a formal (often negative) nuance.While both of these sentences have the meaning of 'not (A) at all',まったくcould give the listener the impression that you are not pleased with the situation. This will depend quite a bit on tone of voice, though.CautionDespite originally being used only with negative expressions, it is becoming more and more common forぜんぜんto appear with positive expressions as well. In these cases, it just has the meaning of 'totally (A)', or 'completely (A)'.Although this is technically not grammatically correct, it is becoming so frequently used that it is considered correct by most people (especially the younger generation).",
    "examples": [
      {
        "japanese": "やばい、トイレットペーパーが全然ない。",
        "english": "Oh shoot, I don't have any toilet paper at all."
      },
      {
        "japanese": "彼女は家事の手伝いを全然しなかったので別れました。",
        "english": "I broke up with her because she didn't help out at all with house chores."
      },
      {
        "japanese": "今月もお金が全然無いからパンだけを食べる。",
        "english": "I don't have any money this month either, so I am only eating bread."
      },
      {
        "japanese": "昨日後輩からもらったお土産は全く美味しくありませんでしたね。",
        "english": "The souvenir we got from our junior member yesterday was not tasty at all, don't you think?"
      },
      {
        "japanese": "明日?全然いいよ！",
        "english": "Tomorrow? That's completely fine!"
      },
      {
        "japanese": "私は全然英語を話せないです。",
        "english": "I can't speak English at all."
      },
      {
        "japanese": "あなたは全然理解が出来ていないね。",
        "english": "You don't understand at all do you?"
      },
      {
        "japanese": "今、機嫌が悪くて、全然嬉しくならない。",
        "english": "I'm in a bad mood right now and there's no way at all I'll become happy."
      },
      {
        "japanese": "今の髪型は全然好きじゃないから、明日切りに行く。",
        "english": "I don't like my current hair style at all, so I'll go get my hair cut tomorrow."
      },
      {
        "japanese": "事故にあったけど、私は全然大丈夫。",
        "english": "I was in an accident, but I am completely fine."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ぜんぜん",
    "false_friends": [
      {
        "term": "とても〜ない",
        "meaning": "Not ~ at all, Cannot ~ at all",
        "kind": "synonym"
      },
      {
        "term": "すこしも〜ない",
        "meaning": "Not even a little, Not at all, Not in the least, Never",
        "kind": "synonym"
      },
      {
        "term": "全く〜ない",
        "meaning": "Not~at all",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-231"
  }
}