{
  "grammar_point": "それと",
  "rank": 6,
  "dojg": {
    "grammar_point": "それと",
    "description": "A conjunction which introduces an additional item or statement.",
    "meaning": "And; also; in addition; as well",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "431",
    "examples": [
      {
        "japanese": "(ksa).林檎三つとオレンジ二つ、それと、バナナを三本下さい。",
        "english": "Give  me three apples and two oranges, and three bananas, as well."
      },
      {
        "japanese": "(ksb).スポーツはテニスとゴルフをします。それと、学生時代はアイスホッケーをしていました。",
        "english": "S1:  Speaking of sports, I play tennis and golf. S2: In addition, I played ice  hockey at school (literally: in my school days)."
      },
      {
        "japanese": "(a).山田さん、木下さん、上野さん、それと、高橋さんもお見えになります。",
        "english": "Mr.  Yamada, Mr. Kinoshita, and Mr. Ueno are coming. And Mr. Takahashi, too."
      },
      {
        "japanese": "(b).外国語はドイツ語にフランス語、それと、日本語が少しが話せます。",
        "english": "Talking  about foreign languages, I can speak German and French, and a little Japanese."
      },
      {
        "japanese": "(c).留守中に山村さんと浜田さんからお電話がありました。それと、吉田さんからお手紙が来ております。",
        "english": "There  were calls from Mr. Yamamura and Mr. Hamada while you were out. Also, a letter  came from Mr. Yoshida."
      },
      {
        "japanese": "(d).緊急の問題は先生をどうするかということです。それと、もう一つ、教室の問題も考えなければなりません。",
        "english": "How  to get a teacher is the urgent problem. And, for another thing, we have to  think about the classroom problem."
      },
      {
        "japanese": "(e).この手紙を昼までにタイプしておいてくれる?あ、それと、昨日頼んでおいた飛行機の切符、取れた?",
        "english": "Could  you type this letter by noon? Oh, and did (literally: could) you get the air  tickets I asked for yesterday?"
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun1{と/に/、}Noun2{と/に/、}\n- …それと、Noun\n- ビールとチーズ、それと、ポテトチップ\n- Beer and cheese, and potato chips as well\n- (ii)Sentence1\n- それと、Sentence2\n- 音楽はコーラスをしています。それと、学生の頃フルートを少しやりました\n- Speaking of music, I am a member of a chorus. In addition, I played flute a little when I was a student",
    "part_of_speech": "Conjunction (used in conversation only)",
    "related": "【Related Expression: それから; それに】",
    "antonym": "",
    "source": "resources/original/dojg/all/それと.yaml"
  }
}