{
  "grammar_point": "その結果",
  "rank": 4,
  "bunpro": {
    "grammar_point": "その結果",
    "jlpt": "N3",
    "meaning": "As a result",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "その結果is aconjunctionin Japanese that is used to highlight the result of something that has been previously said. Thenoun結果itself means 'result'. This expression translates as 'as a result of (A)', or 'resulting from (A)'.その結果will be used at the beginning of a new sentence, before a (B) phrase will highlight the result of (A).その結果may be used to highlight either positive, or negative results interchangeably. However, the (B) part of the sentence almost always focuses on a new 'situation' or 'condition' that has been created due to (A).",
    "examples": [
      {
        "japanese": "学校を3か月休んだ。その結果、皆と卒業することができなかった。",
        "english": "I took three months off from school. As a result, I was not able to graduate with everyone."
      },
      {
        "japanese": "日焼け止めを塗らずにビーチで一日過ごした。その結果凄く日焼けをして、しばらくシャワーに入るのが辛かった。",
        "english": "I spent the whole day at the beach without sunscreen. As a result, I got a bad sunburn and it was painful to take a shower for a while."
      },
      {
        "japanese": "毎日朝早くから夜遅くまで練習した。その結果、試合で優勝することができた。",
        "english": "We practiced every day from early in the morning to late at night. As a result, we were able to win the tournament."
      },
      {
        "japanese": "タナカ君は一年間運動をしないでゲームばっかりしていた。その結果20-キロも太った。",
        "english": "Tanaka-kun only played video games without exercising for a year. As a result, he gained 20 kilograms."
      },
      {
        "japanese": "2ヶ月間ずっと体を鍛え続けていた。その結果、筋肉が増えた。",
        "english": "I continuously trained for a solid two months. As a result I gained muscle."
      },
      {
        "japanese": "高校の頃、５か月間入院をした。その結果、留年することになった。",
        "english": "During my high school days, I was hospitalized for 5 months. As a result, I ended up repeating a year."
      },
      {
        "japanese": "昨日、髪の毛が濡れたままで寝た。その結果、風邪を引いた。",
        "english": "Last night I went to bed with wet hair. As a result I caught a cold."
      },
      {
        "japanese": "夜更かしをした。その結果、遅刻した。",
        "english": "I stayed up till late. As a result, I was late."
      },
      {
        "japanese": "日本語能力試験を受けるまでに彼は毎週日本語の小説を2冊読んだ。その結果、読解で満点を取った。",
        "english": "Before taking the JLPT, he read two Japanese novels a week. As a result, he got full marks on the reading section."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/その結果",
    "false_friends": [
      {
        "term": "そこで",
        "meaning": "Accordingly, Now, Therefore, To that end",
        "kind": "synonym"
      },
      {
        "term": "ために",
        "meaning": "Due to, Because of, As a result of",
        "kind": "synonym"
      },
      {
        "term": "したがって",
        "meaning": "Therefore, Thus, As a result",
        "kind": "synonym"
      },
      {
        "term": "結果・の結果",
        "meaning": "As a result of",
        "kind": "synonym"
      },
      {
        "term": "そのため(に)",
        "meaning": "For that reason, Because of that, To that end",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-245"
  }
}