{
  "grammar_point": "そんなに",
  "rank": 2,
  "bunpro": {
    "grammar_point": "そんなに",
    "jlpt": "N4",
    "meaning": "So (much), That much, Like that",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "そんなに, likeそんな, is one of the most common ways to express that one thing is 'like' something else in casual conversation. The addition of the particleにjust highlightsそんなas being the 'destination' of the 'like' amount. This construction is regularly translated as 'so much', 'that much', or simply 'like that'.As a word,そんなにis used adverbially. This means that it may come before any verb,い-Adjective, orな-Adjective.Almost anyそんなにbased sentence can be translated literally as 'to an extent like (A)', where (A) is the word that comes afterそんなに, andにindicates 'to'.Asそんなにis another example of こそあど言葉(words likeこれ,それ,あれ, andどれ), it means thatこんなに,あんなに, andどんなにmay also be used.Despite this,そんなにis almost considered a set phrase, and is therefore the most common out of all of the possibilities (except forどんなに, which is often used when explaining/giving reasons for something).",
    "examples": [
      {
        "japanese": "そんなに食べたらお腹を壊 すよ。",
        "english": "If you eat that much, you are going to break your stomach. (Natural Japanese for 'stomach ache')"
      },
      {
        "japanese": "そんなに暑いと思うならエアコンをつければいい。",
        "english": "If you think it's that hot, you should turn on the air conditioner."
      },
      {
        "japanese": "そんなに嫌いなら、無理して食べなくてもいい。",
        "english": "If you dislike it that much, you don't have to force yourself to eat it."
      },
      {
        "japanese": "こんなにもらってもいいんですか?",
        "english": "Is it okay to receive this much? (Are you really giving me all of this?)"
      },
      {
        "japanese": "あんなに食べたのにまだお腹が空いているの?",
        "english": "You are still hungry, even after eating that much?"
      },
      {
        "japanese": "どんなに頑張っても、私は先輩みたいにはなれないと思う。",
        "english": "No matter how hard I try, I don't think that I can become like my senpai."
      },
      {
        "japanese": "このケーキはそんなに甘いんですか。",
        "english": "Is this cake really that sweet?"
      },
      {
        "japanese": "そんなに痛いなら、病院に行ったほうがいいんじゃないですか。",
        "english": "If it hurts that much, shouldn't you go to the hospital?"
      },
      {
        "japanese": "そんなに頑張っても、彼みたいに出来ない。",
        "english": "Even if I tried that hard, I couldn't do it like he can. (that much)"
      },
      {
        "japanese": "そんなに日本に行きたいなら、行って来たら?",
        "english": "If you want to go to Japan that much, why don't you?"
      },
      {
        "japanese": "そんなに水泳が嫌いなら、泳がなくていいんじゃない?",
        "english": "If you hate swimming so much, why don't you just not swim? (that much)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/そんなに",
    "false_friends": [
      {
        "term": "あまり〜ない",
        "meaning": "Not very, Not much, Not really, Hardly",
        "kind": "synonym"
      },
      {
        "term": "そんな・こんな・あんな・どんな",
        "meaning": "Such a・Kind of, Something like ~",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-258"
  }
}