{
  "grammar_point": "それとも",
  "rank": 3,
  "bunpro": {
    "grammar_point": "それとも",
    "jlpt": "N2",
    "meaning": "Or, Or else, Rather",
    "meaning_warning": "Used in questions, where the choice is limited to the two mentioned options.",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "それともis a conjunction in Japanese that may be translated as 'or', or 'otherwise'. It is used to highlight alternative options or choices between (A) and (B).それともis a combination of それ, and the particles と, and も. This grammar structure will only be used when the options are limited to either (A), or (B).それともwill appear either after a comma, or at the beginning of new sentences.In many cases, (A) and (B) will be opposites of each other. However, this is not a requirement for usingそれとも.",
    "examples": [
      {
        "japanese": "今日は文法の勉強をしますか。それとも漢字の勉強をしますか。",
        "english": ""
      },
      {
        "japanese": "来週はどこに行きたい?動物園に行く?それとも家でゆっくりする?",
        "english": "Where do you want to go next week? Do you want to go to the zoo? Or rather do you want to relax at home?"
      },
      {
        "japanese": "今日は海に行こうか、それとも川に行こうか、迷うな。",
        "english": "I don't know whether to go to the ocean or the river today."
      },
      {
        "japanese": "今夜はカラオケに行く?それとも映画館?",
        "english": "Are you going to karaoke tonight? Or rather, to the cinema?"
      },
      {
        "japanese": "クレジットカードで払う?それとも現金で?",
        "english": "Are you paying with a credit card? Or rather, in cash?"
      },
      {
        "japanese": "生きるべきか、それとも死ぬべきか。それが問題だ。",
        "english": "To live, or to die. That is the question."
      },
      {
        "japanese": "苦情を言うべきか、それとも我慢すべきか。",
        "english": "Should we complain? Or rather, should we persevere?"
      },
      {
        "japanese": "自分で洗おうか、それともクリーニングに出そうか迷うところです。",
        "english": "I am hesitant. Shall I wash it myself? Or rather, shall I send it off to the dry cleaners?"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/それとも",
    "false_friends": [
      {
        "term": "か (question)",
        "meaning": "Or",
        "kind": "synonym"
      },
      {
        "term": "むしろ",
        "meaning": "Rather, Instead, Over",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-251"
  },
  "dojg": {
    "grammar_point": "それとも",
    "description": "A coordinate conjunction which connects two alternatives expressed by sentences.",
    "meaning": "Or; either ~ or ~",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "421",
    "examples": [
      {
        "japanese": "(ksa).この本が間違っているか(それとも)私が間違っているかどちらだ・です。",
        "english": "It's either that this book is wrong or that I am wrong."
      },
      {
        "japanese": "(ksb).刺身を食べますか。それともすき焼きにしますか。",
        "english": "Will you have sashimi, or will you have sukiyaki?"
      },
      {
        "japanese": "(a).僕が来るか(それとも)村井さんが来るかどちらかです。",
        "english": "Either I will come or Mr. Murai will come."
      },
      {
        "japanese": "(b).あの人は先生ですか。それとも医者ですか。",
        "english": "Is he a teacher or a doctor?"
      }
    ],
    "writeup": "## 1. それともそれとも 2. In Key Sentence (B), if the context is clear, abbreviated questions may occur in informal speech. For example, (1) may be used for Key Sentence (B). (1) 刺身?それとも Sashimi or sukiyaki?",
    "formation": "##",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: か1】",
    "antonym": "",
    "source": "resources/original/dojg/all/それとも.yaml"
  }
}