{
  "grammar_point": "たところで",
  "rank": 7,
  "bunpro": {
    "grammar_point": "たところで",
    "jlpt": "N1",
    "meaning": "Even if ~ cannot or will not, Even though ~ not",
    "meaning_warning": "The た-form is generally not used in the clause following ところで",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "〜たところで is a grammar construction that combines the simple-past form of a verb, the noun ところ 'place', and the case-marking particle で.As with most other grammar patterns that ところ is seen with, the focus is on the situation of the verb occurring. 〜たところで is often translated as 'even if (A), not (B)', or 'even if (A), it won't be (B)'.This 'even if' nuance is created by the fact that 〜たところで sentences will never have something in the past tense in the second half of the sentence, despite using the past tense before ところ. This is similar to the English 'even if (A) were to happen, (B) would still not occur'.As can be seen by the examples above, 〜たところで will convey things that are counter to what the speaker either wants to, or wishes would happen. Due to this, the (B) half of the sentence will almost always be something unfavorable.Fun FactDue to 〜たところで always marking some kind of negative result in (B), (A) will often be preceded by words such as 今 さら, いくら, or どんなに. These usually just emphasize the frustration that the speaker feels about the inevitable result.",
    "examples": [
      {
        "japanese": "私が告白したところで、彼女は応じないだろう。",
        "english": "Even if I confessed my love, she wouldn't respond."
      },
      {
        "japanese": "徹夜で勉強したところで、合格しない。",
        "english": "Even if I studied all night, I would not pass."
      },
      {
        "japanese": "すみませんが、今注文をキャンセルしたところで、お金は返金できませんよ。",
        "english": "I am sorry, even if you cancel the order now, we cannot refund your money."
      },
      {
        "japanese": "「いまごろ車に乗って行ったところで間に合いようがない。」",
        "english": "Even if you went by the car right now, you cannot to be on time."
      },
      {
        "japanese": "「謝ってみたところで、 彼女が許してくれるわけじゃないけど。」",
        "english": "'Even if I try to apologize, it doesn' t mean she will forgive me.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たところで",
    "false_friends": [
      {
        "term": "にせよ・にしろ",
        "meaning": "Even if, Even though, No matter, Whether… or",
        "kind": "synonym"
      },
      {
        "term": "たって",
        "meaning": "Even if, Even though, No matter how",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-272"
  },
  "dojg": {
    "grammar_point": "たところで",
    "description": "Even if an action or a state were realised.",
    "meaning": "Even if",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "452",
    "examples": [
      {
        "japanese": "(ks).どんなに低く見積もったところで、工費は五億円を超えるだろう。",
        "english": "No  matter how low we estimate the construction expense it will go beyond 500  million yen."
      },
      {
        "japanese": "(a).この薬を飲んだところで、風邪がすぐ治るわけじゃない。",
        "english": "Even  if you took this medicine, it would not be the case that your cold would be  cured right away."
      },
      {
        "japanese": "(b).この本を読んだところで、日本の経済の全体は分からないだろう。",
        "english": "Even  if you read this book, you wouldn't understand the entire economy of Japan."
      },
      {
        "japanese": "(c).一週間に一度ぐらい運動したところで、あまり効果はないでしょう。",
        "english": "Even  if you exercise once a week, it won't be very effective."
      },
      {
        "japanese": "(d).どんなに頑張ったところで、この科目では優が取れるはずがない。",
        "english": "No  matter how much I worked, it would be impossible to get an A in this course."
      },
      {
        "japanese": "(e).休みに天気が良くなったところで、どこかへ出かける当てもない。",
        "english": "Even  if the weather gets better on the holiday, there is no particular place to go."
      },
      {
        "japanese": "(f).日本語が話せたところで、日本へ行く金もないので、何にもならない。",
        "english": "Even  if I were able to speak Japanese, it wouldn't amount to anything, because I  cannot afford  to go to Japan."
      },
      {
        "japanese": "(g).これ以上話し合ったところで、恐らく無駄でしょう。",
        "english": "Even  if we discussed it more, it would probably be futile."
      },
      {
        "japanese": "(h).問題が起こったところで、君には迷惑はかからない。",
        "english": "Even  if a problem arises, it will not cause you any trouble."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vinformal past\n- ところで\n- 読んだところで\n- Even if someone read something\n- 飲んだところで\n- Even if someone drank something",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: ても】",
    "antonym": "",
    "source": "resources/original/dojg/all/たところで.yaml"
  }
}