{
  "grammar_point": "たとえ〜ても",
  "rank": 4,
  "bunpro": {
    "grammar_point": "たとえ〜ても",
    "jlpt": "N3",
    "meaning": "Even if…is the case, Supposing that",
    "meaning_warning": "Sometimes seen as「たとい」",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "たとえ, coming from例える, a る - Verb meaning 'to speak figuratively', is a word in Japanese that is often used with ても (or でも), in order to present possibilities. たとえ is primarily seen at the beginning of a sentence, before some kind of possibility, comparison, or supposition will be stated.たとえ tends to be used to present situations where 'even if they were true, (B) still may/may not happen'. This is called a 'contrastive' example.もしon the other hand tends to be used for examples in which (A) will directly result in (B). This is called a 'resultative' example.",
    "examples": [
      {
        "japanese": "空手ではたとえ試合で勝っても、ガッツポーズをしてはいけない。",
        "english": "Even if you win in a karate competition, you should not celebrate visibly."
      },
      {
        "japanese": "たとえ暑くても、虫が入ってくるのでこの窓は開けないで下さい。",
        "english": "Even if it is hot, bugs will come in, so please do not open this window."
      },
      {
        "japanese": "たとえ好きでも、そんなことをされたら、嫌いになる。",
        "english": "Even if I like them, if someone says such a thing, I will start to dislike them."
      },
      {
        "japanese": "たとえ電車でも30分はかかる。",
        "english": "Even by train, it will take at least 30 minutes."
      },
      {
        "japanese": "たとえ来年までに完成したとしても、中に入る店が決まっていないから来年中にはオープンされないだろう。",
        "english": "Even if it is completed by next year, the shops that it is going in have not been decided, so it is unlikely that they will open next year."
      },
      {
        "japanese": "もし今年中にモールの工事が終わったら、来年の頭にはオープンするはず。",
        "english": "If the construction for the mall finishes within this year, it should open at the beginning of next year."
      },
      {
        "japanese": "仮令雪が降らなくても、スノーボードをしに行く。",
        "english": "Even if it doesn't snow, I'm going snowboarding."
      },
      {
        "japanese": "仮令彼が太っても力士にならないだろう。彼は相撲向きではないから。",
        "english": "Even if he gains weight, he will never be a sumo wrestler. He's just not cut out for it."
      },
      {
        "japanese": "仮令コーヒーを５杯飲んでも、眠気が取れない。",
        "english": "Even if I drink 5 cups of coffee, I can't get rid of this sleepiness."
      },
      {
        "japanese": "仮令あなたが行かなくても、僕は行きます。",
        "english": "Even if you don't go, I will."
      },
      {
        "japanese": "仮令嬉しくても、笑ってはいけない時もある。",
        "english": "There are times when you cannot laugh, even if you are happy."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たとえ-ても",
    "false_friends": [
      {
        "term": "もしも〜なら・もしも〜でも",
        "meaning": "If, Supposing",
        "kind": "synonym"
      },
      {
        "term": "にしても",
        "meaning": "Even though, Even if, Even when, Also",
        "kind": "synonym"
      },
      {
        "term": "とも",
        "meaning": "Even if, No matter",
        "kind": "synonym"
      },
      {
        "term": "たって",
        "meaning": "Even if, Even though, No matter how",
        "kind": "synonym"
      },
      {
        "term": "にせよ・にしろ",
        "meaning": "Even if, Even though, No matter, Whether… or",
        "kind": "synonym"
      },
      {
        "term": "としても",
        "meaning": "Even if (we assume), Assuming,  Also as",
        "kind": "synonym"
      },
      {
        "term": "ても",
        "meaning": "Even if, Even though",
        "kind": "synonym"
      },
      {
        "term": "もし",
        "meaning": "If (For emphasis)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-269"
  }
}