{
  "grammar_point": "たら〜で",
  "rank": 8,
  "bunpro": {
    "grammar_point": "たら〜で",
    "jlpt": "N1",
    "meaning": "Even if, If",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "たら〜でis an expression that appears with repeating words, and may be used either positively or negatively in order to show that 'if (A), then with (A), (B)'. It is often simply translated as 'even if (A), (B)'.たら〜でmay use either theconjunction particleたら or ば when paired with verbs or い-Adjectives, but will use なら when paired with な-Adjectives.Inたら〜でconstructions, it is important to remember that the nuance will change depending on the first half of the sentence. Basically, the most common interpretations are as follows.In the good situation of (A), the problem of (B) will arise.In the problematic situation of (A), (B) can still be done.So in either case, it can be seen that (B) will be something that is contradictory to (A).CautionIn this meaning,なら〜でwill only ever follow な-Adjectives. If you seeなら〜でfollowing another type of word, then it will be the meaning used for showing dissatisfaction, or telling people what to do.",
    "examples": [
      {
        "japanese": "ニートになったらなったで大変だと思うよ。",
        "english": "Even if you become a NEET, I think it would still be tough."
      },
      {
        "japanese": "明日雨が降れば降ったでなんとかすればいい。",
        "english": "If it rains tomorrow, we can do something about it."
      },
      {
        "japanese": "大きい方が荷物とかいっぱい積めるけど、大きかったら大きいでデメリットがある。",
        "english": "The bigger the car, the more luggage it can carry, but if the car is big, there are many disadvantages."
      },
      {
        "japanese": "力がなくてもできる仕事は沢山あるから、弱ければ弱いでいい。",
        "english": "There are plenty of jobs that can be done even if you are weak."
      },
      {
        "japanese": "嫌なら嫌で、最初っから言ってくれればよかったのに。",
        "english": "If you didn't want to, you should've let me know beforehand."
      },
      {
        "japanese": "好きなら好きで、はっきりと伝えなくちゃ。",
        "english": "If you like them, you have to tell them clearly that you like them. (This grammar point's meaning)"
      },
      {
        "japanese": "辞めるなら辞めるでいいけど、後からやっぱりやめなければよかったとかって言わないでね。",
        "english": "If you want to quit, then go ahead and quit, but don't say later that you wish you hadn't quit after all. (The other なら〜で meaning)"
      },
      {
        "japanese": "「結婚したい。」「結婚したらしたで大変だよ。」",
        "english": "'I want to marry…''Even if you get married, it's (still) tough.'"
      },
      {
        "japanese": "「また子供になりたいな。」「けど、子供になったらなったで子供なりの苦労があるよ」",
        "english": "'I want to be a child again…''But, children have problems of their own even if you become (are) one.'"
      },
      {
        "japanese": "「金は沢山あったらあったで悩みも増えるものだよ。」「それはそうだけど、でも、なかったらないで困るでしょ。」",
        "english": "'Even if you have a lot of money, problems will also multiply.''That might be right, but even if you don't have any, then it's (still) troublesome.'"
      },
      {
        "japanese": "「もし失敗したら失敗したで、また最初からやり直そうと思う。」",
        "english": "'Even if I fail, I will do it again from the beginning.'"
      },
      {
        "japanese": "「ったく、いつも、彼は、雨が降ったら降ったで『外に出かけられない』と文句を言うし、晴れたら晴れたで「暑い暑い」と文句を言う。」",
        "english": "'Good grief, if it rains, he always complains that he cannot go outside, and if it's sunny he always complains that it's really hot.' (even if)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たら-で",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-284"
  }
}