{
  "grammar_point": "たことがある",
  "rank": 0,
  "bunpro": {
    "grammar_point": "たことがある",
    "jlpt": "N5",
    "meaning": "Have done before",
    "meaning_warning": null,
    "details": {
      "Part of Speech": "Verb",
      "Register": "Standard",
      "品詞": "表現",
      "単語の種類": "動詞",
      "使用域": "一般"
    },
    "writeup": "たことがある is a set expression in Japanese that is used for saying that 'there has been a time that I have done (A)'.The auxiliary verb た will be added to the verb indicating what you have done, followed by こと - が - ある . Like の , こと is regularly used for nominalization (creating a noun-like phrase). However, の cannot replace こと in this particular grammar pattern.From these examples, we can see that ない (the negative equivalent of ある ) may also be used, when you want to express that you have 'never' done something.CautionJust like English, many set phrases cannot be adjusted in Japanese (in the same way that こと cannot be swapped with の in this expression).Fun FactIn expressions where こと is followed by a verb phrase, の may not be used. When used for nominalization, の is almost always followed by a noun or adjective phrase. Here are some examples.",
    "examples": [
      {
        "japanese": "彼は踊ることができる。",
        "english": "He can do things like dance."
      },
      {
        "japanese": "来週は休みだから旅行へ行くことにする。",
        "english": "Because I have no work next week, I have decided to go traveling."
      },
      {
        "japanese": "今日は帰るのが遅くなることになる。",
        "english": "Today, I will end up coming home late."
      },
      {
        "japanese": "ここでサッカーをしたことがありますか。",
        "english": "Have you ever played soccer here before?"
      },
      {
        "japanese": "日本に行ったことがありますか。",
        "english": "Have you ever been to Japan before?"
      },
      {
        "japanese": "この本を読んだことがある。",
        "english": "I have read this book before."
      },
      {
        "japanese": "私の家を見たことがありますか。",
        "english": "Have you ever seen my house before?"
      },
      {
        "japanese": "６時前に起きたことがない。",
        "english": "I have never woken up before six o'clock."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たことがある",
    "false_friends": [
      {
        "term": "たものだ",
        "meaning": "Used to",
        "kind": "synonym"
      },
      {
        "term": "ことがある",
        "meaning": "Something is possible, Sometimes, Occasionally, There are times when",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-263"
  }
}