{
  "grammar_point": "たった(の)",
  "rank": 6,
  "bunpro": {
    "grammar_point": "たった(の)",
    "jlpt": "N2",
    "meaning": "Only, Just, No more than",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "たったis a common adverb in Japanese that originates from an emphasized alteration of唯'only', 'merely'.たったkeeps the same meaning of ただ in that it just expresses that something is 'only (A)', 'just (A)', or 'no more than (A)'.This nuance is usually used when the actual number of (A) is exceptionally low compared to the speaker's expectation of anticipation.たったwill often appear at the beginning of sentences, and will either modify the whole sentence, or a specific number when followed by の and then that number.Asたったis an adverb that is usually used for emphasis, it often accompanies other similar grammar patterns like だけ, しか, etc.Fun-fact - The common expression ただいま 'now', or 'I'm home' may occasionally be seen in the emphasized formたったいま. This is primarily when the meaning is 'now', or 'just now' (right at this present moment), rather than 'I'm home'.",
    "examples": [
      {
        "japanese": "先輩、たった今東京駅に着きました。",
        "english": "Senpai, I arrived at Tokyo station just now."
      },
      {
        "japanese": "僕、たった一人でここまで歩いてきたのかい?偉いね！",
        "english": "Kid, you walked here all alone? I'm proud of you!"
      },
      {
        "japanese": "クラスメイト全員を招待したのに、たったの３人しか僕の誕生日パーティーにこなかった。",
        "english": "I invited everyone in my class, but only 3 people showed up to my birthday party."
      },
      {
        "japanese": "このホテルからビーチまでの距離はたったの１０メートルです！",
        "english": "It's merely 10 meters in distance from this hotel to the beach!"
      },
      {
        "japanese": "その電車はたった今出発したので次の電車が来るまで少々お待ちください。",
        "english": "That train has just departed, so please wait until the next train arrives."
      },
      {
        "japanese": "友達１：「千円貸してくれる?」友達２：「たった５００円しかないよ。」",
        "english": "Friend1: 'Can you lend me 1000 yen?'Friend2: 'I only have 500 on me.'"
      },
      {
        "japanese": "そうまさん：「ケーキ、出来ました。」えりなさん：「え、たった５分で出来たの?！」",
        "english": "Souma: 'The cake is done.'Erina: 'Wha?! You finished it just in 5 minutes?!'"
      },
      {
        "japanese": "自分の子供について、母親：「ケビンはずっと、たったひとりで家にいた！！」",
        "english": "Mother, about her son: 'Kevin was at home all alone the whole time!'"
      },
      {
        "japanese": "ライフスタイルに関するウェブニュースのタイトル名：「お母さんはたった６６５円で食べ放題！母の日プレゼント」",
        "english": "Title of a web-news article in relation to lifestyle: 'The moms' all-you-can-eat is just 665 yen! Mother's Day present.'"
      },
      {
        "japanese": "「彼はたった1人の兄弟です。」",
        "english": "'He is my only sibling.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たった-の",
    "false_friends": [
      {
        "term": "僅かに",
        "meaning": "Only, Slightly, A little, Barely, Merely",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-266"
  }
}