{
  "grammar_point": "たとえば",
  "rank": 2,
  "bunpro": {
    "grammar_point": "たとえば",
    "jlpt": "N4",
    "meaning": "For example",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "たとえば(or例えばin its kanji form) is an adverb in Japanese that is used at the beginning of a sentence, or an individual statement, in order to present an example. It can be translated almost directly as 'for example'.Fun Fact例えばshould primarily be used when the 'example' that is being given is as simple as possible. If you want to explain something in further (in-depth) detail,詳しく 'in full' would be used as the adverb instead.",
    "examples": [
      {
        "japanese": "たとえば、ドイツとかは?",
        "english": "For example, how about Germany, or something?"
      },
      {
        "japanese": "たとえば、冷たい物を食べたときに歯が痛いです。",
        "english": "For example, my teeth hurt when I eat cold things."
      },
      {
        "japanese": "詳しく言うと、トマトのように種がいっぱいある食べ物が嫌いです。",
        "english": "More specifically, I don't like foods that have a lot of seeds, like tomatoes."
      },
      {
        "japanese": "たとえば、「英語が好きですか。」と聞いてみたら?",
        "english": "For example, why don't you ask 'Do you like English?'"
      },
      {
        "japanese": "たとえば毎日日本語を話すなら、日本語のレベルが上がる。",
        "english": "For example, if you speak Japanese every day, your Japanese level will rise."
      },
      {
        "japanese": "私は、たとえばあそこにあるイタリアンレストランのような店を作りたい。",
        "english": "For example, I want to make a restaurant like that Italian restaurant over there."
      },
      {
        "japanese": "色々な国に行って見たい。たとえば、ベトナム。",
        "english": "I want to go to a variety of countries. Vietnam for example."
      },
      {
        "japanese": "子供のころ何でも食べることが出来た。たとえば、納豆が好きだった。",
        "english": "When I was a child, I could eat anything. I liked Natto for example."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/たとえば",
    "false_friends": [
      {
        "term": "とか〜とか",
        "meaning": "Among other things, For example, Such as",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-270"
  }
}