{
  "grammar_point": "だの",
  "rank": 9,
  "bunpro": {
    "grammar_point": "だの",
    "jlpt": "N1",
    "meaning": "Things like, And so on, Or something, And whatnot",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Although originally a combination of theauxiliary verbだ, and the case-marking particle の,だのis considered to be a standaloneadverbial particlein modern Japanese that is used in the same way as structures like など and とか in presenting examples. Due to this, it will often be translated as 'and things like (A)', or '(A) and whatnot'.だのwill only be used when at least two examples are given, with each of those examples being followed byだの. Usually, these two things are either opposites of each other, or two things that share the same negative trait.だのmay appear after verbs, い-Adjectives, nouns, or quotations.CautionIn situations where the words thatだのis attached to are opposites, it will be exhibiting a large range to which the same rule applies. However when the words are similar, it is usually expressing things within that specific category as being undesirable. Because of this, regardless of what the words are, the overall statement itself aims to emphasize the speaker's feelings of frustration or boredom in relation to things that fall under that category, or that scope.",
    "examples": [
      {
        "japanese": "彼は仕事はやめるだの家事を手伝わないだの、本当に自分以外のことは何も考えていない。",
        "english": "He does things such as quit work, and not help with chores and so on. He really does not think about anyone other than himself."
      },
      {
        "japanese": "この建物は汚いだの危ないだのと近所の人に言われていたので解体されるらしい。",
        "english": "The neighbor has been saying that this building is dirty, dangerous and what not so apparently it is going to get demolished."
      },
      {
        "japanese": "揚げ物だのコンビニ弁当だのばかり食べてると、また健康診断の時に先生に怒られるよ。",
        "english": "If you only eat things like fried food, convenience store food and what not, you are going to get told off by your doctor again at the next check-up."
      },
      {
        "japanese": "妻は大嫌いだの嫌いだのと毎日言ってくるから悲しくなってきた。",
        "english": "My wife tells me that she hates me and dislikes me and what not everyday so I am starting to feel sad."
      },
      {
        "japanese": "彼は「嫌」だの「大変」だの、何かをやる前から弱音を吐くから、一緒にいるとこっちまで仕事をしたくなくなる。",
        "english": "He only says things like 'No' and 'impossible' even before trying anything, so it even makes me not want to work."
      },
      {
        "japanese": "そんなに好きだの嫌いだのと言うんだったら明日から自分でご飯作りな。",
        "english": "If you are going to say things like 'I like this', 'I don't like this', and things like that, why don't you start making your own food starting tomorrow? (Opposite ends of a spectrum)"
      },
      {
        "japanese": "あの新入社員はつらいだの面倒だのの理由で会社を入社して二週間でやめた。",
        "english": "That newbie said things like 'this is too much', and 'this is a pain' and gave a reason similar to that and ended up quitting after 2 weeks of working with us. (Both negative)"
      },
      {
        "japanese": "ヒナは「臭い」だの「まずい」だのと文句ばかりを言っている。",
        "english": "Hina only complains that 'it smells' or 'it's awful' and so on."
      },
      {
        "japanese": "ラーメンやカレーが嫌いな人：「ラーメンだのカレーだのが好きなやつは味のわからんやつだよ。」",
        "english": "A person that hates ramen and curry: 'People who like things like ramen, curry, and so on are people who don't understand what taste is.'"
      },
      {
        "japanese": "友達１は友達２に文句を言う：「私たちは最近会話だの何だのばかりしているけど、実際に新製品を開発する人はいないよ。」",
        "english": "Friend1 complains to friend2: 'Recently we are doing nothing but shooting the breeze (chatting) and whatnot, but there is no one that will actually develop a new product.'"
      },
      {
        "japanese": "彼はゲームに負けるといつも「回線が悪い」だの「敵がチート」だのと言い訳ばかり言う。",
        "english": "Every time he loses a game, he just gives excuses things like 'there's a bad connection' or 'the other players are cheating' and whatnot."
      },
      {
        "japanese": "彼はいつも責任を持つだの何だの戯言ばかり言ってるけど、責任を取る時に、真っ先に逃げるのは彼だ。",
        "english": "He always talks nonsense about 'being responsible' and so on, but when it comes time to take responsibility he is the first to run."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/だの",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-308"
  },
  "dojg": {
    "grammar_point": "だの",
    "description": "A conjunction that lists nouns/quotes inexhaustively.",
    "meaning": "And (~ and); or (~ or); and things like that",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "57",
    "examples": [
      {
        "japanese": "(ksa).庭にはすみれだのチューリップだのつつじだの、花がたくさん咲いていた。",
        "english": "In the garden, many ﬂowers such as pansies, tulips, azaleas and  others, were in bloom."
      },
      {
        "japanese": "(ksb).学生たちは食堂のご飯がまずいだの、授業がつまらないだのと、いつも不平を言っている。",
        "english": "The students are always complaining that the food at the  cafeteria isn't good, or their classes are boring and so on."
      },
      {
        "japanese": "(a).僕はそばだの、うどんだの、ラーメンだのといった麺類が大好きだ。",
        "english": "I like noodles such as soba, udon and ramen."
      },
      {
        "japanese": "(b).今の高校生は携帯電話だのコンピュータゲームだのにはまっている。",
        "english": "High school students now are addicted to things like cell  phones and computer games."
      },
      {
        "japanese": "(c).彼は僕が飲みに行こうかと誘っても、いつも頭が痛いだの、約束があるだのと言い訳をする。",
        "english": "Whenever I invite him to go out for a drink, he has an excuse:  he's got a headache or another appointment or something."
      },
      {
        "japanese": "(d).彼女は仕事が好きだから結婚しても仕事を続けるだの、家庭生活と職業を両立できるだのと主張していた。",
        "english": "She used to claim that she would keep working after she got  married because she liked her work and could manage both family life and her  career."
      },
      {
        "japanese": "(e).彼女は自分がテニスが上手だの、ピアノがうまいだのと自慢ばかりしている。",
        "english": "She's always boasting that she's good at tennis and (also good  at) piano, and things like that."
      },
      {
        "japanese": "(f).受験生たちは塾だのテストだのと忙しい毎日を送っている。",
        "english": "Students preparing for the examination are spending busy days  stuffed with cram school and tests."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun1\n- だのNoun2だの(Noun3だの)\n- そばだの、うどんだの、寿司だの\n- Soba and undon and sushi, and things like that\n- (ii){V/Adjectiveい}1 informal\n- だの{V/Adjectiveい}2 informalだの\n- 疲れるだのお腹が空くだのと\n- Saying that someone gets tired or hungry, and things like that\n- 疲れただのお腹が空いただのと\n- Saying that someone got tired or hungry, and things like that\n- 暑いだの、雨が多いだのと\n- Saying that it is hot or it rains too much, and things like that\n- 暑かっただの、雨が多かっただのと\n- Saying that it was hot or it rained too much, and things like that\n- (iii){Adjective な stem/Noun}{∅/だった}\n- だの{Adjective な stem/Noun}{∅/だった}だのと\n- 不健康{∅/だった}だの、非衛生的{∅/だった}だのと\n- Saying that something is/was unhealthy and unhygienic, and so on\n- バカ者{∅/だった}だの、腑抜け{∅/だった}だのと\n- Saying that someone is/was a fool or and idiot, among other things",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: とか; や】",
    "antonym": "",
    "source": "resources/original/dojg/all/だの.yaml"
  }
}