{
  "grammar_point": "だけに",
  "rank": 8,
  "bunpro": {
    "grammar_point": "だけに",
    "jlpt": "N2",
    "meaning": "As might be expected, Because, All the more because, It's only natural",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "だけにis a grammar pattern that is often translated as 'as might be expected of (A)', 'it's only natural due to (A)', or simply 'because of (A)'. Being a combination of だけ 'just', and に 'to', the literal meaning is 'just in that it's (A)', and is similar to the counterpart phrase in English.だけにmay be used when highlighting either positive or negative results that came about due to (A), and will appear after verbs, い-Adjectives, な-Adjectives that have been followed by な, or nouns.Also,だけにmay be used when highlighting that specifically because of (A), (B) is considered a level above what would usually be expected. This can be in terms of difficulty, emotional reaction, volume, or anything else that is quantifiable.Fun-fact - With any of these meanings, the equivalent 'just in that it's (A)' English expression can be utilized as an accurate interpretation, as both it and だけに often just draw the listener's attention to (A), in order to show that (B) is noteworthy because of it.",
    "examples": [
      {
        "japanese": "トムさんは日本語を8年勉強しているだけに、日本語がペラペラだ。",
        "english": "Tom has been studying Japanese for 8 years and as one might expect, he is fluent in Japanese."
      },
      {
        "japanese": "このアパートは東京駅に近いだけに、家賃が高い。",
        "english": "This apartment is very close to Tokyo station, and as one might expect, the rent is expensive."
      },
      {
        "japanese": "このアプリは便利なだけに、どんどんとユーザーが増えてきています。",
        "english": "This application is becoming more and more popular just because it is so useful."
      },
      {
        "japanese": "夏休みであるだけに、海水浴場には人がたくさんいる。",
        "english": "It is summer vacation and as one might expect, there are a lot of people at the beach."
      },
      {
        "japanese": "合格したと思っていただけに、不合格と知った時はとてもショックだった。",
        "english": "I was very shocked when I learned that I had been rejected because I thought I had passed."
      },
      {
        "japanese": "普段は優しいだけに、彼女が怒っている姿を見た時はびっくりしました。",
        "english": "I was surprised to see her angry because she is usually so kind."
      },
      {
        "japanese": "彼は子供の頃からそろばんを習っているだけに、暗算がとてもうまい。",
        "english": "Just in that he has been learning the abacus since childhood, he is very good at mental math."
      },
      {
        "japanese": "この車は最新だけに、椅子のヒーターもあります。",
        "english": "This is a brand new car and as one might expect, it comes with heated seats."
      },
      {
        "japanese": "年を取ってきただけに、出来なくなったことが多い。",
        "english": "As one might expect with aging, there are a lot of things you can no longer do."
      },
      {
        "japanese": "彼は経験が長いだけに、自信を持って演説ができた。",
        "english": "As one might expect from his extensive experience, he confidently gave the speech."
      },
      {
        "japanese": "彼は有名な司会者だけに、臨機応変に対応できます。",
        "english": "As one might expect from him being a famous moderator, he can adapt himself to deal with it."
      },
      {
        "japanese": "プロ棋士だけに、将棋との向き合い方が半端じゃない。",
        "english": "As one might expect from a professional shogi player, the way he approaches the game is not careless."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/だけに",
    "false_friends": [
      {
        "term": "わけだ",
        "meaning": "For that reason, No wonder, As you'd expect, Naturally, Thus, This is why",
        "kind": "synonym"
      },
      {
        "term": "だけあって",
        "meaning": "Is only natural, …Being the case, Because, As might be expected",
        "kind": "synonym"
      },
      {
        "term": "だけのことはある",
        "meaning": "No wonder, Not surprising that, As expected",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-300"
  },
  "dojg": {
    "grammar_point": "だけに",
    "description": "A phrase that carries the idea “as one would expect”.",
    "meaning": "And as one would expect; so (naturally); because",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "47",
    "examples": [
      {
        "japanese": "(ksa).ビルは元フットボール選手だけに足が速い。",
        "english": "Bill used be a football player and, as one would expect, he  runs fast."
      },
      {
        "japanese": "(ksb).ホワイトさんは長い間日本に住んでいただけに日本のことをよく知っている。",
        "english": "Mr. White lived in Japan for a long time, so naturally he is very  familiar with things related to Japan."
      },
      {
        "japanese": "(a).彼は元アナウンサーだけに声がよく通る。",
        "english": "He used to be an announcer, so naturally his voice carries  well."
      },
      {
        "japanese": "(b).山内先生は英語の先生だっただけに英語の文法をよく知っている。",
        "english": "As one would expect from her having been an English teacher,  Ms. Yamauchi is very knowledgeable about English grammar."
      },
      {
        "japanese": "(c).雅人は一人っ子だけについ甘やかしてしまう。",
        "english": "Masato is our only child and, as you might expect, we tend to  spoil him (without meaning to)."
      },
      {
        "japanese": "(d).孝夫は学生時代に相撲をやっていただけに体が大きい。",
        "english": "Takao was a sumo wrestler when he was a student, so naturally  he is big."
      },
      {
        "japanese": "(e).チェンさんはアメリカの大学を卒業しただけに英語が上手だ。",
        "english": "Ms. Chen graduated from an American university, so naturally  her English is good."
      },
      {
        "japanese": "(f).ハリスさんは日本の大学で長い間教えていただけに日本の大学の問題をよく知っている。",
        "english": "Mr. Harris taught at a university in Japan for a long time so,  as one would expect, he knows a lot about the problems of Japanese  universities."
      },
      {
        "japanese": "(g).春樹はジャズが何よりも好きなだけにジャズ・ミュージシャンの名前をよく知っている。",
        "english": "Haruki likes jazz more than anything, so naturally he knows the  names of many jazz musicians."
      },
      {
        "japanese": "(h).彼女がとても忙しいことをよく知っているだけに、彼女にはこの仕事を頼みにくい。",
        "english": "Because we know she's very busy, it's hard to ask her to do  this job."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Vinformal\n- だけに\n- {教えている/教えていた}だけに\n- Someone is/was teaching and as one would expect\n- (ii)Adjective い informal\n- だけに\n- {若い/若かった}だけに\n- Someone is/was young and as one would expect\n- (iii)Adjective な stem {な/だった}\n- だけに\n- 上手{な/だった}だけに\n- Someone is/was good at something and as one would expect\n- (iv)Noun {Ø/だった}\n- だけに\n- 先生{Ø/だった}だけに\n- Someone is/was a teacher and as one would expect",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: だけあって】",
    "antonym": "",
    "source": "resources/original/dojg/all/だけに.yaml"
  }
}