{
  "grammar_point": "だいたい",
  "rank": 2,
  "bunpro": {
    "grammar_point": "だいたい",
    "jlpt": "N4",
    "meaning": "Most・mostly, Adequately・generally, For the most part, Roughly・approximately, In the first place",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "大体is an adverb that is used to highlight the 'main point' of something in Japanese, and therefore has several different nuances.大体will regularly be translated as 'mostly', 'generally', or 'for the most part'.As with other adverbs that highlight amounts,大体can be used to modify entire phrases, or can be used directly before a noun as大体の+noun.In a similar way to そもそも, a noun/adverb which means 'in the first place',大体can also have this meaning. This nuance is frequently quite obvious, as the rest of the sentence will highlight a desired outcome that unfortunately did not happen.Although these 2 primary uses of大体may seem quite different, they are both just expressing what is 'essentially' correct, most common, the original, etc.Fun FactA common synonym for大体is根本, a noun which means 'the source', or 'the origin' or something. In this way,大体just expresses the way something is, without receiving any alterations (regardless of whether any subsequent alterations are positive or negative). This is where the 'in essence' meaning comes from.",
    "examples": [
      {
        "japanese": "だいたいでいいから何時くらいに着くか教えて。",
        "english": "Since a general time is okay, can you let me know around when you will arrive?"
      },
      {
        "japanese": "水曜日はだいたい5時に起きています。",
        "english": "On Wednesdays, I generally wake up at 5 am."
      },
      {
        "japanese": "だいたいの人たちが薔薇という漢字を書けません。",
        "english": "Most people do not know how to write the kanji 'bara'. (薔薇 is the kanji for 'rose')"
      },
      {
        "japanese": "だいたいなんでお前がここにいるの?",
        "english": "Why are you here in the first place? (No one wants you here)"
      },
      {
        "japanese": "と言うことは私たちが言っていることはだいたい一緒なのね。",
        "english": "In that case, what we are both saying is the same in essence."
      },
      {
        "japanese": "「日本語が大体わかる。」",
        "english": "'I roughly understand Japanese.' (for the most part)"
      },
      {
        "japanese": "焼きたてパンについて話しているカップル、彼女：「どう?」彼氏：「大体いいと思うんだけど、」",
        "english": "Couple talking about freshly baked bread: Girlfriend: 'How is it?'Boyfriend: 'I think it is mostly good, but…'"
      },
      {
        "japanese": "「彼女は大体の状況を知っています。」",
        "english": "'She has the general idea of the situation.' (adequate・mostly)"
      },
      {
        "japanese": "電話にでている子供：「父は大体５時ごろ帰ります。」",
        "english": "Child answering the phone: 'Dad usually comes home around 5.'"
      },
      {
        "japanese": "このサイトにいる人は、大体真面目な人だと思う。外国語を学ぶときはそれが必要だからね。",
        "english": "I think that people on this site are mostly diligent. Because you need that when learning a foreign language. (generally)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/だいたい",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-292"
  }
}