{
  "grammar_point": "ったらない・といったらない",
  "rank": 9,
  "bunpro": {
    "grammar_point": "ったらない・といったらない",
    "jlpt": "N1",
    "meaning": "Cannot tell, describe, say or express how, Words cannot express, Too … for words, Extremely",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "といったらないis a casual expression used when something is at a level such that not even (A) is sufficient to describe it. It is usually translated as 'there are no words to express (A)', or 'too (A) for words'. This structure is a combination of the case-marking particle と, theconjunction particleたら 'when', or 'if', and the い-Adjective ない. It may be used in either positive or negative contexts.といったらない, or the shortened formったらないmay appear after adjectives or nouns in theirstandard forms.The ない in this grammar pattern is commonly thought to be an abbreviation of ありはしない, or ありゃしない, theconjunctive formof the う-Verb ある combined with thecase marking particleは, and the negated form of する, しない. In this way, a more literal meaning can be thought of as 'if one were to say (A), it's not possible'.CautionAs this expression highlights an extreme amount, い-Adjectives will often be used with the さsuffixadded, specifically to indicate amount.",
    "examples": [
      {
        "japanese": "隣の人の犬は朝からうるさいといったらない。",
        "english": "I can't describe to you how loud my neighbor's dog is in the morning."
      },
      {
        "japanese": "息子を家で留守番させるのは心配といったらない。",
        "english": "I can't tell you how worried I am to let my son stay at home alone."
      },
      {
        "japanese": "プロジェクトを終わらせた後の達成感ったらない。",
        "english": "I can't describe the feeling of accomplishment after finishing a project."
      },
      {
        "japanese": "あの子の運転は危ないといったらありゃしないから、あの子と出かける時には運転させないようにしている。",
        "english": "I can't describe how bad her driving is. I always make sure not to let her drive when we go somewhere."
      },
      {
        "japanese": "田舎では車がないとどこにもいけないから、不便といったらありゃしない。",
        "english": "I can't describe to you how inconvenient the countryside is. You can't go anywhere without a car."
      },
      {
        "japanese": "彼女は私の話を全然聞いてくれない。むかつくといったらありゃしない。",
        "english": "She does not listen to a word I say. I can't describe to you how annoyed I am."
      },
      {
        "japanese": "あの人の優しさと言ったらありゃしない。",
        "english": "I can't describe how nice he is."
      },
      {
        "japanese": "「校長と鹿との戦いを見たときの驚きといったらないよ。」",
        "english": "'I can't describe my surprise at seeing a fight between the principal and a deer.'"
      },
      {
        "japanese": "「車のタイヤが盗まれた。本当に腹が立つったらない。」",
        "english": "'My car tires have been stolen. I can't tell you how angry I am!'"
      },
      {
        "japanese": "A：「歯を引っこ抜くのはどうだった?」B：「あの痛みといったらないわよ、本気で死ぬかと思ったもの。」",
        "english": "A: 'How was the tooth extraction?'B: 'I can't tell you how painful it is! I really thought I was going to die.'"
      },
      {
        "japanese": "数年が経ったのにまだあの日の日没を覚えている。その景色の美しさと言ったらなかった。",
        "english": "Even though years have passed, I can still remember the sunset that day. I couldn't describe the beauty of the scene in words."
      },
      {
        "japanese": "メークした時の星野の変わり様と言ったらなかった。まるで別人のようだった。",
        "english": "I couldn't describe how much Hoshino has changed when she put on the makeup. She was like a different person."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ったらない・といったらない",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-317"
  },
  "dojg": {
    "grammar_point": "(と言)ったらない",
    "description": "A phrase used to express a strong sensation or emotion.",
    "meaning": "So; extremely; indescribably; indescribable; incredibly; awfully; terribly; cannot tell you/describe/etc. how; too much of",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "678",
    "examples": [
      {
        "japanese": "(ksa).つまらないミスで試合に負けて悔しい(と言)ったらない。",
        "english": "I'm so mortiﬁed because I lost the game due to a stupid mistake."
      },
      {
        "japanese": "(ksb).老眼が進んで眼鏡なしでは近くの字が読めないので、不便(と言)ったらない。",
        "english": "My farsightedness has gotten worse so I can't read words up close without my glasses—it's so inconvenient!"
      },
      {
        "japanese": "(ksc).大きな書類を保存するのを忘れてコンピュータがフリーズした時の情けなさ(と言)ったらない。",
        "english": "The miserable feeling you get when the computer freezes and you forgot to save a large ﬁle is indescribable."
      },
      {
        "japanese": "(ksd).この辞書は使いにくいこと(と言)ったらない。",
        "english": "This dictionary is incredibly hard to use."
      },
      {
        "japanese": "(a).5分ごとにジェット機が離陸するのでうるさいと言ったらない。",
        "english": "There's a jet taking off every ﬁve minutes—I can't even describe (to you) how noisy it is."
      },
      {
        "japanese": "(b).いつもよくしゃべる俊子が慎一の前で赤くなって何も言えないので、おかしいったらなかった。",
        "english": "It was so funny to see Toshiko, who is usually talkative, blush  and turn speechless in front of Shin'ichi."
      },
      {
        "japanese": "(c).ティムにデートをすっぽかされて頭に来るったらない。",
        "english": "Tim stood me up, and that makes me so mad."
      },
      {
        "japanese": "(d).この仕事は一日中細かい字を見ているので目が疲れると言ったらない。",
        "english": "Because I look at small print all day for this job, my eyes get  awfully tired."
      },
      {
        "japanese": "(e).出張したところはインターネットも携帯も使えず、不便と言ったらなかった。",
        "english": "In the area where I went on my business trip I couldn't use the  Internet or my cell phone; I can't tell you how inconvenient it was."
      },
      {
        "japanese": "(f).プロジェクトに変更があるたびに関係者全員に知らせた上で承認を得なければならないので、面倒と言ったらない。",
        "english": "Every time there is a change to the project, we have to notify  everybody involved and get their approval, so it is incredibly tiresome."
      },
      {
        "japanese": "(g).夏、暑い外から帰ってきた後の冷えたビールのうまさったらない。",
        "english": "In summer, the taste of a cold beer is indescribably good after  coming in from the heat outside."
      },
      {
        "japanese": "(h).この国ではインターネットが自由に使えないので、その不便さったらない。",
        "english": "In this country we cannot use the Internet freely, so it's so  inconvenient."
      },
      {
        "japanese": "(i).ハイヒールで砂利道を歩かされたので歩きにくいことと言ったらなかった。",
        "english": "I had to walk on gravel in high heels, and I can't tell you how  hard it was!"
      },
      {
        "japanese": "(j).雪に覆われた山々が早朝の朝日を受けて宝石のように輝く姿の美しいことと言ったらない。",
        "english": "When the snow-covered mountains receive the early morning sun  and sparkle like gems, they are indescribably beautiful."
      },
      {
        "japanese": "(k).昔、痛風にかかったことがあるが、その痛みと言ったらなかった。",
        "english": "I've suffered from gout before; the pain was indescribable."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjectiveい}informal nonpast\n- (と言)ってらない\n- 腹が立つ(と言)ってらない\n- (I’m) so mad\n- つまらない(と言)ってらない\n- (It’s) so boring\n- (ii)Adjectiveなstem\n- (と言)ってらない\n- 退屈(と言)ってらない\n- (I’m) so bored\n- (iii)Adjective(い/な)さ\n- (と言)ってらない\n- その面白さ(と言)ってらない\n- (something is) so interesting\n- その下手さ(と言)ってらない\n- (someone is) so bad at it\n- (iv)Vinformal nonpast\n- こと(と言)ってらない\n- 疲れること(と言)ってらない\n- Something is so tiring\n- (v)Adjectiveいinformal nonpast\n- こと(と言)ってらない\n- 美味しいこと(と言)ってらない\n- Something is so delicious\n- (vi)Adjectiveなstemなこと\n- (と言)ってらない\n- 新鮮なこと(と言)ってらない\n- Something is so fresh",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: 本当に; て仕方がない; て堪らない】",
    "antonym": "",
    "source": "resources/original/dojg/all/(と言)ったらない.yaml"
  }
}