{
  "grammar_point": "っこない",
  "rank": 6,
  "bunpro": {
    "grammar_point": "っこない",
    "jlpt": "N2",
    "meaning": "There is no chance of, There is no way of, Impossible",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "っこないis a combination of thesuffixっこ, and the い-Adjective ない. When attached to theconjunctive formof verbs, it creates new い-Adjectives that express the impossibility of (A). (A) being whichever verb is used.Common translations of っこない include 'there is no chance of (A)', or 'doing (A) is impossible'.Caution - Although extremely rare, as っこ stems from the kanji子, this grammar point may occasionally be seen in its kanji form.",
    "examples": [
      {
        "japanese": "今年中に30万円貯めたいの?お前の給料じゃできっこないよ。",
        "english": "You want to save up three hundred thousand yen this year? There's no chance you can with your salary."
      },
      {
        "japanese": "どんなに鍛えてもあの人だけには勝てっこないよ。",
        "english": "No matter how much I train, there's no chance that I can beat him."
      },
      {
        "japanese": "あんなデカい家、どんなに貯金しても買えっこないよ。",
        "english": "I will not be able to buy a house that big, no matter how much I save."
      },
      {
        "japanese": "明日までに５ページのレポートとか、絶対書けっ子ないよ。",
        "english": "There is no way that I can write a 5 page essay by tomorrow."
      },
      {
        "japanese": "こんな漢字だらけの新聞なんて読めっ子ない。",
        "english": "There is no way I can read this newspaper that is filled with kanji."
      },
      {
        "japanese": "練習をたくさんしなくては、楽器の演奏なんかできっこない。",
        "english": "If you do not practice a lot, there is no way you will be able to do a musical performance."
      },
      {
        "japanese": "日本語で書かないと日本語の書き方が分かりっこない。",
        "english": "If you do not write in Japanese, there is no way you will understand how to write in it."
      },
      {
        "japanese": "怒ったお母さん：「ひきこもりのように、一日中家でゲームしてばかりでは、何も成し遂げっこない。」",
        "english": "Angry mother: 'There is no way you are going to accomplish anything if you are just sitting at home, playing games like a hikikomori.'"
      },
      {
        "japanese": "A：「試験は明日だよ！」B：「明日?明日までに資料全部なんて読めっこない。」",
        "english": "A: 'The exam is tomorrow!'B: 'Tomorrow? There is no chance of me reading all of the material by tomorrow.'"
      },
      {
        "japanese": "どんなに勉強したって「は」と「が」の違いなんて分かりっこない。",
        "english": "No matter how much I study, there is no way for me to understand the difference between 'は' and 'が'."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/っこない",
    "false_friends": [
      {
        "term": "そうもない",
        "meaning": "Very unlikely to, Does not seem that, Does not appear that",
        "kind": "synonym"
      },
      {
        "term": "ようがない・ようもない",
        "meaning": "There's no way to, It's impossible to",
        "kind": "synonym"
      },
      {
        "term": "そうにない",
        "meaning": "Unlikely to, Showing no signs of",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-315"
  }
}