{
  "grammar_point": "ってば・ったら",
  "rank": 8,
  "bunpro": {
    "grammar_point": "ってば・ったら",
    "jlpt": "N1",
    "meaning": "I said...!, I told you...!, !",
    "meaning_warning": "Originates in contraction of と言えば・と言ったら。",
    "details": {
      "Register": "Casual",
      "使用域": "タメ語"
    },
    "writeup": "ってばandったらare often used in casual Japanese to insist the speaker's own viewpoint or opinion about something. The structures are frequently translated as 'I said (A)!', or 'I told you (A)!'.ってばandったらare contractions of といえば 'if it were said', and といったら 'if it were said' respectively. In these cases, the literal meaning is very similar to the English 'didn't I say (A)!?' when used sarcastically or aggressively.Eitherってばorったらmay follow just about any word, but will require a だ to precede them when coming afternounsor な-Adjectives.Cautionってばandったらmay also directly follownounswithout だ. In these cases, thenounis generally a person (perhaps the speaker themselves), and the translation will be 'oh that (A)', 'that darn (A)'. (A) will primarily be people that the speaker is quite familiar with, and they are expressing some kind of real or playful frustration.",
    "examples": [
      {
        "japanese": "分かったってば！何回も言われると本当むかつくからちょっと黙ってて。",
        "english": "I said I got it! You telling me the same thing (repeatedly) is getting on my nerves so can you please be quiet for a little bit?"
      },
      {
        "japanese": "痛いったら！なんでずっと痛いって言ってるのに何回も何回もフォークでつついてくるの?",
        "english": "I said that hurts! Why do you keep poking me with a fork even when I say that it hurts?"
      },
      {
        "japanese": "嫌いだってば！あんな奴なんて大嫌いだ！",
        "english": "I said I don't like them! I don't like such people!"
      },
      {
        "japanese": "だから、俺は大人だったら！背が低いからってひどいぞ本当に。",
        "english": "For the last time, I said that I am an adult. It is kind of mean to say such things just because I am short."
      },
      {
        "japanese": "金太郎ってば、またエアコンつけっぱなしで家出てったよ。",
        "english": "That darn Kintaro, he went out with his AC still running."
      },
      {
        "japanese": "あなたったら本当におっちょこちょいね。",
        "english": "Oh you, you are such a clutz aren't you."
      },
      {
        "japanese": "犬が飼い主を舐めている、飼い主：「アカマル、やめろ！」舐めまわされること1分後、飼い主：「やめろってば！」",
        "english": "A dog licking their owner, pet owner: 'Akamaru, stop!'One minute of licking later, pet owner: 'I said stop!'"
      },
      {
        "japanese": "親：「宿題やりなさいよ！」イライラした子供：「今からやるったら！」",
        "english": "Parent: 'Do your homework!'Irritated child: 'I said I'm gonna do it!'"
      },
      {
        "japanese": "親：「夕飯前には家中に掃除機掛けといてね。」子供：「わかった。」３分後、親：「忘れないでね。」子供：「わかったってば！」",
        "english": "Parent: 'Vacuum the house before dinner, OK?'Child: 'Got it.'3 minutes later, parent: 'Don't forget, OK??'Child: 'I said I got it!'"
      },
      {
        "japanese": "配偶者１がケーキを食べようとしている配偶者２に「ケーキを夕食の前に食べちゃダメったら！」",
        "english": "Spouse to spouse that is about to eat cake: 'I told you not to eat cake before dinner!'"
      },
      {
        "japanese": "友達１：「俺と一緒バンジージャンプ、やってみない?」友達２：「興味ないんだ。」友達１：「本当に?」友達２：「やだってば、もう！」",
        "english": "Friend1: 'Won't you go bungee jumping together with me?'Friend2: 'Not interested.'Friend1: 'Are you sure?'Friend2: 'I said no, Jeez!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ってば-ったら",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-320"
  }
}