{
  "grammar_point": "つ (slang)",
  "rank": 10,
  "bunpro": {
    "grammar_point": "つ (Slang)",
    "jlpt": "N0",
    "meaning": "Called, Said that (slang abbreviation)",
    "meaning_warning": null,
    "details": {
      "Get more example sentences!": "Premium users get access to 12 example sentences on all Grammar Points."
    },
    "writeup": "つ is a slang grammar pattern that originates from という, with the meaning of 'called (A)', 'that (A) that was said', or 'known as (A)'. Basically, it just quotes something that was previously said. つ may also be seen as っつ, or even つう.Remember, という is just a combination of the quotation particle と, and 言 う, the う-Verb meaning 'to say'.As と is the quotation particle, つ can follow almost any statement or word type.Although つ is very strong slang, it is very common. You can often hear native speakers saying という with various degrees of abbreviation, but つ being the shortest possible.The pause in the っつ version may indicate that the speaker is annoyed or running out of patience, but this is not always the case.CautionJust because 言 う disappears when said as つ, it doesn't mean that standard conjugation rules also disappear. If you want to highlight that something 'was said' in past tense, or 'is being said' in progressive form, structures like つった or つってん will be used.ている becoming てん is explained more closely in the ん slang lesson.",
    "examples": [
      {
        "japanese": "おい、今なんつった?",
        "english": "Oi, what'd you say just now?"
      },
      {
        "japanese": "で、そいつはなんつってんの?",
        "english": "And, what's he been saying?"
      },
      {
        "japanese": "彼は「もうすぐで来る」っつった。",
        "english": "He said 'I'll come soon'."
      },
      {
        "japanese": "あの人は「山田」つう男だ。",
        "english": "That person is a guy called Yamada."
      },
      {
        "japanese": "「俺の話を聞け」つってんだよ。",
        "english": "I said 'Listen to what I have to say!'"
      },
      {
        "japanese": "グランピングつうものをしてみたい。",
        "english": "I wanna try that thing called glamping."
      },
      {
        "japanese": "「ここから立ち去れ」つってんだよ。",
        "english": "They said get up and get the heck out of here!"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/つ-slang",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-323"
  }
}