{
  "grammar_point": "つまり",
  "rank": 5,
  "bunpro": {
    "grammar_point": "つまり",
    "jlpt": "N3",
    "meaning": "In short, To sum up, In other words",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "つまり (or詰まり) is a word in Japanese that is often used as anadverb. It takes a previous statement (said either by the speaker or by someone else) and summarizes it. This translates as 'in short', 'in other words', and similar expressions in English.Fun Factつまりcomes from verb詰まる meaning to become 'packed', or 'condensed'. This means that the literal translation is ofつまりis quite similar to its English interpretation.",
    "examples": [
      {
        "japanese": "ハマサキさんはまた何も言わずに休んだのですか?つまり、また無断欠勤という事ですね。",
        "english": "Hamasaki-san didn't come to work without saying anything again? In other words, he ditched work again, didn't he?"
      },
      {
        "japanese": "彼氏と本当に別れたの?つまり、もうあんな奴と関わらなくていいということ?",
        "english": "Did you really break up with your boyfriend? In other words, that means we don't have to deal with him anymore?"
      },
      {
        "japanese": "また誰か辞めたんですか?つまり、今すぐ新しい人を見付けないといけないという事ですね。",
        "english": "Someone quit again ? In other words, we need to find a new person as soon as possible, right?"
      },
      {
        "japanese": "あなたは昨日一日中家でゲームをして、家の事は何もしなかったってことですね。つまり一日中ダラダラしていたという事ですね。",
        "english": "You are saying that you were at home playing video games without doing any chores yesterday. Condensed, you were being lazy. (In short)"
      },
      {
        "japanese": "明日何時でも良いんだって。詰まり、夜遅くなっても良いらしい。",
        "english": "They said anytime tomorrow is good. To sum up, it seems that even late at night is ok."
      },
      {
        "japanese": "彼はいつも約束を破る。詰まり、私のこと好きじゃないよね。",
        "english": "He's always breaking his promises to me. In other words it seems that he isn't fond of me, right?"
      },
      {
        "japanese": "この車は電気自動車です。詰まり、ガソリンがいらない。",
        "english": "This is an electric car. In other words it doesn't need gasoline."
      },
      {
        "japanese": "A：「 問題が起きました。」B: 「詰まり、何が言いたいんですか?」",
        "english": "A: 'We have a problem.' B: 'In short, what are you trying to say?'"
      },
      {
        "japanese": "長々と説明したけど、結論を言うと、詰まりそれは失敗だったということだ。",
        "english": "I gave a very long explanation but, in short, we concluded that it was a failure."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/つまり",
    "false_friends": [
      {
        "term": "要するに",
        "meaning": "To sum up, In summary, In short",
        "kind": "synonym"
      },
      {
        "term": "即ち",
        "meaning": "In other words, That is, Namely",
        "kind": "synonym"
      },
      {
        "term": "ということは",
        "meaning": "That means, That is to say",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-331"
  },
  "dojg": {
    "grammar_point": "つまり",
    "description": "An adverb that is used to summarise or rephrase what has been mentioned/stated in the preceding context.",
    "meaning": "That is (to say); namely; in short; to sum up; in other words; after all; that means",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "538",
    "examples": [
      {
        "japanese": "(ksa).ベルリンの壁が崩れた。これはつまり、民主化の嵐が始まったということだ。",
        "english": "The  Berlin Wall fell apart. This means that the storm of democratization has  started."
      },
      {
        "japanese": "(ksb).私の母の弟、つまり、叔父が最近離婚した。",
        "english": "My  mother's younger brother, that is to say, my uncle, has recently divorced."
      },
      {
        "japanese": "(a).アメリカに一年間一人で出張するんです。つまり、単身赴任ということですよ。",
        "english": "I'm  going without my family to work for the company in America for one year. In  other words, I'm becoming a tanshin-funin worker."
      },
      {
        "japanese": "(b).運動をした後は気分がよくなりますね。つまり、運動でストレスがなくなるということなんですよ。",
        "english": "You  feel good after exercise, right? That means, stress is eliminated by exercise."
      },
      {
        "japanese": "(c).A：部長、このプロジェクトは出来ますか。B: そうだね。いいプロジェクトだと思うけど、予算がどうもねえ。A：つまり、出来ないということですね。",
        "english": "A:  Chief, can we do this project? B: Well, I think it's a fine project, but you  know how the budget is. A: In short, we cannot do it, right?"
      },
      {
        "japanese": "(d).日本の父親は子供がまだ寝ている時に家を出て、子供達が寝てから家に帰って来る。つまり、父親不在ということだ。",
        "english": "Japanese  fathers leave home while their children are still asleep and come home after  they have gone to sleep. This is, in short, an absence of fathers."
      },
      {
        "japanese": "(e).A：彼女、僕が会いに行っても、あまり話してくれないんですよ。B:  それは、つまり、君のことが嫌いなんだよ。",
        "english": "A:  I go to see her, but she doesn't talk much to me, you know. B: That means, she  doesn't like you."
      },
      {
        "japanese": "(f).産業化のために自然が破壊されること、つまり、環境破壊は人類の問題だ。",
        "english": "The  destruction of nature by industrialization, that is to say, environmental  destruction, is a problem of mankind."
      },
      {
        "japanese": "(g).私の母の妹の娘、つまり、私のいとこが来週バンコクから来ます。",
        "english": "The  daughter of my mother's younger sister, my cousin, that is, is coming from Bangkok next  week."
      },
      {
        "japanese": "(h).女性を女性だからといって差別すること、つまり、性差別の問題はどこへ行ってもある。",
        "english": "To  discriminate against a woman simply because she is a woman, in short, sexual  discrimination, exists no matter where you go."
      },
      {
        "japanese": "(i).つまり、誰も悪くないということだ。",
        "english": "Nobody  is to blame, after all."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Sentence 1 (Sentence2…)\n- つまりSentence Noun\n- 金がない。つまり、貧乏なんです。\n- I don’t have money. In other words, I’m poor\n- (ii)Noun Phrase\n- つまりNoun/Noun Phrase\n- 母の姉の子供、つまり、私のいとこ\n- The child of my mother’s older sister, my cousin, that is",
    "part_of_speech": "Adverb",
    "related": "【Related Expression: 結局; すなわち; ようするに】",
    "antonym": "",
    "source": "resources/original/dojg/all/つまり.yaml"
  }
}