{
  "grammar_point": "つつ",
  "rank": 6,
  "bunpro": {
    "grammar_point": "つつ",
    "jlpt": "N2",
    "meaning": "While, And",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "つつis a particle in Japanese that appears after the ます-stem form of verbs. When used, it indicates that (B) is an action that is happening at the same time as (A). This usually translates simply as 'while (A), (B)'.つつis a formal grammar structure and will appear in writing more than in speech.Caution - Unlikeながら,つつis used more often when the (A) action is an ongoing state, rather than an actual physical action that involves movement.ながらmay be used for both physical motions and states.Despite this, the (B) action inつつsentences may either be physical movements or ongoing states.",
    "examples": [
      {
        "japanese": "環境に悪いと知りつつ、レジ袋を使い続けている。",
        "english": "While I know that it is bad for the environment, I continue to use plastic bags."
      },
      {
        "japanese": "インターネットでレシピを見つつ、料理をしたので今日の晩御飯は美味しいはずです。",
        "english": "Dinner tonight should be delicious since I cooked while looking at a recipe on the internet."
      },
      {
        "japanese": "走りながら携帯でゲームをしていたら、電柱にぶつかった。",
        "english": "I bumped into a telephone pole because I was gaming on my phone while I was walking. (Natural Japanese)"
      },
      {
        "japanese": "走りつつ携帯でゲームをしていたら、電柱にぶつかった。",
        "english": "I bumped into a telephone pole because I was gaming on my phone while I was walking. (Physical action, unnatural Japanese)"
      },
      {
        "japanese": "仕事に関係ないことを考えながら仕事をしていたら、大きなミスをしてしまった。",
        "english": "I made a big mistake at work because I was working while thinking about something unrelated to work. (Natural Japanese)"
      },
      {
        "japanese": "仕事に関係ないことを考えつつ仕事をしていたら、大きなミスをしてしまった。",
        "english": "I made a big mistake at work because I was working while thinking about something unrelated to work. (Non-physical, natural Japanese)"
      },
      {
        "japanese": "ツバメは飛行しつつ、寝ることができる。",
        "english": "The swallow can sleep while flying."
      },
      {
        "japanese": "参加者は南極点遠征のために食料配給を準備しつつ、毎日のスケジュールを覚えたりする。",
        "english": "While preparing food rations for the south pole expedition, participants were memorizing things like the daily schedule."
      },
      {
        "japanese": "老人は沈む太陽の景色をみつつ、懐かしい青春を思い出した。",
        "english": "While watching the scenery of the setting sun, the elderly man recalled his nostalgic youth."
      },
      {
        "japanese": "布団をしきつつテレビに見入ってしまった。",
        "english": "While laying out my futon, I got transfixed by the TV."
      },
      {
        "japanese": "連載コラムを多数執筆しつつ、長編小説も書いてしまうんだからすごいね。",
        "english": "That's amazing that you are writing a number of serial columns for the newspaper while also writing a full-length novel."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/つつ",
    "false_friends": [
      {
        "term": "ながら",
        "meaning": "While ~ing, During, As",
        "kind": "synonym"
      },
      {
        "term": "ついでに",
        "meaning": "While you are at it, On the occasion",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-327"
  },
  "dojg": {
    "grammar_point": "つつ",
    "description": "(1) an auxiliary which expresses an action in progress; (2) a conjunction which is used to present two concurrent actions.",
    "meaning": "-ing; while; although",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "542",
    "examples": [
      {
        "japanese": "(ksa).台風が九州に接近しつつある。",
        "english": "A  typhoon is approaching Kyushu."
      },
      {
        "japanese": "(ksb).彼女は夫の無罪を信じつつ息を引き取った。",
        "english": "She  died believing that her husband was innocent."
      },
      {
        "japanese": "(ksc).煙草は体によくないと分かりつつなかなか辞められない。",
        "english": "Although  I know that smoking is harmful to my health, I just cannot quit."
      },
      {
        "japanese": "(a).新しい本社ビルが完成しつつある。",
        "english": "The  new headquarters building is drawing to completion."
      },
      {
        "japanese": "(b).オリンピックの施設が出来つつある。",
        "english": "The  Olympic facilities are being completed."
      },
      {
        "japanese": "(c).この大学は現在キャンパスの移転を検討しつつある。",
        "english": "This  university is considering moving its campus now."
      },
      {
        "japanese": "(d).甘い物を食べると太ると分かりつつ、つい手が出てします。",
        "english": "Although  I know that eating sweets makes me gain more weight, I unintentionally reach  out for them."
      },
      {
        "japanese": "(e).悪いことと知りつつ、友達に嘘をついてしまった。",
        "english": "Knowing  that it was a bad thing, I told my friend a lie."
      },
      {
        "japanese": "(f).早く論文を書かなければいけないと思いつつ、今日もテレビを見てしまった。",
        "english": "Although  I was thinking that I had to write the paper soon, I watched TV today, too."
      },
      {
        "japanese": "(g).私は父の無事を祈りつつ病院に急いだ。",
        "english": "I  hurried to the hospital hoping that my father was all right."
      },
      {
        "japanese": "(h).彼は最後まで自分の学説が正しいことを主張しつつこの世を去った。",
        "english": "He  died while insisting until the last moment that his theory was correct."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vます\n- つつ\n- 思いつつ\n- While thinking",
    "part_of_speech": "Auxiliary/Conjunction (used in writing and formal speech only)",
    "related": "【Related Expression: いる; ながら】",
    "antonym": "",
    "source": "resources/original/dojg/all/つつ.yaml"
  }
}