{
  "grammar_point": "つづける",
  "rank": 2,
  "bunpro": {
    "grammar_point": "つづける",
    "jlpt": "N4",
    "meaning": "To continue",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "By attaching the verb続ける'to continue' to theconjunctive formof another verb, we will be able to express that '(A) is continuing'. Let's have a look at a few examples of this structure.CautionThere is a difference in nuance between connecting one verb to another verb through theconjunctive form, or through the use of theconjunction particleて. The former implies that '(A) is being done in the way of (B)', while the latter implies that '(A) is being done, and then (B)'.",
    "examples": [
      {
        "japanese": "サリーは暗くなるまで走り続ける。",
        "english": "Sally will continue to run until it gets dark."
      },
      {
        "japanese": "私は漢字を覚えるまで、同じ漢字を書き続ける。",
        "english": "I will continue to write the same kanji until I memorize it."
      },
      {
        "japanese": "日本語は難しいけど、勉強を頑張って続ける。",
        "english": "Japanese is difficult, but I will give it my best and continue with study. (Emphasis on the continuation of studying)"
      },
      {
        "japanese": "日本語は難しいけど、勉強を頑張り続ける。",
        "english": "Japanese is difficult, but I will continue giving it my best with study. (Emphasis on the continuation of giving it one's best)"
      },
      {
        "japanese": "テレビを見続けるつもりですか。",
        "english": "Do you plan to continue to watch TV?"
      },
      {
        "japanese": "文法の間違えを直し続けてみたらどうだ?",
        "english": "Why don't you try to continue to fix your grammar mistakes?"
      },
      {
        "japanese": "あの警察官は一時間以上見回り続けた。",
        "english": "That police officer continued to patrol around for over one hour."
      },
      {
        "japanese": "大きい魚を釣るまで釣り続けます。",
        "english": "I will continue to fish until I catch a big fish."
      },
      {
        "japanese": "まっすぐ見て、歩き続けなさい！",
        "english": "Look straight, and continue walking!"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/つづける",
    "false_friends": [
      {
        "term": "ばかりだ",
        "meaning": "(Only) continue to, Keep on -ing, More and more",
        "kind": "synonym"
      },
      {
        "term": "一方だ",
        "meaning": "More and more, Continue to, Keep on, -er and -er",
        "kind": "synonym"
      },
      {
        "term": "てくる",
        "meaning": "To come to, To become, To continue, To be starting to, Has been ~ing",
        "kind": "synonym"
      },
      {
        "term": "ている②",
        "meaning": "State of being, Has (have) done",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-330"
  }
}