{
  "grammar_point": "ては",
  "rank": 6,
  "bunpro": {
    "grammar_point": "ては",
    "jlpt": "N2",
    "meaning": "If, With, Since, Because",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When the particles て and は are combined, they form a regular composite structure that is used primarily to highlight repeating actions, or to make assessments or judgments about potential situations. In this grammar structure, we will be looking at the nuance that is used with potential situations. This may be interpreted simply as 'if (A), (B)', 'when (A), (B)', or 'because of (A), (B)'.At times when used as 'if',てはwill generally express some sort of negative expectation or comment.Depending on whatてはappears after,ではmay be used instead. This is the case when following nouns, な-Adjectives, or verbs that require で to be used instead of て when conjugating.As with many other structures that useてはorでは, it will often be shortened toじゃorちゃ.",
    "examples": [
      {
        "japanese": "そのように力を入れて回してはネジがだめになってしまいますよ。",
        "english": "If you turn it with such force, you're going to ruin the screw."
      },
      {
        "japanese": "そんなに長くては鞄に入らないので、半分に折ってください。",
        "english": "It won't fit in my bag if it's that long, so please fold it in half."
      },
      {
        "japanese": "私は掃除が苦手なので、そんな几帳面では私と住むことができないだろう。",
        "english": "I don't like cleaning, so if you are that well-organized, you probably won't be able to live with me. (You probably won't enjoy living with me)"
      },
      {
        "japanese": "そんな貧乏くさい格好ではあのレストランには入れないよ。",
        "english": "If you have such a poor-looking outfit, they won't let you into that restaurant."
      },
      {
        "japanese": "リーダーがあの人じゃ嫌です。どうしてもあの人じゃないといけないなら私を別のチームに入れてください。",
        "english": "If that person is the leader, screw that. If there is really no other way than making that person the leader, then please put me on a different team."
      },
      {
        "japanese": "ご飯を全部食べなくちゃ大きくなれないよ。",
        "english": "If you don't eat all your food, you won't grow."
      },
      {
        "japanese": "このような間違いを何回もしていては、夏休みの課題はやりきれない。",
        "english": "If you continue to make mistakes like these, you won't be able to finish the summer assignment."
      },
      {
        "japanese": "寝る前にそんなコーヒーを飲んでは寝られない。",
        "english": "If you drink coffee before going to bed, you won't be able to sleep a wink."
      },
      {
        "japanese": "そんな服装ではあの店には入れてもらえないよ。",
        "english": "With those clothes, you won't be able to enter that shop."
      },
      {
        "japanese": "そのような給与では、あの工場で働くには無理がある。",
        "english": "It is not worth working in that factory if that is what you will be paid."
      },
      {
        "japanese": "そのような振る舞いでは、周囲はあなたを「馬鹿な人」と評価し、誰もあなたに対して真面目に相手をしないでしょう。",
        "english": "With behavior like that, you will be labeled a fool by those around you and no one will treat you seriously."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ては",
    "false_friends": [
      {
        "term": "たって",
        "meaning": "Even if, Even though, No matter how",
        "kind": "synonym"
      },
      {
        "term": "ようでは・ようじゃ",
        "meaning": "If, If it is true that",
        "kind": "synonym"
      },
      {
        "term": "ていては",
        "meaning": "If one keeps doing something, When, If something is...",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-361"
  },
  "dojg": {
    "grammar_point": "ては",
    "description": "A conjunction which presents an action/state as a topic about which a negative comment is given.",
    "meaning": "If; when; because",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "461",
    "examples": [
      {
        "japanese": "(ksa).そんなに勉強しては、体を壊しますよ。",
        "english": "If  you study that hard, you will ruin your health."
      },
      {
        "japanese": "(ksb).こんなに寒くては外出できません。",
        "english": "We  cannot go out in this cold weather (literally: when it is this cold)."
      },
      {
        "japanese": "(ksc).仕事がそんなに嫌いでは困りますね。",
        "english": "It's  too bad that you hate your work that much."
      },
      {
        "japanese": "(a).そんなに遊んでいては、試験に失敗しますよ。",
        "english": "If  you are fooling around like that, you will fail the examination."
      },
      {
        "japanese": "(b).あの男が来ては邪魔になる。",
        "english": "If  he comes he will get in our way."
      },
      {
        "japanese": "(c).こんなに働かされては、病気になってしまうよ。",
        "english": "If  I'm forced to work like this, I will end up by becoming ill."
      },
      {
        "japanese": "(d).こんなに部屋が汚くては、お客さんが見えた時に恥ずかしい。",
        "english": "Because  the room is messy like this, I feel ashamed when I have a guest."
      },
      {
        "japanese": "(e).人が皆個人主義的では、国はやっていけない。",
        "english": "If  everybody is individualistic, a country cannot get along well."
      },
      {
        "japanese": "(f).こんなに忙しくては、新聞も読めない。",
        "english": "When  one is this busy, one cannot read even the newspaper."
      },
      {
        "japanese": "(g).あんな女性がデートの相手では、彼は小さくなっているだろう。",
        "english": "If  a woman like her is his date, he must feel intimidated."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Verb\n- ては\n- 食べては\n- When/if one eats; to eat\n- (ii)Adjective(い/な)\n- ては\n- 大きくては\n- When/if something/someone is big\n- 不便では\n- When/if something is inconvenient\n- (iii)Noun\n- では\n- 病気では(頼めない)\n- If someone is ill (I can’t ask him to do something)\n- あの先生では(話にならない)\n- That teacher (would be out of the question)",
    "part_of_speech": "Conjunction",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/ては.yaml"
  }
}