{
  "grammar_point": "てくる",
  "rank": 2,
  "bunpro": {
    "grammar_point": "てくる",
    "jlpt": "N4",
    "meaning": "To come to, To become, To continue, To be starting to, Has been ~ing",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "This grammar point is a combination of the conjunction particle て , and the verb 来る 'to come'. To use this grammar point, you will need to attach て to any verb, and then follow it with くる . This nuance is usually that '(A) happened, and then came', or 'will happen, and then come'. In other words, it will depend on whether くる is in present, or past tense.てくる can be used when representing time, or when representing a physical place. When representing a physical place, it is more likely that the kanji structure, 来る will be used. However, this is not a set rule, and depends on the writer.When used in relation to time, the nuance is usually that something has already come to pass, or will start to happen from now.This is the opposite of ていく , which indicates that something will change from the way that it is now, or will continue progressing in a certain way.Fun FactWhen compared to English, てくる is very similar to the phrase 'to have come to (A)', in relation to time. This means that it focuses on the fact that the speaker will 'become (A)', should things continue in a specific way. In practice though, it is used like 'gotten' in most situations.",
    "examples": [
      {
        "japanese": "すぐ帰ってくるね?",
        "english": "You will come back home soon, right? (Literally - Return and come)"
      },
      {
        "japanese": "お弁当を持ってきてください。",
        "english": "Please bring a bento with you. (hold and come)"
      },
      {
        "japanese": "トイレに行ってきます。",
        "english": "I will go to the bathroom and come back."
      },
      {
        "japanese": "私はアメリカに戻ってから、どんどん太ってきた。",
        "english": "Since coming back to America, I have rapidly come to be fatter."
      },
      {
        "japanese": "お母さんに似てきたね。",
        "english": "You have come to look like your mother."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/てくる",
    "false_friends": [
      {
        "term": "くる",
        "meaning": "To come",
        "kind": "synonym"
      },
      {
        "term": "〜になる・〜くなる",
        "meaning": "To become (Adjective)",
        "kind": "synonym"
      },
      {
        "term": "つづける",
        "meaning": "To continue",
        "kind": "synonym"
      },
      {
        "term": "ばかりだ",
        "meaning": "(Only) continue to, Keep on -ing, More and more",
        "kind": "synonym"
      },
      {
        "term": "ていく",
        "meaning": "To ~ and go, To go on, To start",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-350"
  }
}