{
  "grammar_point": "てでも",
  "rank": 6,
  "bunpro": {
    "grammar_point": "てでも",
    "jlpt": "N2",
    "meaning": "Even if I have to, By any or all means, No matter what",
    "meaning_warning": "Often used in manga",
    "details": {
      "Register": "Casual",
      "使用域": "タメ語"
    },
    "writeup": "てでもis a combination of the conjunction-particle て, and theprefixadverbial particleでも. Regular interpretations include 'no matter what', or 'even if I have to (A)'. When connected to verbs,てでもjust emphasizes that 'even if (A) needs to be done, it will be', and expresses the speaker's strong determination to do something, regardless of what the consequences are, or how difficult it might be.Due toてでもexpressing strong will, it will often be seen in sentences that include other phrases that mark desire or intent, such as ほしい, たい, and ようと思う.Fun-fact - Althoughてでもis considered a fairly slang expression due to the use ofてでもrather than the usual ても that would be expected of a verb, the construction itself of て-form partnered with anadverbial particleis quite common, and often marks emphasis or comparison. This can be seen very regularly with ては in patterns like てはいけない or てはだめ.",
    "examples": [
      {
        "japanese": "あの最新のノートパソコンは高いお金を払ってでも手に入れたい。",
        "english": "I want that laptop, even if I have to pay a lot of money for it."
      },
      {
        "japanese": "寒い中並んででもあそこのラーメンを食べてみたい。",
        "english": "I want to eat their ramen, even if I have to line up in the cold."
      },
      {
        "japanese": "このレポートは徹夜してでも終わらせなければいけない。",
        "english": "I need to finish this essay, even if it means that I need to stay up all night."
      },
      {
        "japanese": "手間と時間をかけてでも、日本語がぺらぺらになりたい。",
        "english": "Even if I have to spend time and effort, I want to become fluent in Japanese."
      },
      {
        "japanese": "くたくたに疲れてるけど、失神してでも、最後までこの試合をやりぬく。",
        "english": "I am exhausted, but even if I faint, by any means, I will play this match till the end."
      },
      {
        "japanese": "未払い残業してでも、この会社で働こうと思う。",
        "english": "Even if I have to work unpaid overtime, I am going to work for this company."
      },
      {
        "japanese": "どんな事をしてでも、海賊王になりたいぞ！",
        "english": "No matter what it takes, I want to become a pirate king!"
      },
      {
        "japanese": "今月末までずっと安いラーメンを食べる事になってでも、このゲームがほしい。",
        "english": "Even if it becomes so that I have to eat nothing but cheap ramen until the end of the month, I want this game."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/てでも",
    "false_friends": [
      {
        "term": "ようが〜まいが",
        "meaning": "Even if, No matter what, Whether or not, [Emphatic], Volitional+が",
        "kind": "synonym"
      },
      {
        "term": "にしても",
        "meaning": "Even though, Even if, Even when, Also",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-359"
  }
}