{
  "grammar_point": "と (thinking that)",
  "rank": 6,
  "dojg": {
    "grammar_point": "と",
    "description": "A particle which makes an adverbial clause, with a verb of saying/thinking/understood after it.",
    "meaning": "(thinking/saying) that ~; because; like; in such a way that ~",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "464",
    "examples": [
      {
        "japanese": "(ksa).幸夫は来年は家が買えると大変喜んでいる。",
        "english": "Yukio  is very happy that he can buy a house next year."
      },
      {
        "japanese": "(ksb).博物館は開いているかなと、電話してみた。",
        "english": "(internal  monologue): Wondering if the museum is open I called them."
      },
      {
        "japanese": "(ksc).テニスをしようと出かけたら、途中で雨が降ってきた。",
        "english": "With  the intention of playing tennis (literally: Thinking that I will play tennis) I  went out, but on my way it started to rain."
      },
      {
        "japanese": "(ksd).父はまだ元気なようだと安心していたが、最近急に弱ってきた。",
        "english": "I  felt at ease, thinking that my father still looked healthy, but suddenly he  began to grow weak."
      },
      {
        "japanese": "(kse).外国語の能力は単語から文、文から段落、そして段落から複段落と、伸びていく。",
        "english": "Foreign  language proficiency develops from words to sentences, from sentences to  paragraphs, and then from paragraphs to complex paragraphs."
      },
      {
        "japanese": "(a).友達は長い間飼っていた猫が死んでしまったと、悲しがっていた。",
        "english": "My  friend looked sad, saying that a cat, which she kept for a long time, had died."
      },
      {
        "japanese": "(b).彼は癌になったかもしれないと心配している。",
        "english": "He  is worried that he may have cancer."
      },
      {
        "japanese": "(c).その学生はもうちょっとで百点が取れたのにと、悔しがった。",
        "english": "That  student felt chagrined that he could almost get 100 points."
      },
      {
        "japanese": "(d).彼女と会うのもこれが最後かと、寂しかったのです。",
        "english": "Thinking  that this would be the last time to see her, I felt lonely."
      },
      {
        "japanese": "(e).変な音がしたなと、外に出てみたが、何でもなかった。",
        "english": "Wondering  what the strange noise was, I went outside, but it was nothing."
      },
      {
        "japanese": "(f).僕は今晩は酒を飲むまいと、まっすぐ家に帰った。",
        "english": "I  came straight home, thinking that I would not drink tonight."
      },
      {
        "japanese": "(g).年内に論文を仕上げようと、懸命に努力しているところです。",
        "english": "Thinking  that I should complete the paper before the end of the year, I am right now  doing my very best."
      },
      {
        "japanese": "(h).彼にお礼を言おうとやって来たのに、ほかのことばかり話して、お礼を言うのを忘れてしまった。",
        "english": "I  came here intending to thank him, but I just talked about something else, and  forgot to thank him."
      },
      {
        "japanese": "(i).少しは体にいいだろうと、最近は散歩をしています。",
        "english": "I  thought it would make a small improvement to my body, so I am taking walks  these days."
      },
      {
        "japanese": "(j).宿題を忘れたので先生に叱られるかもしれないと、ビクビクしていた。",
        "english": "I  forgot my homework so I feared that I might be scolded by my teacher."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjective(い/な)}informal\n- と(思って/言って)\n- Verb of psychology\n- 読めると(思って/言って)嬉しがっている\n- Someone is happy thinking/saying that s/he can read it\n- 面白いと(思って/言って)喜んでいる\n- Someone is happy thinking/saying that something is interesting\n- 便利だと(思って/言って)嬉しがっている\n- Someone is happy thinking/saying that something is convenient\n- (ii)Sentence (internal monologue)\n- と(思って)\n- もう会うまいと、縁を切った\n- Thinking that someone would not see someone else, he severed the relationship\n- 映画でも見に行こうかなと、出かけた\n- Wondering if I should go see a movie I left home\n- (iii)Vvolitional\n- と(思って/して)\n- 食べようと(思って/して)\n- Thinking that s/he would eat it\n- (iv){V/Adjective(い/な)}informal (conjectural)\n- と(思って)\n- 来ないだろうと(思って)\n- Thinking that s/he might not come\n- うまらないかもしれないと(思って)\n- Thinking that something might be boring\n- 元気だろうと(思って)\n- Thinking that someone might be healthy\n- (v)NounParticle Noun, …NounParticle Noun\n- (そして)NounParticleと(いう{よう/風}に)Verb\n- 男は二階、女は一階と(いう{よう/風}に)部屋を分ける\n- Someone divides the rooms in such a way that men are placed upstairs and women in the first floor",
    "part_of_speech": "Particle",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/と.yaml"
  }
}