{
  "grammar_point": "ところから",
  "rank": 10,
  "dojg": {
    "grammar_point": "ところから",
    "description": "A phrase that introduces the origins of names, theories, ideas and events.",
    "meaning": "Because; be caused by the fact that ~; from the fact that ~",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "645",
    "examples": [
      {
        "japanese": "(ksa).この宝石は猫の目に似ているところから「猫目石」と名づけられている。",
        "english": "This gem is called \"cat's-eye\" because it resembles a cat's eye."
      },
      {
        "japanese": "(ksb).私が両者にそのことを十分説明しなかったところから誤解が生じた。",
        "english": "The misunderstanding was caused by the fact that I didn't explain it to both of them fully."
      },
      {
        "japanese": "(a).田中先生はいつも蝶ネクタイをしていたところから「蝶ネクタイ先生」と呼ばれていた。",
        "english": "Dr. Tanaka was called \"Professor Bow Tie\" because he always wore one."
      },
      {
        "japanese": "(b).日本は憲法が戦力の保持を禁止しているところから、「軍隊」ではなく「自衛隊」を持っている。",
        "english": "Because its constitution bans the possession of military power, Japan has \"Self-Defence Forces,\" but not an \"army.\""
      },
      {
        "japanese": "(c).この説は、両者が生物的に多くの共通点を持っているところから来ている。",
        "english": "This theory comes from the fact that, biologically, the two species have many things in common."
      },
      {
        "japanese": "(d).論語に「何もしないでいるよりは碁を打つ方がましだ」という教えがあるところから、碁は孔子以前にかなり普及していたとみられる。",
        "english": "Because the Analects teach us that \"It is better to play Go  than to not do anything,\" it appears that Go was already fairly popular before  Confucius' time."
      },
      {
        "japanese": "(e).そのイギリス人とは家が近くだったところから、よく遊びに行って英語や英語の歌を教えてもらったりした。",
        "english": "Because my house was close to the Englishman's, I visited him  often and he taught me English and English songs and other things."
      },
      {
        "japanese": "(f).この雑誌は最初、ある有名月刊誌の別冊として刊行されたのが好評だったところから、後に単独の雑誌として独立したものだ。",
        "english": "This magazine was ﬁrst published as a separate volume of a  famous monthly magazine and later became an independent publication because it  was so well received."
      },
      {
        "japanese": "(g).今音楽で広く使われているCDは、実はベートーベンの第九交響曲の演奏時間が７４分間だったところからその容量が決められたということだ。",
        "english": "I heard that the capacity of the CDs we use so widely now for  music was settled on because a (certain) performance of Beethoven's Ninth  Symphony was 74 minutes long."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjectiveい}informal\n- ところから\n- {する/した}ところから\n- Because someone does/did something\n- {高い/高かった}ところから\n- Because something is/was expensive\n- (ii)Adjectiveなstem\n- {な/である/だった/であった}ところから\n- 便利{な/である/だった/であった}ところから\n- Because something is/was convenient\n- (iii)Noun{である/だった/であった}\n- ところから\n- 日本人{である/ だった/であった}ところから\n- Because someone is/was a Japanese",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: ことから; ので; から】",
    "antonym": "",
    "source": "resources/original/dojg/all/ところから.yaml"
  }
}