{
  "grammar_point": "という風に",
  "rank": 6,
  "bunpro": {
    "grammar_point": "という風に",
    "jlpt": "N2",
    "meaning": "As if to say, As if to suggest that, In such a way that, Things like",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Likeふうに, the grammar point indicating that something is being done 'in the way of (A)',というふうにuses the samesuffixof風'wind', 'air', to express that something is being done 'as if to say (A)', 'as if to suggest (A)', or 'in such a way that (A)'.As this construction is just a combination of という 'to say', and ふうに 'in a manner', the literal meaning of this expression is similar to 'in a way that would say that (A)'. This simply highlights the speaker's uncertainty about what the actual situation is, and that they are only commenting on appearances.というふうに may be seen directly after verbs, or after nouns expressing the way in which something is being done. The (B) portion of these phrases will then indicate exactly what is being done 'in a way as if to say (A)'.Caution - Because という often quotes the entire statement before it, it will be important to remember this when figuring out exactly whatというふうにis emphasizing.",
    "examples": [
      {
        "japanese": "彼女は昼休憩に帰るというふうに聞いています。",
        "english": "I heard something as if to suggest that she is going to go home during lunch break."
      },
      {
        "japanese": "鈴木さんはこの試験に命がかかっているというふうに勉強をした。",
        "english": "Suzuki-san studied as if to suggest that his life depended on this exam."
      },
      {
        "japanese": "私は今まで自分が一番仕事ができる人だというふうに思っていた。",
        "english": "Until recently, I always thought in such a way as to suggest that I was the most capable person when it comes to work."
      },
      {
        "japanese": "彼はデザイン、僕はプログラミング、というふうに役割を分けてアプリを開発することにした。",
        "english": "We decided to develop the application by dividing the roles in the following way: he would do the design and I would do the programming."
      },
      {
        "japanese": "刑事：「武さんはその事故のことを知っていたという風に私を見ていた。」",
        "english": "Detective: He looked at me as if to suggest that he knew some circumstances of that accident."
      },
      {
        "japanese": "彼女は命がかかってるという風に走っていた。",
        "english": "She was running in a way that suggested her life depended on it."
      },
      {
        "japanese": "秘書が仕事を辞めるという風に聞いていた。",
        "english": "I heard something as if to suggest that the secretary decided to quit."
      },
      {
        "japanese": "父：「母に、遅れるだろうという風に言って。」",
        "english": "Father: 'Tell mom in such a way as to suggest that I will be late.'"
      },
      {
        "japanese": "私は掃除、母は晩御飯、父は暖炉に火を付ける、という風にみんなが客の来訪のために、準備した。",
        "english": "We all prepared for a guest visit, in the following ways: I cleaned, mom made dinner, and dad fired up the fireplace."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/という風に",
    "false_friends": [
      {
        "term": "ふうに",
        "meaning": "~ way, In a way that suggests, Like ~",
        "kind": "synonym"
      },
      {
        "term": "ように・ような",
        "meaning": "As・like, Just like",
        "kind": "synonym"
      },
      {
        "term": "かのようだ",
        "meaning": "As if, Just like",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-422"
  },
  "dojg": {
    "grammar_point": "という風に",
    "description": "A phrase which expresses a manner or a way in which someone does something.",
    "meaning": "In such a way that; in such a fashion to suggest/show (etc.) that; as if to say/show (etc.) that",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "478",
    "examples": [
      {
        "japanese": "(ksa).彼はどうしようもないという風に首を振った。",
        "english": "He  shook his head as if to say that there was no way out."
      },
      {
        "japanese": "(ksb).私は河村さんは来られないという風に聞いている。",
        "english": "I  have been informed that Mr. Kawamura cannot come. (literally: I have been  informed in such a way that I understand that Mr. Kawamura cannot come.)"
      },
      {
        "japanese": "(ksc).浩司は鰻、友子は天ぷら、という風にめいめいが自分の好きなものを注文した。",
        "english": "Each  of them ordered the (different) things they liked- Hiroshi, eel, Tomoko,  tempura, and so on."
      },
      {
        "japanese": "(a).彼はもう我慢が出来ないという風に荒々しく立ち上がった。",
        "english": "He  stood up in a violent manner showing that he could no longer bear it."
      },
      {
        "japanese": "(b).彼女はもうこれ以上聞きたくないという風に両手で耳を被った。",
        "english": "She  covered her ears as if to say that she didn't want to listen to it any more."
      },
      {
        "japanese": "(c).社長には、特に問題はなかったという風に言っておいて下さい。",
        "english": "Please  tell the president that (literally: tell it to the president in such a way to  convey that) there were no particular problems with it."
      },
      {
        "japanese": "(d).この物語は今の社会を風刺しているという風には考えられませんか。",
        "english": "Can't  we think that (literally: think in such a way that) this story mocks  contemporary society?"
      },
      {
        "japanese": "(e).そういうことは規則に反するから出来ないという風に説明しておけばいい。",
        "english": "You  can explain that (literally: explain it in a way to mean that) we cannot do  things like that because they are against the rules."
      },
      {
        "japanese": "(f).去年はボストン、今年はニューヨークという風に、この協会の大会は毎年東部の大都市で開かれている。",
        "english": "This  association's convention is held in a big city on the East Coast every year:  last year Boston; this year New York; and so on."
      },
      {
        "japanese": "(g).ジョンはケートと、マイクはシンディーと、という風にみんながパートナーを見つけてペアになった。",
        "english": "Everybody  found a partner and paired up- John with Kate, Mike with Cindy, and so on."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Sinformal\n- という風に\n- 困ったという風に頭を抱えた\n- Someone held his head in such a fashion as to suggest that he didn’t know what to do\n- (ii)XはA; YはB\n- という風に\n- 月曜日はピアノ、火曜日はダンスという風に良子は毎日レッスンがある\n- Yoshiko has a lesson every day –piano on Monday, dance on Tuesday, and so on",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: と言うように】",
    "antonym": "",
    "source": "resources/original/dojg/all/という風に.yaml"
  }
}