{
  "grammar_point": "というものだ",
  "rank": 6,
  "bunpro": {
    "grammar_point": "というものだ",
    "jlpt": "N2",
    "meaning": "Speaker's impression, Criticism or conclusion",
    "meaning_warning": "No Negative or Past Form",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "というものだis a fairly strong expression in Japanese that indicates that the speaker has the impression that (A) is the way it is, based on their objective judgment. This is usually translated as 'my impression of (A) is that'. However, the more literal translation is closer to '(A) is just a thing that'. This emphasizes that the speaker has high certainty that what they are saying (based on their experience) is the true nature of (A) in most cases.というものだis constructed of という, the noun物'thing', and だ. It will be seen at the end of phrases that the speaker or writer is making a judgment about.As this grammar pattern is quite direct, it is often used when criticizing something. However, this is not always the case, so will need to be judged based on context.Caution - In casual conversation, という may be shortened simply to って, without any change in meaning.",
    "examples": [
      {
        "japanese": "何があってもお互い助け合うのが友達というものだ。",
        "english": "Helping each other no matter what is just what friends do."
      },
      {
        "japanese": "先輩が着く10分前に着く。それがマナーというものだ。",
        "english": "Arriving 10 minutes before your senpai arrives. That is just manners."
      },
      {
        "japanese": "どんなに疲れていても諦めない。それがアスリートというものだ。",
        "english": "Not giving up no matter how tired you are. That is my impression of an athlete."
      },
      {
        "japanese": "何があっても泣かない。それが男ってものだ！",
        "english": "Not crying no matter what. That is my impression of a man!"
      },
      {
        "japanese": "あなたの好き嫌いは食わず嫌いというものだ。",
        "english": "My impression is that your likes and dislikes are prejudiced (dislike without trying)."
      },
      {
        "japanese": "その言い分はわがままというものだ。",
        "english": "My impression is that your complaint is selfish."
      },
      {
        "japanese": "彼が知らない真実を話すことが、親切というものだ。",
        "english": "My impression is that it is kind to talk to him about truths he does not know."
      },
      {
        "japanese": "楽しくないと意味がない。それがサークルというものだ。",
        "english": "If it isn't fun, it is pointless. That is my impression of club sports."
      },
      {
        "japanese": "毎日少しずつしか進まない。それが撮影というものだ。",
        "english": "I can only progress a little each day. That is my impression of what photography is."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/というものだ",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-416"
  }
}