{
  "grammar_point": "ときいた",
  "rank": 2,
  "bunpro": {
    "grammar_point": "ときいた",
    "jlpt": "N4",
    "meaning": "I heard that",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When the particleとis used forcitationin Japanese, it is regularly partnered with other verbs, to form set phrases. One of these set expressions isと聞いた, which means 'I heard that (A)'.と聞いたmay be used after any phrase expressing the thing that was heard.Cautionだis often omitted after nouns andな-Adjectiveswhen used withときいたin casual conversation. While this sounds perfectly normal, it is technically not correct Japanese.",
    "examples": [
      {
        "japanese": "来年から先輩が私と同じマンションに住むと聞いた。",
        "english": "I heard that starting next year, my senpai is going to live in the same apartment that I do."
      },
      {
        "japanese": "北海道の冬は、沖縄の冬より寒いと聞いた。",
        "english": "I heard that winter in Hokkaido is colder than winter in Okinawa."
      },
      {
        "japanese": "友達からあなたは歌うのが上手だと聞いた。",
        "english": "I heard from a friend that you are good at singing."
      },
      {
        "japanese": "社長の息子がもう大学生だと聞いた。",
        "english": "I heard that the son of the company president is already a college student."
      },
      {
        "japanese": "あなたは泳ぐのが下手と聞いたけど、本当なの?",
        "english": "I heard that you are bad at swimming, but is that true?"
      },
      {
        "japanese": "あれが世界一高い山と聞いた。",
        "english": "I heard that that mountain over there is the tallest in the world."
      },
      {
        "japanese": "明日はテストがあると聞いた。",
        "english": "I heard that there is a test tomorrow."
      },
      {
        "japanese": "これは無理だと聞いた。",
        "english": "I heard that this is impossible."
      },
      {
        "japanese": "トムは旅館に行ったことがないと聞いた。",
        "english": "I heard that Tom has never been to a ryokan."
      },
      {
        "japanese": "市内にあるスーツ屋が安いと聞いた。",
        "english": "I heard that suit shops in the city are cheap."
      },
      {
        "japanese": "近くの映画館のスクリーンが一番大きいと聞いた。",
        "english": "I heard that the screens at the movie theater nearby are the biggest."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ときいた",
    "false_friends": [
      {
        "term": "らしい ①",
        "meaning": "Seems like, Apparently, I heard",
        "kind": "synonym"
      },
      {
        "term": "そうだ",
        "meaning": "I heard that, It is said that",
        "kind": "synonym"
      },
      {
        "term": "ようだ",
        "meaning": "It seems that, It appears that, It looks like",
        "kind": "synonym"
      },
      {
        "term": "んだって",
        "meaning": "I heard that, He or She said that",
        "kind": "synonym"
      },
      {
        "term": "だって",
        "meaning": "I heard/was said, Because, But, Even or also, Even if or even though",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-437"
  }
}