{
  "grammar_point": "ところを見ると",
  "rank": 6,
  "bunpro": {
    "grammar_point": "ところを見ると",
    "jlpt": "N2",
    "meaning": "Judging from, Seeing that",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ところを見るとis a set phrase in Japanese that highlights the situation or place of (A), before examining it subjectively. This often comes across simply as 'judging from (A)', or 'seeing that (A)'. Literally, it can be thought of as 'if looking at the aspect of (A)', before the speaker will then go on to state what their judgment is.This grammar pattern will appear directly following verbs in any of their standard forms.Due toところを見るとexpressing primarily subjective opinions based on single observable actions, the (B) part of sentences including this structure will often include things like だろう, かも, でしょう, ね, etc, in order to show that the speaker is not actually claiming anything factually.",
    "examples": [
      {
        "japanese": "彼がニコニコしているところを見ると、テストに合格したに違いない。",
        "english": "Seeing that he is smiling, I have no doubt that he passed the test."
      },
      {
        "japanese": "漢字を綺麗に書けるところを見ると、彼は長い間漢字を勉強しているのかもしれない。",
        "english": "Judging from the fact that he can write kanji very nicely, he probably has been studying kanji for a long time."
      },
      {
        "japanese": "怒られていてもずっと携帯を見ているところを見ると、彼は全然反省していないんだろう。",
        "english": "Seeing that he is looking at his phone despite being scolded, he probably doesn't feel any remorse."
      },
      {
        "japanese": "彼女が反論しないところを見ると、嘘をついていると私は確信した。",
        "english": "Judging from the fact that she did not deny it, I am convinced that she is lying."
      },
      {
        "japanese": "英語を流暢に話すところを見ると、彼女は帰国子女かもしれない。",
        "english": "Judging from the fact that she speaks English fluently, she probably lived abroad when she was young."
      },
      {
        "japanese": "彼が落ち込んでいるところを見ると、恋人に振られたのかもしれない。",
        "english": "Judging from the fact that he is sullen, he was probably dumped by his lover."
      },
      {
        "japanese": "香水をつけているところを見ると、お出掛けですね?",
        "english": "Seeing that you are wearing perfume, are you going out?"
      },
      {
        "japanese": "このタイミングで交替したところを見ると、あのピッチャーは怪我をしたのかもしれない。",
        "english": "Judging from the timing of the change, that pitcher was probably injured."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ところを見ると",
    "false_friends": [
      {
        "term": "からすると・からすれば",
        "meaning": "Judging from, Considering",
        "kind": "synonym"
      },
      {
        "term": "からして",
        "meaning": "Even..., Judging from, Based on",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-445"
  }
}