{
  "grammar_point": "ところだった (on the verge of)",
  "rank": 4,
  "bunpro": {
    "grammar_point": "ところだった ①",
    "jlpt": "N3",
    "meaning": "Almost, Nearly, About to, On the verge of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "As explained in the ところ grammar point, ところ is a noun that is often used to highlight the situation within which a verb is 'about to' happen (when that verb appears in its non-past form). However when followed byだった, it emphasizes that the thing that was 'about to' happen never actually eventuated (or that another more important event happened at that moment). This can be translated as 'to almost (A)', or 'to be on the verge of (A)'.The verb that ところ is paired with may also be seen grouped with theauxiliary verbない. In this case, it implies that something was 'about not' to happen (but then did).",
    "examples": [
      {
        "japanese": "やばい、大事な書類を捨てるところだった。",
        "english": "Oh shoot, I was just about to throw away an important document."
      },
      {
        "japanese": "毒キノコを食べるところだったが、きのこに詳しい友達が止めてくれた。",
        "english": "I was about to eat a poisonous mushroom, but a friend that is very knowledgeable about mushrooms stopped me."
      },
      {
        "japanese": "この電車に間に合ってよかった。もう少しで待ち合わせ時間に間に合わないところだった。",
        "english": "I am so glad that we made this train. I was about to be late for the meet up."
      },
      {
        "japanese": "現金が足りなくて家賃が払えないところだった。",
        "english": "I was about to not be able to pay my rent because I didn't have cash."
      },
      {
        "japanese": "もう少しで船からおちるところだった。",
        "english": "I nearly fell off the ship (had I been a little closer to the edge)."
      },
      {
        "japanese": "ちょうど電車が発車するところだった。",
        "english": "It was right when the train was about to depart."
      },
      {
        "japanese": "危うく遅刻するところだった。",
        "english": "I was on the verge of  being late."
      },
      {
        "japanese": "眠りに入るところだったのに、電話で起こされた。",
        "english": "I was just about to go to sleep, but was woken up by a phone call."
      },
      {
        "japanese": "発見が遅れたら、危うく死ぬところだった。",
        "english": "I would have been on the verge of dying had they not found me sooner."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ところだった1",
    "false_friends": [
      {
        "term": "ところだった ②",
        "meaning": "Was just about to do something, Was in the middle of...",
        "kind": "synonym"
      },
      {
        "term": "るところだ",
        "meaning": "About to, On the verge of",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-441"
  }
}