{
  "grammar_point": "ところが",
  "rank": 5,
  "bunpro": {
    "grammar_point": "ところが",
    "jlpt": "N3",
    "meaning": "Even so, However, Even though, But",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ところがis aconjunctionin Japanese that is a combination of the noun, ところ 'place', and theconjunction particleが. It is used to highlight that (A) was expected, but the unexpected result (B) occurred. It is usually translated as 'however', or 'despite that'.ところがis most often used at the beginning of a new sentence, before highlighting something that is contrary to what was described in the previous sentence.This use of が in Japanese is referred to as確定の逆接, which basically means 'a contradictory conclusion'.CautionBecauseところがhighlights a result that is unexpected, it can only be used for things that are beyond the control of the speaker. However, if the speaker is trying to do something, but assumes that their attempt may result in failure,ところがcan be used to show that they were unexpectedly successful.Fun FactSometimes,ところがis referred to as aconjunction particleitself, disregarding the combination of ところ and が. This is similar to ところで, another conjunction particle that has a slightly different meaning, and is frequently translated as 'by the way'.",
    "examples": [
      {
        "japanese": "今日は早く起きないといけなかったから9時に寝た。ところが、目覚ましがならなかったから寝坊した。",
        "english": "I had to wake up early today so I went to sleep at 9pm. However, my alarm didn't go off, so I overslept."
      },
      {
        "japanese": "新しい洗濯機を買った。ところが、洗濯機が大きすぎて家に入らなかった。",
        "english": "I bought a new washing machine. However, it was so big that it didn't fit in my house."
      },
      {
        "japanese": "友達に勉強の手伝いを頼んだら嫌がると思っていた。ところが、喜んで手伝ってくれた。",
        "english": "I thought my friend was not going to like it if I asked him to help me with studying, however, he did so without hesitation."
      },
      {
        "japanese": "日本のチームが勝つと思っていた。ところが負けてしまった。",
        "english": "I thought that the Japanese team would win. However, they lost."
      },
      {
        "japanese": "あの人は非常に優しそうでした。ところが、裏がありました。",
        "english": "That person seemed extremely nice. However, they had ulterior motives."
      },
      {
        "japanese": "友達によると、テストは難しかったそうだ。ところが、彼は百点を取った。",
        "english": "According to my friend, the test was difficult. Even so, he got a perfect score."
      },
      {
        "japanese": "テストに出そうなところを予想して勉強した。ところが、全然違う問題しか出なかった。",
        "english": "I studied what I thought would be on the test. However, the questions were totally different from what I had studied."
      },
      {
        "japanese": "勝てる試合だった。ところが、怪我をして負けてしまった。",
        "english": "It was a match I could win. However, I got injured and lost."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ところが",
    "false_friends": [
      {
        "term": "が (subject marker)",
        "meaning": "But, However",
        "kind": "synonym"
      },
      {
        "term": "却って",
        "meaning": "All the more, On the contrary, Conversely",
        "kind": "synonym"
      },
      {
        "term": "それにしても",
        "meaning": "Nevertheless, Even so",
        "kind": "synonym"
      },
      {
        "term": "だが・ですが",
        "meaning": "But, Still, However, Nevertheless",
        "kind": "synonym"
      },
      {
        "term": "それでも",
        "meaning": "But still, And yet, Even so, Nevertheless",
        "kind": "synonym"
      },
      {
        "term": "けれども",
        "meaning": "But, Although",
        "kind": "synonym"
      },
      {
        "term": "けど・だけど",
        "meaning": "But, However",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-440"
  },
  "dojg": {
    "grammar_point": "ところが",
    "description": "A conjunction which is used to present what in fact happened or what is in fact the case when something else was/is expected.",
    "meaning": "However; but",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "503",
    "examples": [
      {
        "japanese": "(ksa).日本式の部屋に泊まりたいと思って旅館を予約した。ところが、通された部屋は洋式だった。",
        "english": "I  wanted to stay in a Japanese-style room and made a reservation at an inn.  However, the room I was shown to was a Western-style one."
      },
      {
        "japanese": "(ksb).Ａ：彼女にプロポーズしたんだろう?どうだった?Ｂ：ところが、駄目だったんだ。",
        "english": "A:  You proposed to her, right? What happened? B: It didn't work out. (literally:  It was no good.)"
      },
      {
        "japanese": "(a).私の娘はアメリカにいる時綺麗な英語を話していた。ところが、日本へ帰って一年もたたないうちにきれいに忘れてしまった。",
        "english": "My  daughter was speaking beautiful English when she was in America. However, she  forgot it completely within a year (literally: even before one year elapsed)  after we came back to Japan."
      },
      {
        "japanese": "(b).日本から来た有名な先生の講演があるというので行ってみた。ところが、その先生は英語が下手で何を言っているのか全然分からなかった。",
        "english": "Because  I heard that there was going to be a lecture by a famous professor from Japan,  I went (to listen to it). However, his English was so bad that I didn't  understand what he was saying at all."
      },
      {
        "japanese": "(c).先生は私達に遅刻してはいけないと何度も言った。ところが、次の日、時間通りに行ってみると先生はまだ来ていなかった。",
        "english": "Our  teacher repeatedly told us that we mustn't be late for his class. However, when  I went to his class on time the next day, he was not yet there."
      },
      {
        "japanese": "(d).アメリカへ来ればいくらでも仕事はあると言われた。ところが、来てみるとアメリカは不況でどこにも仕事はなかった。",
        "english": "I  was told that if I came to America, there would be a lot of jobs. However, when  I came, there were no jobs anywhere because of the depression."
      },
      {
        "japanese": "(e).アメリカでは鋸は押して切る。ところが、日本では引いて切る。",
        "english": "In  America you push a saw in order to cut; however, in Japan you pull one to cut."
      },
      {
        "japanese": "(f).A: 今晩のパーティー、君も来てくれるね。B:ところが、あいにく行けないの。",
        "english": "A:  [male speech] You can come to tonight's party, too, can't you? B: [female  speech] No, I'm afraid I can't."
      },
      {
        "japanese": "(g).A: 彼女は結婚しているんでしょう?B:そう見えるでしょう?ところが、まだ独身なんですって。",
        "english": "A:  [female or polite male speech] (She is married, isn't she? B: [female speech]  She looks like it, doesn't she? But I heard that she's still single."
      }
    ],
    "writeup": "##",
    "formation": "##",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: だが; けれど(も); しかし; それが】",
    "antonym": "",
    "source": "resources/original/dojg/all/ところが.yaml"
  }
}