{
  "grammar_point": "とあっては",
  "rank": 10,
  "dojg": {
    "grammar_point": "とあっては",
    "description": "A conditional phrase that indirectly presents a factual situation as a reason.",
    "meaning": "If it is true that; if it is the case that; if; because; since",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "615",
    "examples": [
      {
        "japanese": "(ksa).社長の頼みとあっては断るわけにはいかない。",
        "english": "If (it's true that) it's a favour for the president, I can't say no."
      },
      {
        "japanese": "(ksb).全商品が3割引きで買えるとあっては、遠方からわざわざ人が買いに来るのもうなずける。",
        "english": "If (it's true that) you can buy everything at 30% off, I understand why people come from far away to shop (here)."
      },
      {
        "japanese": "(a).この大学が他の大学に統合されるのは残念だが、国の方針とあっては致し方ない。",
        "english": "It is a pity that this university is going to be integrated into another university, but if that's the national policy, it cannot be helped."
      },
      {
        "japanese": "(b).ブラジル・ドイツ戦のすぐ後とあっては国内チーム同士の試合が物足りなく感じられたのも仕方がない。",
        "english": "Because it came right after the game between Brazil and Germany, it was inevitable that people did not feel the game between the domestic teams was very exciting."
      },
      {
        "japanese": "(c).皆が多忙な身とあっては30人以上の家族が集まれるのはクリスマスの休みしかない。",
        "english": "Since everyone is so busy, Christmas vacation is the only time our family of more than 30 can get together."
      },
      {
        "japanese": "(d).スカイダイビングがここサイパンで楽しめるとあっては、挑戦してみない手はない。",
        "english": "If it's true that we can enjoy skydiving here in Saipan,  there's no reason not to try it."
      },
      {
        "japanese": "(e).どんなに短い作文でも、他の人に読まれ、コメントがつくとあっては、書く時の真剣味が増す。",
        "english": "No matter how short your composition is, if it is read by  others and they make comments, it makes you think more seriously when you  write."
      },
      {
        "japanese": "(f).役人の飲食費に税金が使われたとあっては、誰もが腹立たしく思うのは当たり前だ。しかも、そのことが明るみに出そうになると、今度は圧力をかけて「口封じ」をやったとあっては、もう救いようがない。",
        "english": "If tax money was used to pay for government officials' dining  and drinking, of course people would be angry. But there's no hope if the  ofﬁcials pressured those involved to keep their mouths shut when the practice  was about to be exposed."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)NP\n- とあっては\n- 病気とあっては\n- If it’s true that someone is ill\n- (ii)Sinformal\n- とあっては\n- だ after Adjectiveなstem and Noun is omitted\n- 由美も行くとあっては\n- If it’s true that Yumi is going, too\n- タクシーの方が安いとあっては\n- If it’s true that a taxi is cheaper\n- バスの方が便利とあっては\n- If it’s true that the bus is more convenient\n- 締め切りが今週末とあっては\n- If it’s the case that the deadline is the end of this week",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: (の)であれば; (の)なら; (の)だから; (な)ので】",
    "antonym": "",
    "source": "resources/original/dojg/all/とあっては.yaml"
  }
}