{
  "grammar_point": "と同じで・と違って",
  "rank": 4,
  "bunpro": {
    "grammar_point": "と同じで・と違って",
    "jlpt": "N3",
    "meaning": "Like, Similar to, Unlike, Dissimilar to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Two regular expressions that are used in Japanese for conveying similarity, and dissimilarity are と同じで 'the same as (A)', and と違って 'different to (A)'. While both of these structures use thecase marking particleと to mark (A),同じ is a noun, while違って is the て form of the う - Verb,違う. Due to this, theauxiliary verbだis required after同じ, in order to link (A) and (B).だwill appear in itsconjunctive form.Both と同じで and と違って will be preceded by a noun or noun phrase, before the (B) part of the sentence will describe the similarity/dissimilarity.In this structure, as theconjunction particleて, has a similar role to the conjunctive form of だ (で), both expressions are simply stating that (B) is existing in a state of 'having sameness', or 'having difference' with (A).",
    "examples": [
      {
        "japanese": "彼は僕と同じで、猫アレルギーです。",
        "english": "Just like me, he is allergic to cats."
      },
      {
        "japanese": "母も私と同じで、アウトドアが好きです。",
        "english": "Just like me, my mother likes the outdoors."
      },
      {
        "japanese": "私は弟と違って、本を読むのが大好きです。",
        "english": "Unlike my brother, I love to read books."
      },
      {
        "japanese": "彼女は私と違って、遊園地が苦手です。",
        "english": "Unlike me, she does not like amusement parks very much."
      },
      {
        "japanese": "母親と違って、彼女はとても料理が上手です。",
        "english": "Unlike her mother, she is good at cooking."
      },
      {
        "japanese": "父親と同じで、彼はとても働き者だ。",
        "english": "Just like his father, he is a hard worker."
      },
      {
        "japanese": "他人と違って家族の縁はなかなか切れない。",
        "english": "Unlike other people, I find it hard to cut ties with my family."
      },
      {
        "japanese": "君と同じでその意見に賛成だ。",
        "english": "Like you, I agree with that opinion."
      },
      {
        "japanese": "大統領と違って、副大統領は優しい。",
        "english": "Unlike the president, the vice president is kind."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/と同じで-と違って",
    "false_friends": [
      {
        "term": "みたいに・みたいな",
        "meaning": "Like, Similar to, Resembling",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-468"
  }
}