{
  "grammar_point": "と来(き)たら",
  "rank": 8,
  "bunpro": {
    "grammar_point": "と来(き)たら",
    "jlpt": "N1",
    "meaning": "For …(is the best), When it comes to, Concerning",
    "meaning_warning": null,
    "details": {
      "Get more example sentences!": "Premium users get access to 12 example sentences on all Grammar Points."
    },
    "writeup": "When used in the more literal sense,ときたらis a grammar pattern that means ‘when it comes to (A)’, or ‘concerning (A)’. It is a combination of thecase-marking particleと, and来る combined with theconjunction particleたら ‘if’,来たら. This is not to be confused with the alternative translation ofときたらwhich is ‘that damned (A)’ when used for criticism.ときたらwill attach to the end of a phrase marking what the conversation is ‘concerning’, before that topic will then be explained further. In other words, (A) will present the topic, while (B) will indicate the speaker’s first instinctive thoughts about that topic.For the speaker, (A) is usually something that strongly makes them think of (B). However, it may just be that the relationship between (A) and (B) is a thing that the speaker is implying as obvious, or that goes without saying. Due to this, the (B) phrase often begins with やっぱり or やはり ‘sure enough’.",
    "examples": [
      {
        "japanese": "夏ときたらやっぱりキンキンに冷えたビールですよ！",
        "english": "When it comes to summer, as expected, a cold beer is the best!"
      },
      {
        "japanese": "寒い日ときたら、鍋でしょう。",
        "english": "For a cold day, hot pots (is the best), don't you think?"
      },
      {
        "japanese": "パワハラときたら大問題になるのは当然でしょう。",
        "english": "When it comes to power harassment, of course it is going to become a huge problem."
      },
      {
        "japanese": "「田中さんがクビになったと聞いたよ。」「毎日遅刻ときたらクビになるのは当然でしょ。」",
        "english": "'I heard Mr. Tanaka got fired.''No wonder he would get fired when he was late every day.'"
      },
      {
        "japanese": "ドーナツときたらやっぱり牛乳でしょ！",
        "english": "For donuts, as expected, it's gotta be milk, right?"
      },
      {
        "japanese": "テストで毎回0点を取っているときたら、お母さんが怒らないわけがない。",
        "english": "When you get a zero on every test, there's no way your mother won't get angry."
      },
      {
        "japanese": "暑い日ときたら、やっぱり麦茶よね。",
        "english": "For a hot day, as expected, there's nothing like barley tea, right?"
      },
      {
        "japanese": "こんなに曇っているときたら、雨が降らないはずがない。",
        "english": "When it is so cloudy, it is impossible for it not to rain."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ときたら2",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-439"
  }
}