{
  "grammar_point": "どうにも〜ない",
  "rank": 10,
  "dojg": {
    "grammar_point": "どうにも〜ない",
    "description": "A structure indicating that no matter how hard someone may try, something is impossible.",
    "meaning": "Not ~ by any means; no matter how hard ~ try, ~ cannot ~; there is no way to ~; cannot do ~ at all",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "92",
    "examples": [
      {
        "japanese": "(ksa).私には小説などはどうにも書けない。",
        "english": "I’d never be able to write something like a novel, no matter how hard I try."
      },
      {
        "japanese": "(ksb).この作文は間違いがひどくてどうにも直しようがない。",
        "english": "This composition has such awful mistakes that there is no way to ﬁx it."
      },
      {
        "japanese": "(ksc).最近は携帯がないとどうにも仕事にならない。",
        "english": "Lately we can’t work without a cell phone."
      },
      {
        "japanese": "(a).この書類は印刷が悪くてどうにも読めない。",
        "english": "This document is printed so poorly, there’s no way we can read it."
      },
      {
        "japanese": "(b).あの人はあまりにも内気でどうにも好きになれない。",
        "english": "He is so introverted, I don’t think I’ll ever grow to like him."
      },
      {
        "japanese": "(c).人の悪口をかげで言うなどということはどうにも許せない。",
        "english": "I can’t possibly tolerate someone speaking ill of me behind my back."
      },
      {
        "japanese": "(d).会社経営で破綻寸前まで来るとどうにも救いようがない。",
        "english": "When a company’s management is on the verge of bankruptcy, there is no way to salvage it."
      },
      {
        "japanese": "(e).これだけストレスが溜まると、どうにも解消しようがない。",
        "english": "When stress piles up this much, there’s no way to relieve it."
      },
      {
        "japanese": "(f).バブル経済崩壊後の日本の経済の低迷ぶりはひどいものだけれど、どうにもならない。",
        "english": "The Japanese economic slump since the bubble economy burst is terrible, but there is no help for it."
      },
      {
        "japanese": "(g).色々お礼の言葉を書こうと思っていたのですが、どうにも言葉になりません。今まで本当にありがとうございました。",
        "english": "I was going to send you a thank-you note but I just couldn’t ﬁnd the words to say what I meant. Thank you very much!"
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)どうにもVpotential negative\n- ない\n- どうにも話せない\n- Can’t speak no matter how hard someone tries\n- (ii)どうにもVます\n- ようがない\n- どうにも食べようがない\n- There is no way to eat it\n- (iii)どうにもNoun\n- にならない\n- どうにも勉強にならない\n- Can’t study at all",
    "part_of_speech": "Structure",
    "related": "【Related Expression: どうにもこうにも~ない】",
    "antonym": "",
    "source": "resources/original/dojg/all/どうにも～ない.yaml"
  }
}