{
  "grammar_point": "どころではない",
  "rank": 8,
  "bunpro": {
    "grammar_point": "どころではない",
    "jlpt": "N2",
    "meaning": "This is not the time for…, Far from, Out of the question",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When the voiced form of ところ 'place', どころ appears in Japanese, it will very often be part of a set phrase expressing some kind of negative situation or evaluation.どころではないis no different, and highlights that it is 'far from (A)', or that '(A) is out of the question'. These translations appear when the actual situation is considered to be even more remarkable than the phrase thatどころではないis attached to.This grammar pattern will be seen at the end of phrases indicating some situation which is not ideal. Additionally, ではない may be replaced with じゃない in more casual settings.どころではないmay also sometimes be translated as 'it is not the time for (A)'. In sentences that use this interpretation, (A) is considered to be something that there is no allowance for due to there being far more important matters. This use will reflect the personal opinion of the speaker.",
    "examples": [
      {
        "japanese": "出産は痛いどころではないらしい。",
        "english": "They say childbirth is far from painful."
      },
      {
        "japanese": "締め切りが迫って来てるから、休憩を取るどころじゃない。",
        "english": "The deadline is approaching, so taking a break is out of the question."
      },
      {
        "japanese": "お母さんからお父さんが倒れたと連絡があったので、仕事どころではない。",
        "english": "It is not the time for working, since I got a message from my mother telling me that my father collapsed."
      },
      {
        "japanese": "今は仕事が忙しいし、お金も全然ないから、結婚どころじゃない。",
        "english": "Since I am busy with work and have no money, it is not the time to get married."
      },
      {
        "japanese": "仕事が忙しすぎて、年休を取るどころではない。",
        "english": "I am so busy at work, taking time off is out of the question."
      },
      {
        "japanese": "大病を患っているんだから、仕事どころではない。",
        "english": "Since I have become severely ill, this is not the time for work."
      },
      {
        "japanese": "今まで恋人も出来たことがないのに、結婚どころではない。",
        "english": "Since I haven't even had a lover yet, getting married is out of the question."
      },
      {
        "japanese": "「早く美容室に行け」と言われても、今はそれどころではない。",
        "english": "Even if you were told, 'Go to a beauty parlor right away!', now is not the time for that."
      },
      {
        "japanese": "休みの日はたくさん寝たい。レジャーどころではない。",
        "english": "On my day off, I want to sleep a lot. Leisure activities are out of the question."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/どころではない",
    "false_friends": [
      {
        "term": "ものか",
        "meaning": "Definitely not, Absolutely not, Impossible, Do you really think~?",
        "kind": "synonym"
      },
      {
        "term": "どころか",
        "meaning": "Far from, Anything but",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-480"
  },
  "dojg": {
    "grammar_point": "どころではない",
    "description": "A phrase indicating that an action/state is simply impossible due to an adverse situation.",
    "meaning": "Cannot; be simply impossible; simply don’t/doesn’t have time; be far from ~; anything but ~; no way; far from; be out of question",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "85",
    "examples": [
      {
        "japanese": "(ksa).自分のことで精一杯で、人のことなど考えるどころではない。",
        "english": "I'm so busy with my own things that I simply can't think of  other people's matters (right now)."
      },
      {
        "japanese": "(ksb).年末なのに多忙で、海外旅行(をする)どころではなかった。",
        "english": "I was so busy toward the end of the year that there was no way  I could travel abroad."
      },
      {
        "japanese": "(ksc).津波で愛する娘を亡くしたので、悲しいどころではない。死にたい気持ちだ。",
        "english": "I lost my beloved daughter in the tsunami. I'm not just sad. I  feel like killing myself."
      },
      {
        "japanese": "(ksd).定年になっても暇どころではない。毎日野菜作りに精を出している。",
        "english": "I have retired, but I can't say I have any free time. Every day  I put all my energy into vegetable gardening."
      },
      {
        "japanese": "(a).毎日の生活に汲々としていて、株を買うどころではありません。",
        "english": "My everyday life is so tight financially that I simply can't  consider buying stocks."
      },
      {
        "japanese": "(b).私はテニスが大好きだが、最近大怪我をしてテニスどころではない。",
        "english": "I love tennis, but I sustained a severe injury recently, and  playing tennis is now out of the question."
      },
      {
        "japanese": "(c).A:おい、今晩、飲みに行こうか。B:それどころじゃないんだ。妻が入院したんだ.",
        "english": "A: Hey, why don't we go drinking tonight? B: No way. My wife  has been hospitalized."
      },
      {
        "japanese": "(d).目下寝たきりの母の介護で、外出どころではないんです。",
        "english": "Right now I'm taking care of my bed-ridden mother, so I simply  don't have time to leave the house."
      },
      {
        "japanese": "(e).このところ学生の修論指導で研究どころじゃないんだよ。",
        "english": "I've been advising MA students on their theses lately and I  simply don't have time to do research."
      },
      {
        "japanese": "(f).A:妻：あなた、この週末に熱海の温泉にでも行かない? B:夫：それどころじゃないんだよ。原稿の締め切りが来週の月曜日なんだ。",
        "english": "Wife: Honey, why don't we go to the hot springs in Atami this  weekend? Husband: No way! The deadline for  the manuscript is next Monday."
      },
      {
        "japanese": "(g).スイカマラソンは、レース中やレース後にスイカが食べられる。でも、走り終わったら、へとへとで、とてもスイカを食べるどころではないそうだ。",
        "english": "In the watermelon marathon, runners can eat watermelon during  or after the race, but I hear that when they're done running they're so tired  that there's no way they can eat the watermelon."
      },
      {
        "japanese": "(h).今日は非常に暑かった。もう暖かいどころではない。",
        "english": "It was extremely hot today. You can't just call it warm  anymore."
      },
      {
        "japanese": "(i).ものすごい排気ガスを吸っているから、健康どころではない.",
        "english": "I am breathing in all these awful exhaust fumes, so I am far  from being healthy."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjectiveい}informal nonpast\n- どころではない\n- 映画を見るどころではない\n- Someone simply doesn’t have time to see a movie\n- 面白いどころではない\n- Someone is far from being interesting\n- (ii)Noun (をする)\n- どころではない\n- Where Noun is typically an action noun\n- ゴルフ(をする)どころではない\n- I simply don’t have time to play golf\n- 散歩(をする)どころではない\n- I simply don’t have time to take a walk\n- (iii)Adjective な stem\n- どころではない\n- 自由どころではない\n- Something/someone is hardly free",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: どころか; こどろのはなしではない】",
    "antonym": "",
    "source": "resources/original/dojg/all/どころではない.yaml"
  }
}