{
  "grammar_point": "どうも",
  "rank": 6,
  "dojg": {
    "grammar_point": "どうも",
    "description": "An adverb to indicate that one cannot make a definite statement about something due to lack of hard evidence.",
    "meaning": "I don't know why but; I cannot manage to; just; from what I gather; seem; no matter how ~; I gather that ~; for some reason",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "36",
    "examples": [
      {
        "japanese": "(ksa).この文の意昧がどうもよく分からない。",
        "english": "I tried, but I cannot understand the meaning  of this Japanese sentence very well."
      },
      {
        "japanese": "(ksb).鈴木さんはどうも京都大学に入りたいらしい。",
        "english": "I gather that Mr. Suzuki wants to enter Kyoto  University."
      },
      {
        "japanese": "(ksc).あの先生の授業はどうも面白くない。",
        "english": "I don't know why, but that instructor's class  is uninteresting."
      },
      {
        "japanese": "(a).このごろどうも体の詞子がよくないんです。",
        "english": "I don't know why, but lately I don't feel  very good."
      },
      {
        "japanese": "(b).あの人の日本語はどうも聞きにくい。",
        "english": "I don't know why, but his Japanese is hard to  listen to."
      },
      {
        "japanese": "(c).先生、この間題の意味がどうもつかめないんです。",
        "english": "Professor, I can't manage to grasp the intent  of this problem."
      },
      {
        "japanese": "(d).こんな田舎に住むのはどうも不便だ。",
        "english": "It is just inconvenient to live in such  countryside."
      },
      {
        "japanese": "(e).うちの子はテレビばかり見て、どうも本を読まない。",
        "english": "I don't know why, but our kids are always  watching TV and do not read books."
      },
      {
        "japanese": "(f).あの先生はどうも厳しいようだ。",
        "english": "That teacher seems strict to me."
      },
      {
        "japanese": "(g).ジョンは日本語を話すのは上手だが、読むのはどうも下手なようです。",
        "english": "John is good at speaking Japanese but for  some reason he seems poor at reading it."
      },
      {
        "japanese": "(h).その男がどうも犯人に違いないと思っていたが、やっぱりそうだった。",
        "english": "I gathered that he must be the one who did  it, and my guess was right."
      },
      {
        "japanese": "(i).父は症状からしてどうもがんになったらしい。",
        "english": "Judging from the symptoms my father seems to  have cancer."
      },
      {
        "japanese": "(j).彼女が今朝電車の中で僕に言ったことがどうも気になった。",
        "english": "What she said to me this morning in the train  somehow bothered me."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)どうも~\n- {V /Adjective (い/な)} negative\n- どうも話せない\n- No matter how one tries, someone can’t talk\n- どうも食べられない\n- No matter how one tries, someone doesn’t eat\n- どうもよくない\n- I don’t know why but something isn’t good\n- どうも上手じゃない\n- I don’t know why, but someone is not good at something\n- (ii)どうも~\n- {V /Adjective い} informal {らしい/ようだ}\n- どうも話す{らしい/ようだ}\n- I gather that someone is going to talk\n- どうも食べる{らしい/ようだ}\n- I gather that someone is going to eat\n- どうも高い{らしい/ようだ}\n- I gather that something is expensive\n- (iii)どうも~\n- Adjective な stem {らしい/ようだ} or Adjective な stem だった{らしい/ようだ}\n- どうも静か{らしい/ようだ}\n- I gather that something is quiet",
    "part_of_speech": "Adverb",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/どうも.yaml"
  }
}