{
  "grammar_point": "なさる",
  "rank": 2,
  "bunpro": {
    "grammar_point": "なさる",
    "jlpt": "N4",
    "meaning": "To do (Honorific)",
    "meaning_warning": "Remember not to use honorific language when speaking about yourself and your actions!",
    "details": {
      "Register": "Polite",
      "使用域": "敬語"
    },
    "writeup": "なさるis anhonorific languageverb which acknowledges and respects the actions of another (never the speaker). Likeお〜になる,なさるhas exactly the same meaning asする.なさるcan be utilized in any situation whereするwould be used, as a direct replacement. It is a special-class verb, which means that it has some unique conjugation rules. In its casual form, it will conjugate in exactly the same way as aう-Verb.However, in the polite form, instead of る changing to り (as would be expected of aう-Verb), it will change to い instead.CautionAlthough some Japanese speakers will use it, expressions likeなさっていらっしゃるare considered double keigo (なさるishonorific language, andいらっしゃるis alsohonorific language), and are technically incorrect. However,なさるmay be partnered with ます, which is simplypolite speech.Fun Factなさるis considered a little bit old fashioned in modern Japanese, andお〜になるis the preferred form used by most native speakers.",
    "examples": [
      {
        "japanese": "週末もお仕事をなさるのですか。",
        "english": "Are you going to work over the weekend also?"
      },
      {
        "japanese": "勘違いなさらないで下さい。",
        "english": "Please don't take this the wrong way."
      },
      {
        "japanese": "社長は先週どちらでゴルフをなさったのですか。",
        "english": "Boss, where did you go to play golf last week?"
      },
      {
        "japanese": "納得なさらないなら私に言ってください。",
        "english": "If you are not with me on this, please let me know."
      },
      {
        "japanese": "お飲み物はどうなさいますか?",
        "english": "What would you like to drink?"
      },
      {
        "japanese": "忘れ物はなさいませんか。",
        "english": "Did you forget anything?"
      },
      {
        "japanese": "お客様、どうなさいましたか。",
        "english": "Valued guest, what seems to be the issue?"
      },
      {
        "japanese": "彼は計画を変えることはなさいませんでした。",
        "english": "He did not do anything to change the plan."
      },
      {
        "japanese": "社長は今、ゴルフをなさっていらっしゃる。",
        "english": "The CEO is currently playing golf quite playingly. (Unnatural Japanese, with unnatural English to match!)"
      },
      {
        "japanese": "社長は今ゴルフをなさっています。",
        "english": "The CEO is currently playing golf. (Natural Japanese)"
      },
      {
        "japanese": "お飲み物はどうなさいますか。",
        "english": "What will you have to drink?"
      },
      {
        "japanese": "今朝、彼は家を留守になさいました。",
        "english": "He was away from home this morning."
      },
      {
        "japanese": "子供のころスポーツをなさっていたんですね。",
        "english": "I hear that you played sports when you were younger."
      },
      {
        "japanese": "今何を勉強なさっていますか。",
        "english": "What are you studying now?"
      },
      {
        "japanese": "何をなさろうとするのですか。",
        "english": "What will you attempt to do?"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/なさる",
    "false_friends": [
      {
        "term": "いたす",
        "meaning": "To do (Humble)",
        "kind": "antonym"
      },
      {
        "term": "なさい",
        "meaning": "Command to do",
        "kind": "synonym"
      },
      {
        "term": "お〜になる",
        "meaning": "To do (Honorific)",
        "kind": "synonym"
      },
      {
        "term": "する",
        "meaning": "To do, To make into",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-520"
  }
}