{
  "grammar_point": "ないでもない",
  "rank": 9,
  "bunpro": {
    "grammar_point": "ないでもない",
    "jlpt": "N1",
    "meaning": "Kind of, Might, Slightly, It’s not (impossible) that, Somewhat, In some respects",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ないでもない, andなくもないare structures that have the literal meaning of 'to not not be (A)', and are used to express that something is 'a little (A)', or 'kinda (A)'. These structures are used primarily when the speaker can neither confirm or deny (A), but may also be used simply when not wanting to directly disagree with something that another person has said.Bothないでもないandなくもないmay be used after either the negated form of verbs, ornounsfollowed by thecase marking particleが.ないでもないandなくもないare completely interchangeable, with the primary difference simply being thatなくもないis less frequently used. Additionally,ないものでもないmay also be seen, but just likeなくもない, it is far less common.",
    "examples": [
      {
        "japanese": "先輩「あの雲を見ろよ。シマウマみたいに見えるぞ。」後輩「まあシマウマに見えないでもないですね。」",
        "english": "Senpai: 'Look at that cloud! It looks like a zebra.'Kouhai: 'Well, it kind of looks like a zebra.'"
      },
      {
        "japanese": "友達との話：ちよ「猫が好きじゃないの?かわいくない?」さかき「猫はかわいいと思わないでもないけど、噛むしひっかくしできるだけ避けるよ。」",
        "english": "Chat between friends, Chiyo: 'Don't you like cats? Aren't they cute?'Sakaki: 'I think that they are kind of cute, but they bite and scratch so I try to avoid them as much as possible.'"
      },
      {
        "japanese": "友人に文句を言う：「最近、両親はうちの子犬に夢中だよ。まあその気持ちはわからないでもないけど。とても可愛らしいから。」",
        "english": "Complaining to a friend: 'Recently, my parents are all about our puppy! I kind of understand them though. It's pretty adorable.'"
      },
      {
        "japanese": "「なんとなく彼が言った話には欠陥や問題がたくさんあるような気がしないでもないが、いってくれないよりマシだ。」",
        "english": "'I kind of feel that there are many gaps and problems in his story, but it is better than nothing.'"
      },
      {
        "japanese": "ペトルーチオ「ケイトは顔だけ見ると、とても美しいと感じられないでもないんだけど・・・性格が悪い。」",
        "english": "Petruchio: 'When looking only at the face, Kate can seem kind of pretty, but her character is awful.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ないでもない",
    "false_friends": [
      {
        "term": "といってもいい",
        "meaning": "You could say, You might say",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-496"
  },
  "dojg": {
    "grammar_point": "ないでもない",
    "description": "A phrase that indicates the speaker/writer hesitantly feels or expresses that something is the case.",
    "meaning": "Seem to ~; somewhat; rather; may",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "300",
    "examples": [
      {
        "japanese": "(ks).今が私の人生で一番幸せな時期だという気がしないでもない。",
        "english": "I seem to feel that right now is the happiest time of my  life."
      },
      {
        "japanese": "(a).あの時大学を辞めたことを、今では少し早まったなと思わないでもない。",
        "english": "Now I rather feel that leaving the university at that time was  a bit too hasty."
      },
      {
        "japanese": "(b).そういえば、そういう話、どこかで聞いたことがあるような気がしないでもないです。",
        "english": "Come to think of it, I seem to feel that I've heard something  like that somewhere."
      },
      {
        "japanese": "(c).私は「結婚しない主義」でもないし、一度結婚してみたいという気もないでもないんですが、なかなかいい相手が見つかりません。",
        "english": "I am unmarried not because of principle, and I wouldn't mind  getting married, but it is really hard to ﬁnd a good partner."
      },
      {
        "japanese": "(d).日本人として、アメリカ企業におけるリストラを見ると非情さを感じないでもない。",
        "english": "For me, as a Japanese, the way American companies lay off  workers strikes me as rather inhumane."
      },
      {
        "japanese": "(e).あなたの苦しい気持ちが分からないでもない。",
        "english": "I do somewhat understand the pain you are feeling."
      },
      {
        "japanese": "(f).白衣に眼鏡なら、一見普通の医者に見えないでもない。",
        "english": "Wearing a white gown and eyeglasses, he could be taken for a  doctor at first sight."
      },
      {
        "japanese": "(g).心底謝れば許してやらないでもないけど。",
        "english": "If he really apologizes to me from the bottom of his heart,  then I may ﬁnd it in me to forgive him (, but . . .)."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vnegative\n- ないでもない\n- 思わないでもない\n- Someone kind of thinks that ~\n- 食べないでもない\n- Someone may eat something\n- しないでもない\n- Someone may do something",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: ないこともない; なくもない】",
    "antonym": "",
    "source": "resources/original/dojg/all/ないでもない.yaml"
  }
}