{
  "grammar_point": "ならともかく",
  "rank": 6,
  "bunpro": {
    "grammar_point": "ならともかく",
    "jlpt": "N2",
    "meaning": "If it's (A), sure, but (B), Putting aside (A), (B)",
    "meaning_warning": null,
    "details": {
      "Get more example sentences!": "Premium users get access to 12 example sentences on all Grammar Points."
    },
    "writeup": "When なら, the hypothetical form of the auxiliary verb だ is paired with the adverb ともかく 'to set aside', it will often be translated as 'if it is (A), sure, but not in the case of (B)', or more simply 'putting (A) aside, (B)'. This structure usually just indicates that if it were (A), then the result or situation would be different, but because it is not (A), the result or situation is not different (it is as it currently is).なら is often classified as and functions in the same way as an adverbial particle, meaning that it will primarily be appended to the plain form of nouns, verbs, or adjectives. However, ならともかく itself is used mainly after nouns.For more details about ともかく, please see the fun fact on theはともかくlesson page!",
    "examples": [
      {
        "japanese": "俺の妹ならともかく、俺はそんなことしねぇ〜よ。",
        "english": "If it's my little sister, sure, but I would never do such a thing."
      },
      {
        "japanese": "丈夫で何回も使えるものならともかく、なんでわざわざ高くて使い捨てみたいなもんを買うんですか。",
        "english": "If it is tough and can be used multiple times, sure, but why would you go out of your way to buy something that is expensive and basically disposable."
      },
      {
        "japanese": "新人ならともかく、君みたいなベテランがわからないようじゃ困ったもんだよ。",
        "english": "I understand if a newbie didn't know, but it is a problem if a long time worker like you didn't know."
      },
      {
        "japanese": "夜ならともかく、夏は日中は外に出られない。",
        "english": "If it's night, sure, but you can't go outside during the day in summer."
      },
      {
        "japanese": "赤ん坊ならともかく、子供には叱る事も必要だ。",
        "english": "If it's a baby, sure, but it's necessary to scold kids."
      },
      {
        "japanese": "生魚ならともかく、納豆は食べられません。",
        "english": "If it's raw fish, sure, but I can't eat natto."
      },
      {
        "japanese": "社長ならともかく、平社員に決定権はありません。",
        "english": "If it's the president, sure, but a rank-and-file staff member has no right to make decisions."
      },
      {
        "japanese": "イケメンならともかく、そうでない人はナンパで成功しないだろう。",
        "english": "If it's a hottie, sure, but a person that isn't would surely not succeed at picking up."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ならともかく",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-528"
  }
}