{
  "grammar_point": "なら〜で",
  "rank": 8,
  "bunpro": {
    "grammar_point": "なら〜で",
    "jlpt": "N1",
    "meaning": "If ~ should, Before ~ should",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "なら〜でis a structure which appears in situations where the same word will repeat twice, followed by some sort of opinion in regard to it. It can be translated as 'if (A), you should (B)', or 'before (A), you should (B)'. In many cases it will be used to exhibit the speaker's dissatisfaction about something.なら〜でmay follow verbs in theirstandard forms, い-Adjectives, な-Adjectives or nouns. Both なら and で are functioning asconjunction particlesin this grammar pattern.CautionThis nuance is different to ば〜で,なら〜で, and たら〜たで, which are used when conveying that something either is or is not an issue in relation to (A). With this pattern,なら〜でwill only appear following な-Adjectives.",
    "examples": [
      {
        "japanese": "仕事するならするでちゃんとしろ！",
        "english": "If you are going to work, you should do it properly."
      },
      {
        "japanese": "欲しいなら欲しいで始めっから言ってくれればよかったのに！",
        "english": "If you wanted it, you should have told me so!"
      },
      {
        "japanese": "嫌なら嫌でやめればいい。嫌々やっていても誰のためにもならないでしょ。",
        "english": "If you don't like it, you should quit. Continuing something you don't want to do does not benefit anyone."
      },
      {
        "japanese": "休むなら休むでちゃんと休んでください。仕事のことはわたしたちに任せてもらって全然いいんで。",
        "english": "If you are going to take a break, please take a break. You can leave work to us, so no need to worry about that."
      },
      {
        "japanese": "上司：「塗るなら塗るでもっと丁寧に仕上げなさい。」",
        "english": "Boss: 'If you are going to paint, then (you should) be more careful.'"
      },
      {
        "japanese": "夜１１時、子供：「あした、学校で水彩絵の具が要る。」母：「必要なら必要で早く言っとくべきだったでしょ。もうお店が閉まっちゃったよ。」",
        "english": "11 p.m., child: 'I need watercolors for school tomorrow.'Mother: 'If you needed it, you should have told me sooner. The shops are already closed.'"
      },
      {
        "japanese": "娘：「もう空港で1時間も待ってるよ。」母：「もう待っているなら待っているでもっと早くケータイを鳴らしてくれたらよかったのに・・・」",
        "english": "Daughter: 'I have already been waiting at the airport for an hour!'Mother: 'If you were already waiting, then you should have called me sooner…'"
      },
      {
        "japanese": "彼女：「実はお腹が痛いの...」彼氏：「お腹が痛いなら痛いで、ベッドで寝た方がいいよ。あとは俺に任せてね。」",
        "english": "Girlfriend: 'To be honest, my stomach hurts...'Boyfriend: 'If your stomach hurts then you should lie in bed. Leave the rest to me, ok?'"
      },
      {
        "japanese": "イライラした妻、ダラダラ食べる夫に：「食べるなら食べるで、きちんと食べなさい。」",
        "english": "Irritated wife to her husband who is sluggishly eating: 'If you are going to eat, you should do it properly!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/なら-で",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-526"
  }
}