{
  "grammar_point": "なす",
  "rank": 10,
  "dojg": {
    "grammar_point": "なす",
    "description": "A verb that means “to cause something to happen”",
    "meaning": "Do; perform; make; change; constitute",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "365",
    "examples": [
      {
        "japanese": "(ksa).災い(を)転じて福となす。",
        "english": "One can turn misfortune into a blessing. [proverb]"
      },
      {
        "japanese": "(ksb).比喩に関しては現在多くの研究がなされている。",
        "english": "A large amount of research is being done on metaphors now."
      },
      {
        "japanese": "(ksc).人間というものは、悪をなす存在である。",
        "english": "Human beings exist in order to do evil."
      },
      {
        "japanese": "(ksd).民主主義はアメリカ合衆国の基盤をなす思想である。",
        "english": "Democracy is the founding ideology (literally: the ideology  that constitutes the foundation) of the United States of America."
      },
      {
        "japanese": "(a).顧客創造のためには自社製品の潜在利益を利益となす努力を払わなければならない。",
        "english": "We have to make the effort to turn our products' potential  proﬁt into (real) proﬁt in order to gain more customers."
      },
      {
        "japanese": "(b).患者が入院時に病名や病状について理解していない場合は、必要に応じて適切な説明がなされるべきである。",
        "english": "If patients do not understand the name of their disease and its  symptoms at the time of hospitalization, they should be given an appropriate  explanation as needed."
      },
      {
        "japanese": "(c).インターネットに関してこのような質問がなされる可能性は高い。",
        "english": "Such questions are likely to be asked regarding the Internet."
      },
      {
        "japanese": "(d).善をなすのを急げ。悪から心を退けよ。",
        "english": "Hurry to do good. Turn your mind away from evil."
      },
      {
        "japanese": "(e).権利の保護には最善の努力をなすことを目標にしている。",
        "english": "For the protection of our rights we aim at doing our very best."
      },
      {
        "japanese": "(f).コンピュータサイエンスの基本をなす考え方は、様々な科学の分野で重要になってくると思われる。",
        "english": "It seems that the fundamental concepts (literally: the concepts  underlying the foundation) underlying computer science will become important in  various ﬁelds of science."
      },
      {
        "japanese": "(g).情報リスクマネジメントという視点で、ビジネスの根幹をなす情報システムを評価・管理することが必須だ。",
        "english": "From the viewpoint of risk management, it is essential to  assess and manage the informational systems that constitute the core of a  business."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun1をNoun2と\n- なす\n- 醜を美となす\n- Someone changes ugliness to beauty\n- (ii)Nounが\n- なされる\n- 外国語教育がなされる\n- Foreign language education is provided\n- (iii)Nounを\n- なす\n- 善をなす\n- Someone does good deeds\n- 基本をなす\n- Something constitutes the foundation",
    "part_of_speech": "Verb",
    "related": "【Related Expression: する; 行う; に/となる】",
    "antonym": "",
    "source": "resources/original/dojg/all/なす.yaml"
  }
}