{
  "grammar_point": "なかなか〜ない",
  "rank": 4,
  "bunpro": {
    "grammar_point": "なかなか〜ない",
    "jlpt": "N3",
    "meaning": "Not really, Hardly, Not easily or readily, By no means, Far from",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When used positively, なかなか means to be 'very', or 'considerably' something. However, when used in a sentence that has a verb in the ない (or ありません) form, it carries the meaning of 'not at all', 'hardly', or 'far from'. Quite often, this expression is used to highlight something that the speaker expects should happen, but for some reason does/is not.To use なかなか (or中々in its kanji form), なかなか will be put at the beginning of a phrase (or directly before the negative verb), before further describing the situation.Fun FactAs中々just means the 'middle' of something, this expression can be thought of as highlighting that something is not in the 'middle' (optimal place to achieve a certain result). Due to this, it often expresses that the speaker wants something to be in that 'optimal position' but feels frustration due to the fact that it isn't.",
    "examples": [
      {
        "japanese": "先生、風邪がなかなか治らないんですけど、どうした方がいいですか?",
        "english": "Doctor, my cold is hardly getting any better, what should I do?"
      },
      {
        "japanese": "仕事が忙しくて中々休みが取れないんだよね。",
        "english": "Work is getting so busy that I can hardly take a day off."
      },
      {
        "japanese": "あいつなかなか来ないね。連絡もないし、俺たちだけで行こう。",
        "english": "He is not coming at all. Since he hasn't contacted us, let's just go without him."
      },
      {
        "japanese": "このシステムは中々改善されない。",
        "english": "This system is far from being improved."
      },
      {
        "japanese": "調査が中々進まない。",
        "english": "The survey hardly makes any forward progress."
      },
      {
        "japanese": "貯金が中々できない。",
        "english": "I can hardly save any money."
      },
      {
        "japanese": "この飲み物は中々飲めない珍しい飲み物です。",
        "english": "This is a rare and not so easily drinkable drink."
      },
      {
        "japanese": "最近、あたしは中々やる気が出ない。",
        "english": "Recently I am not easily motivated. (hardly)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/なかなか-ない",
    "false_friends": [
      {
        "term": "なかなか",
        "meaning": "Very, Quite, Considerably",
        "kind": "antonym"
      },
      {
        "term": "全く〜ない",
        "meaning": "Not~at all",
        "kind": "synonym"
      },
      {
        "term": "すこしも〜ない",
        "meaning": "Not even a little, Not at all, Not in the least, Never",
        "kind": "synonym"
      },
      {
        "term": "あまり〜ない",
        "meaning": "Not very, Not much, Not really, Hardly",
        "kind": "synonym"
      },
      {
        "term": "別に〜ない",
        "meaning": "Not really, Not particularly, It's not like...",
        "kind": "synonym"
      },
      {
        "term": "めったに〜ない",
        "meaning": "Hardly, Rarely, Seldom",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-505"
  }
}