{
  "grammar_point": "など",
  "rank": 1,
  "bunpro": {
    "grammar_point": "など",
    "jlpt": "N4",
    "meaning": "Such as, Things like, Etc., And so on",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "などis anadverbial particlethat is used to express that something is being presented as an example, but that other things in the same category also exist. In this way, it is regularly translated as 'such as', 'things like', or 'and so on'.などmay be used after nouns, to describe that (A) is being presented as an example from within a group. Alternatively,などcan be followed byの(B), to show that (A) is only one type of thing from the broader category, (B).などis regularly seen in its kanji form,等. This kanji itself has a similar meaning to 'etc' in English.Fun FactThe kanji for等is also used in the pluralizing suffix,ら. Due to this, we can see that this kanji is regularly utilized to highlight something that exists as part of a larger group.In the first sentence,などpresents (A) as being part of a larger group of similar things. This is exactly the same thing that happens in the second sentence withら.Fun Factなどis also sometimes written asなんか, and has an interchangeable meaning in many situations. However,なんかwill never use the kanji form of等.",
    "examples": [
      {
        "japanese": "この公園では石などを投げないでください。",
        "english": "Do not throw rocks and so on in this park."
      },
      {
        "japanese": "彼はいつもルームメイトなどの悪口を言っています。",
        "english": "He is always badmouthing people, like his roommates."
      },
      {
        "japanese": "鞄や靴等を川に捨ててはならない。",
        "english": "You mustn't discard things such as bags and shoes into the river."
      },
      {
        "japanese": "あいつ等本当にうるさいね。",
        "english": "Those people are very noisy, don't you think."
      },
      {
        "japanese": "イタリアやアメリカなどに行きたい。",
        "english": "I want to go to places such as America and Italy. (etc. / and so on)"
      },
      {
        "japanese": "宿題をしてから、ゲームなどをゆっくりする。",
        "english": "After doing my homework, I relax with things like video games. (etc. / and so on)"
      },
      {
        "japanese": "フルーツはぶどうなどが好きです。",
        "english": "As for fruits, I like grapes and such. (etc. / and so on)"
      },
      {
        "japanese": "趣味などを教えてください。",
        "english": "Please tell me things like your hobbies. (etc. / and so on)"
      },
      {
        "japanese": "明日から、準備などをするつもりです。",
        "english": "From tomorrow, I plan on doing things like preparing. (etc. / and so on)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/など",
    "false_friends": [
      {
        "term": "とか〜とか",
        "meaning": "Among other things, For example, Such as",
        "kind": "synonym"
      },
      {
        "term": "といった",
        "meaning": "Such as, Like, So much as",
        "kind": "synonym"
      },
      {
        "term": "なんか・なんて",
        "meaning": "Such as, Things like, Emphasis",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-523"
  },
  "dojg": {
    "grammar_point": "など",
    "description": "A marker that indicates exemplification.",
    "meaning": "And so on; and the like; for example; things like ~",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "267",
    "examples": [
      {
        "japanese": "(ks).日本の食べ物の中では寿司や天ぷらなどが好きだ・好きです。",
        "english": "Among Japanese foods I like things like sushi and tempura."
      },
      {
        "japanese": "(a).A:冬休みはどこに行きましょうか。 B:ハワイなどどうですか。",
        "english": "A: Where shall we go during the winter vacation?  B: How about Hawaii, for example?"
      },
      {
        "japanese": "(b).大学ではフランス語やドイツ語などを勉強した。",
        "english": "In college I studied French and German and the like."
      },
      {
        "japanese": "(c).この大学には中国や韓国などから学生が大勢来ます。",
        "english": "A lot of students from China, Korea and so on come to this college."
      },
      {
        "japanese": "(d).A:経済学を専攻するつもりですか。 B:いいえ、経済学など専攻するつもりはありません。",
        "english": "A: Are you going to major in economics?  B: No, I have no intention of majoring in things like economics."
      },
      {
        "japanese": "(e).A:この翻訳をして下さいませんか。 B:こんな難しいもの、私などには出来ません。",
        "english": "A: Could you kindly translate this for me?  B: A person like me cannot translate such a difficult thing."
      }
    ],
    "writeup": "## 1. A particle normally follows など, as in:",
    "formation": "##",
    "part_of_speech": "Particle",
    "related": "【Related Expression: なんか】",
    "antonym": "",
    "source": "resources/original/dojg/all/など.yaml"
  }
}