{
  "grammar_point": "なり",
  "rank": 9,
  "bunpro": {
    "grammar_point": "なり",
    "jlpt": "N1",
    "meaning": "As soon as, The moment, When",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "なりis an old-fashioned particle in Japanese that has several different uses. One of those uses is to convey the meaning of 'as soon as (A), (B)', or 'the moment of (A), (B)'. This structure will follow thedictionary formof verbs and is classified as aconjunction particle.(B) is usually something that is surprising, and brought about by a strong sense of will or emotion. Additionally,なりis almost always used in relation to other people, rather than oneself.Fun FactDespite appearing to be a conjugation of the う-Verb なる 'to become' at first glance,なりis actually one of the readings of形, meaning 'shape', and refers to the overall situation of (A) in a similar way to ところ.",
    "examples": [
      {
        "japanese": "息子が家に上がるなりトイレへと駆け込んだ。",
        "english": "My son ran to the toilet as soon as he entered the house."
      },
      {
        "japanese": "ママ友が私の家に入るなり、冷蔵庫の中を物色し始めた。",
        "english": "As soon as my mom-friend came into my house, she started to go through my refrigerator."
      },
      {
        "japanese": "彼は机に座るなりすぐスマホをいじり始めたから注意した。",
        "english": "I warned him because he started playing on his phone as soon as he sat down."
      },
      {
        "japanese": "踊りを止めるなり、彼女が急にキスしてくれたんだ。気持ちいい。",
        "english": "As soon as I stopped dancing, she suddenly kissed me. I feel great."
      },
      {
        "japanese": "父が出張から帰るなり母は泣きだした。",
        "english": "The moment father returned home from a business trip, mother started crying."
      },
      {
        "japanese": "故郷に帰るなり灰燼に帰した家を見て、驚き、悲しんだ。",
        "english": "The moment I returned to my home town, I saw my house reduced to ashes. I was shocked and saddened."
      },
      {
        "japanese": "実家のお母さんからの電報が来るなり、山田さんは青ざめた。",
        "english": "As soon as the telegram from his mother came, Yamada became pale."
      },
      {
        "japanese": "うちの奥さんは毎日起きるなりスマホで電子メールを見ている。",
        "english": "As soon as my wife wakes up, she checks mail on her smartphone."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/なり",
    "false_friends": [
      {
        "term": "と同時に",
        "meaning": "At the same time as, The instant, The moment, As well as",
        "kind": "synonym"
      },
      {
        "term": "たとたんに",
        "meaning": "The instant or moment, As soon as, Just as",
        "kind": "synonym"
      },
      {
        "term": "次第",
        "meaning": "As soon as",
        "kind": "synonym"
      },
      {
        "term": "かと思ったら・かと思うと",
        "meaning": "Then again, Just when I thought, No sooner than",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-531"
  },
  "dojg": {
    "grammar_point": "なり",
    "description": "A conjunction meaning “soon after”.",
    "meaning": "The moment; when; as soon as; soon after; no sooner ~ than",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "355",
    "examples": [
      {
        "japanese": "(ks).妻は私の顔を見るなり泣き出した。",
        "english": "My wife began to cry the moment she saw me (literally: my  face)."
      },
      {
        "japanese": "(a).首相は会議場を出るなり記者団の質問攻めにあった。",
        "english": "The prime minister was bombarded with questions by a group of  reporters soon after he left the conference hall."
      },
      {
        "japanese": "(b).部屋に入るなりルームサービスの人がお茶とお菓子を持ってきてくれた。",
        "english": "No sooner had we entered our room than room service brought tea  and sweets."
      },
      {
        "japanese": "(c).編集長は私と顔を合わせるなり私をにらみつけ、「話がある」と言った。",
        "english": "The chief editor glared at me when she saw me, and told me that  we needed to talk."
      },
      {
        "japanese": "(d).家に帰るまで何とかもつかと思ったが、バスを降りるなり激しい雨が降り出した。",
        "english": "I thought the weather would hold somehow  until I got home, but as soon as I stepped off the bus, it started pouring."
      },
      {
        "japanese": "(e).会議中タバコが吸えなくて禁断症状だった伊藤さんは、部屋を出るなりタバコに火をつけた。",
        "english": "Mr. Ito, who had shown withdrawal symptoms during the meeting  because he was not allowed to smoke, lit a cigarette as soon as he got out of  the room."
      },
      {
        "japanese": "(f).そのニュースが報道されるなり、放送局に問い合わせの電話が殺到した。",
        "english": "Soon after the news was reported, phone queries ﬂooded the  broadcast centre."
      },
      {
        "japanese": "(g).所属レコード会社が宣伝に力を入れたため、そのアルバムは発売されるなりヒットチャート1位になった。",
        "english": "Because the recording company made an effort to promote the  album, it became No. 1 in the hit charts soon after it was released."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vinformal nonpast\n- なり\n- 知らせを聞くなり\n- As soon as someone heard the news",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: や否や】",
    "antonym": "",
    "source": "resources/original/dojg/all/なり.yaml"
  }
}