{
  "grammar_point": "によって・による",
  "rank": 5,
  "bunpro": {
    "grammar_point": "によって・による",
    "jlpt": "N3",
    "meaning": "By means of, According to, Depending on, Because of, Due to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "によって,による, and により are all different versions of the same expression, that can basically be translated as 'according to (A)', or 'depending on (A)'. This uses the same よる as seen in the grammar patternによると. They will be used in the following way:によって- Generally used before a comma (although not always). Acts as the separation point between the (A) and (B) parts of a sentence. Made up of thecase marking particleに, and the う - Verb よる in its て form.による- Generally used at the end of a sentence, to highlight that the previous statement depends on (A).により- Almost always used before a comma. Acts as the separation point between the (A) and (B) parts of a sentence. Made up of thecase marking particleに, and the う - Verb よる in itsconjunctive form.To use any of these constructions, attach them to the end of a noun that you want to express as being the 'dependent' thing.Cautionによるmay also sometimes be followed by a noun. In these cases, it will become a verb modified noun, and highlight that (B) resulted from (A).Fun FactAlthough よる is almost always written in hiragana, there are several different kanji that use this reading. They all share similar meanings. Learn more about this in theによるとgrammar point.",
    "examples": [
      {
        "japanese": "地域によって、ゴミ出しルールが違う。",
        "english": "Depending on the area, the rules for throwing out garbage are different."
      },
      {
        "japanese": "行けるか行けないかは休みが取れるか取れないかによる。",
        "english": "Whether I can go or not depends on if I can take a day off."
      },
      {
        "japanese": "ベンおじさんは強盗により、命を奪われた。",
        "english": "Uncle Ben's life was taken by a robber."
      },
      {
        "japanese": "このミスはヒューマンエラーによるものです。",
        "english": "This mistake is caused by human error."
      },
      {
        "japanese": "この地震による津波の心配はありません。",
        "english": "There is no need to worry about a tsunami brought about from this earthquake."
      },
      {
        "japanese": "アメリカでは州によって法律が違う。",
        "english": "In America, laws differ depending on the state."
      },
      {
        "japanese": "その車の値段によって、決めます。",
        "english": "I will choose depending on the price of that car."
      },
      {
        "japanese": "国によって、いろいろな伝統があります。",
        "english": "There are a variety of traditions depending on the country."
      },
      {
        "japanese": "調査によって新たな事実が明らかになった。",
        "english": "Through research, a new truth was discovered. (by means of)"
      },
      {
        "japanese": "納豆が好きかどうかは人による。",
        "english": "It depends on the person whether they like natto or not."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/によって-による",
    "false_friends": [
      {
        "term": "ために",
        "meaning": "Due to, Because of, As a result of",
        "kind": "synonym"
      },
      {
        "term": "によると・によれば",
        "meaning": "According to",
        "kind": "synonym"
      },
      {
        "term": "次第",
        "meaning": "As soon as",
        "kind": "synonym"
      },
      {
        "term": "〜かは〜によって違う",
        "meaning": "Depends on, Changes depending on, Differ depending on",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-583"
  },
  "dojg": {
    "grammar_point": "によって・より",
    "description": "A particle that indicates means, cause, agent of passive sentence, or dependency on a situation.",
    "meaning": "According to; due to; owing to; because of; depending on; from ~ to; by means of; on the basis of; with; by",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "297",
    "examples": [
      {
        "japanese": "(ksa).漢和辞典によって知らない漢字を調べる。",
        "english": "We  examine unknown kanji with a Chinese character dictionary."
      },
      {
        "japanese": "(ksb).先生によって、勿論、教え方が違います。",
        "english": "Teaching  methods are, of course, different, depending on the teacher."
      },
      {
        "japanese": "(ksc).戦争によって父を亡くした。",
        "english": "We  lost our father, owing to the war."
      },
      {
        "japanese": "(ksd).この研究所は文部省によって設立された。",
        "english": "This  research institute was established by the Ministry of Education."
      },
      {
        "japanese": "(kse).奨学金がもらえるかどうかによって大学入学を決めます。",
        "english": "I  will decide my entrance to college, depending on whether I can get a  scholarship or not."
      },
      {
        "japanese": "(ksf).何を食べるかによって健康状態は変わる。",
        "english": "Our  health condition changes according to what we eat."
      },
      {
        "japanese": "(ksg).我々は本を読むことによって視野を広げることが出来る。",
        "english": "We  can expand our horizons by reading books."
      },
      {
        "japanese": "(a).この頃は宇宙中継によって世界のニュースをテレビで見ることが出来る。",
        "english": "These  days we can watch world news on TV via satellite live broadcasting."
      },
      {
        "japanese": "(b).その老人達はわずかの貯金によって生活している。",
        "english": "The  old people are living on little savings."
      },
      {
        "japanese": "(c).その問題は話し合いによって解決出来るはずだ。",
        "english": "We  should be able to solve that problem by means of negotiation."
      },
      {
        "japanese": "(d).人によって、年のとり方が違う。",
        "english": "Depending  on the person, the aging process differs."
      },
      {
        "japanese": "(e).僕はその日の気分によって、違う音楽を聞きます。",
        "english": "Depending  on the day's mood, I listen to different music."
      },
      {
        "japanese": "(f).定年は会社によって違う。",
        "english": "Retirement  ages vary from company to company."
      },
      {
        "japanese": "(g).その青年は麻薬によって青春時代を失ってしまった。",
        "english": "The  young man lost his adolescence because of drugs."
      },
      {
        "japanese": "(h).彼は難病によって再起不能になった。",
        "english": "He  became unable to come back because of the difficult disease."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun\n- によって\n- 政府によって\n- By the government\n- (ii){V/Adjective い}informal\n- かどうかに{よって/より}\n- {来る/来た}かどうかに{よって/より}\n- Depending on whether someone comes/came or not\n- {面白い/面白かった}かどうかに{よって/より}\n- Depending on whether something is/was interesting or not\n- (iii){Adjective な stem/Noun}\n- {Ø/だった}かどうかに{よって/より}\n- {静か/静かだった}かどうかに{よって/より}\n- Depending on whether something is/was quiet or not\n- (iv)Embedded Wh-Question\n- に{よって/より}\n- 何を食べたかに{よって/より}\n- Depending on what someone ate\n- 誰が来るかに{よって/より}\n- Depending on who comes",
    "part_of_speech": "Compound Particle",
    "related": "【Related Expression: に; で; の為に】",
    "antonym": "",
    "source": "resources/original/dojg/all/によって・より.yaml"
  }
}