{
  "grammar_point": "につき",
  "rank": 6,
  "bunpro": {
    "grammar_point": "につき",
    "jlpt": "N2",
    "meaning": "Due to, On account of, Each or every",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "Although rarely seen in its kanji form,につきis a grammar pattern that comes from a combination of に and the conjunctive form of the う- Verb就く 'to take up (A)', or 'to assume (A)'. This meaning is usually in regard to assuming a new position, such as a new job.However, the particular meaning conveyed here will be closer to 'due to (A), (B)', 'on account of (A), (B)', or 'for each (A), (B)'.につきwill follow nouns directly, before the (B) part of the sentence describes what is happening 'due to' or 'on account of (A)'.This grammar point is quite formal, so it is often seen in formal documents, announcements, and notifications.Regardless of the several common English translations, the base meaning of 'to affix to (A)' is kept in all of the uses ofにつき, as it simply implies that (B) is in answer to, exists in a way that is directly linked to, suitable for, or caused by (A).",
    "examples": [
      {
        "japanese": "閉店につき、特別セール開催中！",
        "english": "Due to our store closing, there is a special sale going on!"
      },
      {
        "japanese": "工事中につき、この先立ち入り禁止。",
        "english": "Due to construction, entry beyond this point is prohibited."
      },
      {
        "japanese": "この商品は大人気のため、一人につき二つまでとさせていただいております。",
        "english": "Since this product is very popular, we are limiting it to two per person."
      },
      {
        "japanese": "開店に就き、事務員を募集する。",
        "english": "On account of opening a new shop, we are hiring clerks."
      },
      {
        "japanese": "暑い気象に就き、ケイティ・シェリーのコンサートがキャンセルされました。ご迷惑をおかけして申し訳ありません。",
        "english": "Due to hot weather, Katy Sherry's concert has been canceled. We are sorry for the inconvenience."
      },
      {
        "japanese": "改築に就き、２ 階のお手洗をご使用ください。ご迷惑をおかけして申し訳ありません。",
        "english": "Due to renovation, please use the restroom on the second floor. We are sorry for the inconvenience."
      },
      {
        "japanese": "明日は祭日に就き、会社は休みです。",
        "english": "On account of tomorrow's festival, the company will be closed."
      },
      {
        "japanese": "工事中に就き、迂回してください。",
        "english": "Due to construction, please take a detour."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/につき",
    "false_friends": [
      {
        "term": "にあたり・にあたって",
        "meaning": "When, When doing something, On the occasion, At the time",
        "kind": "synonym"
      },
      {
        "term": "まい〜のように",
        "meaning": "Almost every ~, Nearly every ~, On a ~ basis",
        "kind": "synonym"
      },
      {
        "term": "ために",
        "meaning": "Due to, Because of, As a result of",
        "kind": "synonym"
      },
      {
        "term": "について",
        "meaning": "Concerning, About, Regarding",
        "kind": "synonym"
      },
      {
        "term": "おかげで",
        "meaning": "Thanks to, Because of",
        "kind": "synonym"
      },
      {
        "term": "ばかりに",
        "meaning": "Simply because, Only because, Just because, Simply on account of",
        "kind": "synonym"
      },
      {
        "term": "せいで",
        "meaning": "Because of, Due to, Blame",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-564"
  },
  "dojg": {
    "grammar_point": "につき",
    "description": "A compound particle which expresses a rate or ratio.",
    "meaning": "A; per; for; on; to",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "283",
    "examples": [
      {
        "japanese": "(ks).この仕事は一時間につき六ドル貰える。",
        "english": "This  job will pay you six dollars an hour. (literally: You can get six dollars an  hour doing this job.)"
      },
      {
        "japanese": "(a).一冊につき百五十円の送料が要ります。",
        "english": "A  hundred and fifty yen is necessary per copy for postage. (literally: Postage of  one hundred and fifty yen is necessary per copy.)"
      },
      {
        "japanese": "(b).五千円につき四十円の手数料をいただきます。",
        "english": "We  place a forty-yen service charge on five thousand yen"
      },
      {
        "japanese": "(c).米一カップにつき、しょう油大さじ二杯の割合にします。",
        "english": "The  ratio should be two tablespoons of soy sauce to a cup of rice."
      },
      {
        "japanese": "(d).切符は一人につき三枚までにして下さい。",
        "english": "Please  limit it to three tickets per person."
      },
      {
        "japanese": "(e).間違い一つにつき一点減点します。",
        "english": "I'll  take one point off for each mistake."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Number+Counter\n- につき\n- 一時間につき\n- Per hour",
    "part_of_speech": "Compound Particle",
    "related": "【Related Expression: あたり】",
    "antonym": "",
    "source": "resources/original/dojg/all/につき.yaml"
  }
}