{
  "grammar_point": "にしたら",
  "rank": 6,
  "bunpro": {
    "grammar_point": "にしたら",
    "jlpt": "N2",
    "meaning": "From the point of view of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When に is combined with the hypothetical forms of する (すれば, or したら), it forms a structure used in Japanese for conveying that the speaker is making an opinion about (A), from its point of view. This is frequently translated as 'from the point of view of (A)', or 'from the standpoint of (A)'. Literally, it means something close to 'if we go off (A)', and just highlights that the speaker is choosing a particular aspect of (A) to discuss as a possibility.In many cases, the (B) part ofにしたらorにすればexpressions will be an opinion about what the speaker expects to be true for (A).にしたらandにすればare structures that will be used after nouns that identify people or organizations, from which the speaker will then make an assumption about them/it.Although almost identical in meaning,にすればwill be the preferred choice in formal sentences.Caution -にしたらandにすればare hypothetical grammar structures that make some sort of assumption about (A), they will not be used in regard to oneself, and one's own opinions. This can be thought of as a function of にする itself, in that you can't 'go off' yourself hypothetically, as you already are yourself, and already know your own thoughts.",
    "examples": [
      {
        "japanese": "お客様にしたら、値段が安い方がいいだろう。",
        "english": "From the point of view of the customer, a lower price is probably better."
      },
      {
        "japanese": "納豆が嫌いな人にしたら、納豆はただ臭いだけに違いない。",
        "english": "From the point of view of a person that does not like natto, natto must just stink (natto is something that stinks and nothing more)."
      },
      {
        "japanese": "子供が何歳になろうとも、親にすればいつまでも子供に見える。",
        "english": "From the parent's point of view, their children look like kids no matter how old they are."
      },
      {
        "japanese": "日本人にすれば普通なことでも、海外の方が見たら驚く事がたくさんあるらしい。",
        "english": "It seems that there are many things that are ordinary from the point of view of Japanese people that are surprising to people from other countries."
      },
      {
        "japanese": "私にしたら、それは高すぎます。",
        "english": "Going off of me, that is too expensive. (Unnatural Japanese)"
      },
      {
        "japanese": "彼にしたら、それは高すぎるそうです。",
        "english": "Going off of him, apparently that is too expensive. (Natural Japanese)"
      },
      {
        "japanese": "妻にしたら、私はもっと家事をしなくてはいけない。",
        "english": "From the perspective of my wife, I have to help more with the house work."
      },
      {
        "japanese": "学生にしたら、テストは簡単ならば、簡単なほどいい。",
        "english": "From the student's point of view, the easier the test is, the better."
      },
      {
        "japanese": "赤ちゃんは可愛いが、親にしたら苦労もあるだろう。",
        "english": "Babies are cute, but from a parent's point of view there are hardships as well."
      },
      {
        "japanese": "通訳にしたら、あの東北訛りはかなり厄介だと思います。",
        "english": "From the point of view of an interpreter, I think that the Tohoku accent is rather troublesome."
      },
      {
        "japanese": "社長にしたら、的確なアドバイスをしてくれる秘書がいると助かる。",
        "english": "From the perspective of the CEO, it is helpful to have a secretary that gives accurate advice."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/にしたら",
    "false_friends": [
      {
        "term": "から見ると",
        "meaning": "From the point of view of, By the look of",
        "kind": "synonym"
      },
      {
        "term": "からして",
        "meaning": "Even..., Judging from, Based on",
        "kind": "synonym"
      },
      {
        "term": "に取って",
        "meaning": "To, For, Concerning",
        "kind": "synonym"
      },
      {
        "term": "からすると・からすれば",
        "meaning": "Judging from, Considering",
        "kind": "synonym"
      },
      {
        "term": "点",
        "meaning": "Aspect, Respect, Point, Way, In terms of, In that, From the point of view",
        "kind": "synonym"
      },
      {
        "term": "という点から考えると",
        "meaning": "From the standpoint of, From the perspective of, From the viewpoint of, Think in terms of, Viewed from the angle of",
        "kind": "synonym"
      },
      {
        "term": "から言うと",
        "meaning": "Speaking in terms of, From the point of view of",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-551"
  }
}