{
  "grammar_point": "によると・によれば",
  "rank": 7,
  "bunpro": {
    "grammar_point": "によると・によれば",
    "jlpt": "N3",
    "meaning": "According to",
    "meaning_warning": "Remember that ことによると is a set expression meaning \"perhaps\"!",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "によると, a combination of thecase marking particleに, the う - Verb よる, and theconjunction particleと, is a phrase that is used to express that something is 'according to (A)', or 'going off (A)'. In these cases, (A) is considered to be the source of some form of information which will be conveyed in the (B) part of the sentence.This expression will be used after nouns, or with verbs that have been paired with ところ (to indicate the 'place' where the information came from).In newspapers and in articles, the more formalによりますとvariant can also regularly be seen.However, this structure is not limited to using と, and the same meaning can be conveyed with withによれば. This is just よる in its conjunctive form that pairs with theconjunction particleば.CautionAlthoughによるとand によれば are largely interchangeable,によるとwill convey a higher level of 'certainty', or 'reliability' in regard to the source of information. Due to this,によるとis more likely to be used when referring to legitimate sources (police, news, etc).Fun Factよる is almost always written in hiragana alone. However, there are several different kanji that can be used to represent this verb. Each of these kanji have slightly different nuances, but they generally all represent the same 'base' meaning. This meaning is that '(B)'s foundation is (A)'. The most common kanji used for よる are as follows:依る - (B) depends on (A)拠る - (B) extends from (A)因る - (B) results from (A)由る - (B) is due to (A)",
    "examples": [
      {
        "japanese": "今朝の天気予報によると、今夜から雪が降るらしいですよ。",
        "english": "According to the forecast, it is apparently going to start snowing from tonight."
      },
      {
        "japanese": "先生に聞いたところによると、来週からオンライン授業になるらしいよ。",
        "english": "Going off of what I heard from the teacher, we are going to be taking online classes from next week."
      },
      {
        "japanese": "愛知県警によりますと、犯人は40代の男性だと言う事です。",
        "english": "According to the Aichi Prefectural Police, the criminal is a 40 year old male."
      },
      {
        "japanese": "今朝のニュースによれば、来月末から海外旅行が出来るようになる。",
        "english": "According to this morning's news, we are going to be able to travel abroad starting from the end of next month."
      },
      {
        "japanese": "私が聞くところによると、部長が転職するそうだ。",
        "english": "Going off of what I heard, the manager is going to be switching jobs."
      },
      {
        "japanese": "警視庁によると、イマダ容疑者は寝ている母親を包丁で刺していたという事です。",
        "english": "According to the Tokyo Metropolitan Police department, Imada, the suspect, stabbed his mother who was sleeping, with a knife."
      },
      {
        "japanese": "天気予報によると、明日は晴れです。",
        "english": "According to the weather forecast, tomorrow will be sunny."
      },
      {
        "japanese": "警察によると、犯人が逃げたそうです。",
        "english": "According to the police, the criminal escaped."
      },
      {
        "japanese": "私の母によると、毎日野菜を食べる必要があるらしいです。",
        "english": "According to my mother, it is necessary to eat vegetables every day."
      },
      {
        "japanese": "先輩の話によると、あの会社はブラック企業らしい。",
        "english": "According to what my senior said, that company is one of those 'black companies'."
      },
      {
        "japanese": "目撃者によれば、犯人は20代男性だ。",
        "english": "According to the witness, the criminal is a man in his 20s."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/によると-によれば",
    "false_friends": [
      {
        "term": "にしたがって",
        "meaning": "As, Following, As then, According to, In accordance with",
        "kind": "synonym"
      },
      {
        "term": "によって・による",
        "meaning": "By means of, According to, Depending on, Because of, Due to",
        "kind": "synonym"
      },
      {
        "term": "をもとに",
        "meaning": "Based on, From, According to",
        "kind": "synonym"
      },
      {
        "term": "にもとづいて",
        "meaning": "Based on, In accordance with",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-584"
  },
  "dojg": {
    "grammar_point": "によると",
    "description": "A compound particle that is used to identify the source of information provided in the sentence.",
    "meaning": "According to; based on",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "459",
    "examples": [
      {
        "japanese": "(ksa).その温泉は旅行雑誌によると神経痛にいいそうだ。",
        "english": "One of the travel magazines said that hot springs are good for  arthritis."
      },
      {
        "japanese": "(ksb).日本の法律によるとおおむね12歳未満の者は逮捕の対象にならない。",
        "english": "According to Japanese law, generally, youths under 12 are not  subject to arrest."
      },
      {
        "japanese": "(ksc).聞いたところによると来年は授業料が上がるらしい。",
        "english": "Based on what I heard, (it appears that) tuition will go up  next year."
      },
      {
        "japanese": "(a).新聞の世論調査によると、内閣支持率は22%にまで急落したそうだ。",
        "english": "According to a newspaper poll, the approval rating for the  Cabinet dropped sharply to 22 percent."
      },
      {
        "japanese": "(b).友達に聞いたところによると、フィンランドのメーデーは学生も集まって春を祝う祭りの日だそうだ。",
        "english": "According to my friend, May Day in Finland is a day when  everyone, including students, joins in a festival to celebrate spring."
      },
      {
        "japanese": "(c).H博士によると、犬は人間が歩く際に発する弱い電磁波を感じ取っている可能性があるという。",
        "english": "According to Dr. H, dogs may be able to feel the faint  electromagnetic waves that people generate when they walk."
      },
      {
        "japanese": "(d).政府筋によると、政府はバイオテロリズムへの対策を研究する審議会を設置する予定であるという。",
        "english": "According to government sources, the government plans to  establish a panel that will study measures to cope with bioterrorism."
      },
      {
        "japanese": "(e).法律によると、介護保険は適切な医療および福祉サービスが受けられるようにすることを目的としています。",
        "english": "According to the law, the purpose of insurance for care of the  elderly is to make appropriate medical and welfare services accessible."
      },
      {
        "japanese": "(f).辞書によると、「さびしい」には「寂しい」と「淋しい」の二つの漢字が使われている。",
        "english": "According to the dictionary, two characters are used for sabishii, \"寂\", \"淋\"."
      },
      {
        "japanese": "(g).調査によると、高齢者に対する暴力と虐待の加害者は、家族、友人あるいは知人であることが最も多い。",
        "english": "According to the survey, those who inﬂict violence and abuse  upon the elderly are most often the victim's family, friends or acquaintances."
      },
      {
        "japanese": "(h).懲戒処分基準によると、教職員が酒酔い運転で死亡・重傷事故を起こした場合は免職になる。",
        "english": "According to the standards for disciplinary action, if a  faculty or staff member driving under the inﬂuence (of alcohol) causes an  accident resulting in serious injury or death, he or she will be dismissed."
      },
      {
        "japanese": "(i).韓国人の友人によると、中国では韓国語学習者が増えているらしい。",
        "english": "According to my Korean friend, the number of the learners of  Korean is increasing."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Noun\n- によると\n- {新聞/法律 /規則/辞書}によると\n- According to the newspaper/law/rule/dictionary",
    "part_of_speech": "Compound Particle",
    "related": "【Related Expression: によれば】",
    "antonym": "",
    "source": "resources/original/dojg/all/によると.yaml"
  }
}