{
  "grammar_point": "にあって",
  "rank": 8,
  "bunpro": {
    "grammar_point": "にあって",
    "jlpt": "N1",
    "meaning": "At, In the (place or situation), Under ~ conditions or circumstances, During, Suited to",
    "meaning_warning": "Don't confuse this with the て-form of 遭う (to meet; to have an accident) which is often used with words like 事故 (事故にあって)",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "にあってis a fairly formal grammar construction used in Japanese in the same way as its component parts. The particle に indicates a location, while あって is the て-form of the う-Verb ある 'to be'. As such,にあってcan be and is often translated simply as 'in the situation of (A)', or 'under the conditions of (A)'.にあってwill be used after a noun marking the condition, before the second clause will then go on to explain something remarkable or noteworthy about that situation or circumstance.Occasionally,にあってwill be followed by も. This slightly alters the meaning and indicates that despite being in the noteworthy situation of (A), (B) is not being affected in the way that one would expect.CautionBe careful not to getにあってmixed up with theにあってused in sentences like事故にあって 'to meet with an accident'. This あって is a conjugation of遭う, 'to meet or happen upon (often something negative)', while the あって is this grammar point is simply the て-form of ある.",
    "examples": [
      {
        "japanese": "彼女は校長先生という立場にあって、いつも生徒たちのために一生懸命働いている。",
        "english": "In the position of a principal, she is always working hard for the students."
      },
      {
        "japanese": "インフルエンザが流行っているという状況にあって、外にいる人はみんなマスクをしている。",
        "english": "In a situation where the flu is spreading, everyone outside is wearing masks."
      },
      {
        "japanese": "緊急事態宣言にあって、県を跨ぐ移動が制限された。",
        "english": "Under the state of emergency, movements across prefectures were restricted."
      },
      {
        "japanese": "緊急時にあっても、常に冷静を保つようにしてください。",
        "english": "Even under emergencies, please stay calm at all times."
      },
      {
        "japanese": "こんな厳しい状況にあっても、諦めずに営業を続けていたから彼は儲けることができた。",
        "english": "Even under difficult circumstances like this, they were able to make a profit because they kept running their business without giving up."
      },
      {
        "japanese": "危険な非常時にあっては、安全確保が第一だ。",
        "english": "Under emergency conditions, ensuring safety is the most important."
      },
      {
        "japanese": "このような状況下にあって、医療機関へのアクセスは限定されているかもしれない。",
        "english": "Under conditions like this, access to the medical institutions might be limited."
      },
      {
        "japanese": "好況にあっても破産を申請している企業がある。",
        "english": "Even during a boom, there are companies applying for bankruptcy."
      },
      {
        "japanese": "CEOのスピーチ：「混乱期にあっても心配せずに将来を見据えます。」",
        "english": "CEO's speech: 'Even in this chaotic time, without fear, we look into the future.' (under...circumstances)"
      },
      {
        "japanese": "歴史の教科書：「総理大臣という立場にあって、言論の自由のみならず動物の権利も提唱した。」",
        "english": "History textbook: 'In the position of Prime Minister, she advocated not only for the freedom of speech but also for animal rights.'(under...circumstances)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/にあって",
    "false_friends": [
      {
        "term": "ために",
        "meaning": "Due to, Because of, As a result of",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-539"
  }
}