{
  "grammar_point": "に当たる",
  "rank": 4,
  "bunpro": {
    "grammar_point": "に当たる",
    "jlpt": "N3",
    "meaning": "Correspond to, Amounts to, Equals to, Is appropriate",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "As mentioned in our当たりlesson,当たる often has a meaning that is similar to に対して 'to be in regard to'. Due to this, when combined with thecase marking particleに,に当たるwill be translated as 'to correspond to', 'to amount to', 'to be appropriate for', or 'to be in regard to'. These may seem quite different, but we will examine the similarities shortly.To useに当たる, attach it to the end of an (A) noun that you would like to mark as being the 'point of reference'. (B) may come directly afterに当たる, or earlier in the sentence, so long as it is clearly separated from (A).As for the link between に対して andに当たる, it is as follows. In に対して, (A) and (B) exist simultaneously, but (B) opposes something about (A).に当たる, (A) and (B) exist simultaneously, but (B) matches something about (A). Due to this, unless the speaker is specifically trying to highlight something that is 'opposing', or 'matching', the base meaning of '(A) and (B) existing simultaneously' may be the standard translation.",
    "examples": [
      {
        "japanese": "英語の「what's up」は日本語の「元気」に当たる表現だ。",
        "english": "'What's up' in English corresponds to the expression 'genki' in Japanese."
      },
      {
        "japanese": "その人は私の親戚に当たる人です。",
        "english": "That person is my relative."
      },
      {
        "japanese": "先生はタナカ君のいとこに当たる。",
        "english": "The teacher is Tanaka-kun's cousin."
      },
      {
        "japanese": "今年は仕事を始めてから5年目に当たる。",
        "english": "This year amounts to the 5th year since I've started working. (It's been 5 years since I've started this job)"
      },
      {
        "japanese": "ハクは納豆を食べるのが好きなのに対して、チヒロは納豆があまり好きじゃない。",
        "english": "As opposed to Haku who likes eating natto, Chihiro does not like eating it as much."
      },
      {
        "japanese": "「Hello」は日本で「こんにちは」に当たる言葉です。",
        "english": "'Hello' corresponds to the Japanese word 'konnichiwa'."
      },
      {
        "japanese": "とある漫画家によるとポーランド語の「 ザクシャ・イン・ラブ 」はおおよそ日本の「愛を永遠に」に当たるらしい。",
        "english": "According to a certain manga artist, the Polish 'Zawsze in love' is roughly equivalent to 'forever in love'."
      },
      {
        "japanese": "英語には仕事を終えて帰る時に言う「お疲れ様でした。」に当たる表現はない。",
        "english": "In English, there is no expression corresponding to 'otsukaresamadeshita,' which is said when leaving to go home after finishing work."
      },
      {
        "japanese": "日本語能力試験中には「四つの言葉の選択肢のうち、★の位置に当たるものはどれですか」のような問題もある。",
        "english": "There are also questions on the JLPT like 'Among these four (word) choices, which one corresponds to the field with the ★?'."
      },
      {
        "japanese": "彼女の長男のリンゴパンはパムの父に当たる。",
        "english": "Her eldest son, Ringopan, also corresponds to the father of Pamu."
      },
      {
        "japanese": "江戸という都市は現在の東京に当たる。",
        "english": "The city called 'Edo' corresponds to present-day Tokyo."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に当たる",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-599"
  }
}