{
  "grammar_point": "に先駆けて",
  "rank": 8,
  "bunpro": {
    "grammar_point": "に先駆けて",
    "jlpt": "N1",
    "meaning": "First, Prior to, Pioneer, Ahead of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "に先駆け, is an expression used after nouns which indicates that something is being done ‘ahead of (A)’, or in a way that ‘paves the way for (A)’. It is a combination of thecase-marking particleに, and theconjunctive formof the る-verb先駆ける, meaning ‘to lead the attack’, or ‘to pioneer’. In most cases,先駆け will imply that one person or organization did something first, which then led to everyone else within the same category taking the same course of action.Common translations include ‘prior to (A), (B)’, or ‘ahead of (A), (B)’. Occasionally, theconjunction particleて may be used after the base先駆け form.As this grammar structure often indicates whole bodies that took a similar action after (B),に先駆けwill usually be seen after words like世界‘the world’,全国‘the whole country’,全市‘the whole city’ or ‘every city’,業界‘the industry’,他社‘other companies’, or他◯ ‘or anything’.",
    "examples": [
      {
        "japanese": "世界に先駆け、あの国は死刑を廃止した。",
        "english": "Pioneering for other countries, that country was the first to abolish the death penalty."
      },
      {
        "japanese": "三重県は全国に先駆け、梅雨入りをした。",
        "english": "Ahead of the rest of the nation, the rainy season kicked off in Mie prefecture."
      },
      {
        "japanese": "A社は他社に先駆けて、自動運転が可能な車を開発した。",
        "english": "Paving the way for other companies, Company A developed a self-driving automobile."
      },
      {
        "japanese": "１７６３年に、プロイセンは他国に先駆けて近代的な義務教育を導入した。",
        "english": "In 1763, paving the way for other countries, Prussia introduced the modern compulsory education."
      },
      {
        "japanese": "コンサートのサイト：「ファンクラブでは、一般発売に先駆けて、チケットの販売を行います。」",
        "english": "Concert website: 'The selling of tickets via the fan club will take place prior to offering them to the general public.'"
      },
      {
        "japanese": "広告：「世界の人々に先駆けて、楽しみながら学ぶ体験型博物館を訪れてみてはいかがでしょう。」",
        "english": "Advertisement: 'How about paving the way for the people of the world and visiting an interactive museum, where you can learn and have fun at the same time.'"
      },
      {
        "japanese": "我が社は他社に先駆けて世界初となる海流発電の実証実験を成功させた。",
        "english": "Pioneering for other companies, our company was the first in the world to succeed in demonstrating ocean current power generation."
      },
      {
        "japanese": "スプートニク１号は世界に先駆けて打ち上げられた人工衛星です。",
        "english": "Pioneering for the rest of the world, Sputnik was the first artificial satellite to be launched."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に先駆けて",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-589"
  }
}