{
  "grammar_point": "に応じて",
  "rank": 8,
  "bunpro": {
    "grammar_point": "に応じて",
    "jlpt": "N2",
    "meaning": "Depending or based on, According to, In response to, Suitable for or to,",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "に応じてis a combination of に, and the て-form of the る-Verb応じる 'to apply to'. This grammar structure is often translated as 'depending on (A), (B)', or 'in response to (A), (B)'. However; in almost all cases, it is just indicating that (B) is something that is done in a way that is 'applicable' to what is necessary of (A).に応じてwill appear after nouns, or asに応じたwhen directly modifying a second noun.Fun-fact -応じる usually indicates the way something 'responds to' or 'answers' an issue on a case-by-case basis. Due to this, what happens in (B) will frequently indicate something that changes depending on the intensity or severity of (A).",
    "examples": [
      {
        "japanese": "日本語を教える際には、生徒達のレベルに応じてクラスを分ける必要があります。",
        "english": "When teaching Japanese, it is necessary to divide classes according to the level of the students."
      },
      {
        "japanese": "この地域の土地は、面積に応じて値段が高くなります。",
        "english": "Land in this area is priced according to its surface area."
      },
      {
        "japanese": "私たちはクライアントの要望に応じたデザインを提供しています。",
        "english": "We provide designs that meet our clients' requests."
      },
      {
        "japanese": "ジムでは実力に応じて、練習を選べるべきだ。",
        "english": "At the gym, you should choose exercises suitable to your ability. (in response to)"
      },
      {
        "japanese": "住民からの依頼に応じて小学校の周辺での車の通行禁止が決定された。",
        "english": "In response to a request from the residents, a ban on passing through the area around the elementary school in vehicles has been decided."
      },
      {
        "japanese": "赤ん坊のために年齢に応じたダイエットが必要です。",
        "english": "For a toddler, it is necessary to have a diet that is suitable for their age."
      },
      {
        "japanese": "このフードプロセッサーは条件や目的に応じてペースト状にしたり細かくチョッピングしたりするなどのさまざまな機能が取り替えできる。",
        "english": "This food processor can swap between various functions like creating a paste, fine chopping, and others, depending on the requirements or purpose. (In response to)"
      },
      {
        "japanese": "日本人は相手への尊敬度に応じて、お辞儀の角度を変える。",
        "english": "The Japanese change the angle of their bow, depending on the degree of respect for the other party. (in response to)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に応じて",
    "false_friends": [
      {
        "term": "に応えて",
        "meaning": "In response to, Meet",
        "kind": "synonym"
      },
      {
        "term": "に合わせて・に合った",
        "meaning": "In accordance with, Matching, Fitting, Suitable for, Adjust or tune to",
        "kind": "synonym"
      },
      {
        "term": "次第だ・次第で",
        "meaning": "Depending on, So",
        "kind": "synonym"
      },
      {
        "term": "からして",
        "meaning": "Even..., Judging from, Based on",
        "kind": "synonym"
      },
      {
        "term": "をもとに",
        "meaning": "Based on, From, According to",
        "kind": "synonym"
      },
      {
        "term": "にしたがって",
        "meaning": "As, Following, As then, According to, In accordance with",
        "kind": "synonym"
      },
      {
        "term": "に沿って",
        "meaning": "Along, In accordance with, In line with",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-601"
  },
  "dojg": {
    "grammar_point": "に応じて・応じた",
    "description": "A compound particle that means “in response to”.",
    "meaning": "In response to; according to; depending on; appropriate for; suitable for; suited to; meet",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "412",
    "examples": [
      {
        "japanese": "(ksa).組合の要求に応じて標準就業時間が短縮されることになった。",
        "english": "In response to union demands, the standard work day (literally:  standard work hours) will be shortened."
      },
      {
        "japanese": "(ksb).業績に応じて従業員全員にボーナスが支給された。",
        "english": "Bonuses were distributed to all employees according to their  performance (literally: achievements)."
      },
      {
        "japanese": "(ksc).天候や道路状況に応じた適切な運転を心がけましょう。",
        "english": "Please make sure your driving is appropriate for the weather  and road conditions."
      },
      {
        "japanese": "(a).当社では要請に応じて講師を学校に派遣することもできます。",
        "english": "We can also dispatch a lecturer to the school in response to  their request."
      },
      {
        "japanese": "(b).病院でもらう薬は、医師が患者の体質や症状に応じて処方します。",
        "english": "The drugs a patient receives at the hospital are prescribed by  the doctor according to the patient's physical condition and symptoms."
      },
      {
        "japanese": "(c).湯沸かし器の設定温度は、目的に応じてその都度調節するのが賢い使い方だ。",
        "english": "A wise way of using a water heater is to adjust the (pre-set)  temperature each time, according to the purpose."
      },
      {
        "japanese": "(d).今年行われた「今後の大学教育のあり方に関する世論調査」によると、外国語教育の効果的だと思われる授業のあり方に関して、33.7％が「学生個人の能力に応じてクラスを分けて授業を行う」と答えた。",
        "english": "According to the \"Survey of How Future Higher Education Should  Be,\" which was conducted this year, 33.7 percent (of respondents) agreed that  for effective foreign language education, \"classes should be taught by dividing  students according to their ability\"."
      },
      {
        "japanese": "(e).髪のケアには欠かせないシャンプーには症状に応じて様々なタイプがある。",
        "english": "Shampoo, which is indispensable for hair care, comes in various  types, depending on the condition of your hair."
      },
      {
        "japanese": "(f).一般に供給は需要に応じて変動する。しかし、場合によって需要が供給に応じて変動するのも事実である。",
        "english": "Generally, supply changes according to the demand. However, it  is also true that in some cases demand changes according to the supply."
      },
      {
        "japanese": "(g).家を購入する場合には収入に応じた物件を選ぶべきです。",
        "english": "When buying a house, you should choose one that is within your  means (literally: suitable for your income)."
      },
      {
        "japanese": "(h).我が社はお客さまのご予算に応じた費用対効果の高いホームページ制作を支援します。",
        "english": "We support the production of highly cost-effective Web pages  geared to the customer's budget (literally: suitable for the customer's  budget)."
      },
      {
        "japanese": "(i).平成15年に公布された「個人情報の保護に関する法律」は、個人情報取扱事業者に対し、本人の求めに応じて保有個人データの開示や訂正を行うこと、また本人の求めに応じてその利用を停止することなだを義務づけている。",
        "english": "The Law Regarding the Protection of Personal Information, which  was promulgated in the ﬁfteenth year of Heisei (2003), requires businesses that  handle personal information to disclose or correct an individual's personal  data in their possession in response to the individual's demand, or to stop  using the data in response to his/her demand."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun\n- に応じて\n- 求めに応じて\n- In response to someone’s request\n- 能力に応じて\n- According to someone’s ability\n- (ii)Noun1\n- に応じたNoun2\n- 目的に応じた教え方\n- A teaching method suitable for the purpose",
    "part_of_speech": "Compound Particle",
    "related": "【Related Expression: によって; 次第で; いかんで】",
    "antonym": "",
    "source": "resources/original/dojg/all/に応じて・応じた.yaml"
  }
}