{
  "grammar_point": "に向かって・に向けて",
  "rank": 8,
  "bunpro": {
    "grammar_point": "に向かって・に向けて",
    "jlpt": "N2",
    "meaning": "Towards, To face, To head to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Coming from a link between に and the う-Verb向かう 'to face', or 'to go towards' in its て-form,に向かってindicates that some specific action is being done 'towards (A)' or 'facing (A)'. (A) usually marks a stationary object or destination in the form of a noun. However, it can also mark less obvious destinations, such as the future '未来'.Additionally, when向ける (the transitive form of the verb) is used, it will imply that the speaker is intentionally 'aiming' or 'facing' something towards (A). This is especially true when the objective of the speaker is to make something 'suitable' for (A).",
    "examples": [
      {
        "japanese": "マイクに向かって何か一言お願いします。",
        "english": "Please face the mic and say something."
      },
      {
        "japanese": "空に向かって大声を出した。",
        "english": "I shouted loudly towards the sky."
      },
      {
        "japanese": "明るい未来に向かって一緒に人生を歩もうじゃ無いか！",
        "english": "Why don't we walk toward a bright future together!"
      },
      {
        "japanese": "新入社員に向けて何かアドバイスを一言お願いします。",
        "english": "Please share a few words of advice suitable for the new employees."
      },
      {
        "japanese": "彼らは全国大会に向けて毎日朝から夜までトレーニングをしている。",
        "english": "They are training towards the national championship from morning to night everyday."
      },
      {
        "japanese": "カメラに向かって、笑顔をお願いします。",
        "english": "Please face the camera and smile."
      },
      {
        "japanese": "将来に向かって、治療の発展は進む一方だ。",
        "english": "Heading toward the future, medical development is continuously progressing."
      },
      {
        "japanese": "日本をはじめ、外国に向けてブランドを広げたい。",
        "english": "Starting with Japan, I want to expand my brand towards foreign countries."
      },
      {
        "japanese": "受験生に向けてアドバイスをお願いします。",
        "english": "Please give some advice aimed at a student preparing for exams."
      },
      {
        "japanese": "小学生に向かってなんでそんなに難しい言い方をするのだろう...",
        "english": "I wonder why he uses such a difficult way of speaking toward elementary school students."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に向かって-に向けて",
    "false_friends": [
      {
        "term": "へ",
        "meaning": "To, Toward",
        "kind": "synonym"
      },
      {
        "term": "向け",
        "meaning": "Intended for, Aimed at",
        "kind": "synonym"
      },
      {
        "term": "向き",
        "meaning": "Suitable for, Facing",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-596"
  },
  "dojg": {
    "grammar_point": "に向けて・に向けた",
    "description": "A compound particle that indicates the destination/direction of movement, the target/direction of an action, or the goal/purpose of an action.",
    "meaning": "Toward; to; at; aiming at; targeting; for; for the purpose of; in order to",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "404",
    "examples": [
      {
        "japanese": "(ksa).報道班は次の目的地に向けて出発した。",
        "english": "The team of reporters left for the next destination."
      },
      {
        "japanese": "(ksb).このテレビコマーシャルは20、30代の独身女性に向けて発信されている。",
        "english": "This TV commercial is being marketed to single women in their  twenties and thirties."
      },
      {
        "japanese": "(ksc).今、来年の入学試験に向けて頑張っています。",
        "english": "I'm studying hard now for the next year's entrance exam."
      },
      {
        "japanese": "(ksd).新しいエネルギーの開発に向けて研究が進んでいる。",
        "english": "Research is progressing toward (the goal of) developing new  energy."
      },
      {
        "japanese": "(kse).地球温暖化防止に｛向けての/向けた｝動きが活発化している。",
        "english": "Efforts to prevent (literally: Movement for the purpose of preventing) global  warming are gaining vigour."
      },
      {
        "japanese": "(a).救援物資を積んだヘリコプターが被災地に向けて飛び立った。",
        "english": "A helicopter loaded with relief supplies left for (literally:  took off toward) the site of the damage."
      },
      {
        "japanese": "(b).機動隊はデモ隊に向けて催涙弾を発射した。",
        "english": "The riot police shot tear gas bombs at the ranks of  demonstrators."
      },
      {
        "japanese": "(c).K社は1月から九州で生産した高級車を中国に向けて輸出する。",
        "english": "Starting in January, K Company is going to  export luxury cars to China which were manufactured in Kyushu."
      },
      {
        "japanese": "(d).このプロジェクトでは、世界各国のアニメーターが世界中の子供たちに向けて作品を作り、それをそれぞれの国の言葉に翻訳します。",
        "english": "In this project, animators from around the globe create works  for the world's children, and then the works are translated into various  countries' languages."
      },
      {
        "japanese": "(e).バレーボール協会は次のオリンピックに向けて選手の強化を急いでいる。",
        "english": "The volleyball association is hurrying to  strengthen its players for the next Olympic Games."
      },
      {
        "japanese": "(f).異なる特許制度の世界的統一に向けて交渉が開始された。",
        "english": "Negotiations toward the global integration of incompatible (literally:  different) patent systems began."
      },
      {
        "japanese": "(g).H社は新しく開発された電池の事業化に向けて新会社を設立した。",
        "english": "H Company has established a new company for the  commercialization of their newly-developed battery."
      },
      {
        "japanese": "(h).我が社は効率的な社内コミュニケーションに向けての新しいコミュニケーションシステムの導入を進めている。",
        "english": "Our company is implementing a new communication system for more  efﬁcient internal communication."
      },
      {
        "japanese": "(i).M氏の提言は、新たな世紀に向けた日本外交の指針を考えていくにあたり、非常に示唆に富むものであった。",
        "english": "Mr. M's proposal was full of suggestions when we began  considering the guiding principles of Japan's diplomacy for the new century."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun\n- に向けて\n- ロンドンに向けて\n- Toward/to/for London\n- (ii)VN\n- に向けて\n- 体制の改革に向けて\n- For the purpose of reforming the system\n- (iii)Noun1\n- に{向けての/向けた}Noun2\n- ２１世紀に{向けての/向けた}社会保障\n- Social security for the 21st century",
    "part_of_speech": "Compound Particle",
    "related": "【Related Expression: に向かって; をめざして; を目標; の為に】",
    "antonym": "",
    "source": "resources/original/dojg/all/に向けて・に向けた.yaml"
  }
}