{
  "grammar_point": "に言わせれば・に言わせると・に言わせたら",
  "rank": 8,
  "bunpro": {
    "grammar_point": "に言わせれば・に言わせると・に言わせたら",
    "jlpt": "N1",
    "meaning": "If you ask, In … opinion, According to",
    "meaning_warning": "に言わせたら is less common than に言わせれば and に言わせると.から is sometimes used instead of に (から言わせれば).",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "に言わせればis a structure that will be attached to nouns, in order to indicate a person or group that is giving a strong opinion. It is usually translated as 'if you ask (A), (B)', or 'according to (A), (B)'. The literal meaning is 'if (A) is allowed to speak, (B)', as this pattern is just a combination of the case-marking particle に, the う-Verb言う 'to say' followed by thehypothetical formof theauxiliary verbせる, せれ 'to allow to do', and theconjunction particleば.To use this structure, simply attach it to the end of a noun marking the person or group whose opinion is being given.Other hypothetical structures such as と and たら may also be used, but ば is the most common. Additionally, this pattern may sound self-important, so is best used sparingly, especially when giving your own opinions.Occasionally, から will be used instead of に.CautionWith theauxiliary verbsせる and させる, it will be important to remember that に tends to be mark the doer when they are being allowed to do something, as in this case, while を will be used more frequently when the doer is being made to do something.",
    "examples": [
      {
        "japanese": "私に言わせれば５キロを25分で走るのは簡単だ。",
        "english": "If you ask me, running 5km in 25 minutes is easy."
      },
      {
        "japanese": "私はあのパーソナルトレーナーは厳しすぎると思ったが、彼に言わせれば優しすぎるらしい。",
        "english": "I thought that that personal trainer was too strict, but according to him, he is apparently too nice."
      },
      {
        "japanese": "専門家に言わせれば、もっと早い対応をするべきだったそうです。",
        "english": "According to a specialist, we should have dealt with it earlier."
      },
      {
        "japanese": "私から言わせれば、なんでそんなことして許されると思ったのかがわからない。",
        "english": "In my opinion, I don't know why they thought they would be forgiven after doing such a thing."
      },
      {
        "japanese": "私に言わせればあなたが買ったスマホは不良品だよ。もう３回も壊れたんだから！",
        "english": "If you ask me, the smartphone you bought is a defective product. It has fallen apart 3 times already!"
      },
      {
        "japanese": "ドイツ側に言わせればオーストラリア企業は初めは経済協力に反対していたという。",
        "english": "According to the German side, the Australian companies were opposed to cooperation from the beginning."
      },
      {
        "japanese": "会社の観点からすれば、結果は失敗とみなされるかもしれないが、少なくとも私に言わせれば、完全な失敗というわけではない。",
        "english": "From the company's point of view, the results might be considered a failure, but it does not mean it was a complete failure, at least if you ask me."
      },
      {
        "japanese": "君にとっては面白いのだろうが、私に言わせれば、ただの無礼にしかすぎない。",
        "english": "For you it might be funny, but if you ask me, it is just rude."
      },
      {
        "japanese": "武田さんに言わせれば、最近の若者はまったくお年寄りを敬わないとのこと。",
        "english": "According to Mr. Takeda, youth these days do not respect their elders at all."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に言わせれば",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-613"
  }
}