{
  "grammar_point": "に至るまで",
  "rank": 7,
  "bunpro": {
    "grammar_point": "に至るまで",
    "jlpt": "N1",
    "meaning": "(Everything) from...to..., From…up until..., Starting with...ending with...",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "至 る is an う-Verb which can be roughly translated as 'to attain (A)', or 'to reach the climax of (A)'. This verb is seen in several different grammar structures that all basically highlight that some extreme or unexpected extent is being reached. When paired with に and まで, に至るまで is often interpreted as 'everything from (A) to (B)'.Comparative statements such as から or より frequently come directly after (A), while に至るまで will come directly after (B). This marks (B) as the 'extreme' extent. Both (A) and (B) will either be nouns or noun phrases.The 'to reach a climax' meaning of 至 る itself can be used as an indicator that grammar points that use this verb all indicate some kind of exceptionally wide range between (A) and (B). Due to this, 至 るまで can be thought of as simply a strong emphasis of まで by itself, which also marks an extent.",
    "examples": [
      {
        "japanese": "石川県にある「法師」旅館は718年から今に至るまで1300年以上商いし続けている。",
        "english": "The Japanese-style inn called 'Houshi' that is located in Ishikawa prefecture has been operating continuously for over 1300 years from 718 right up until now."
      },
      {
        "japanese": "にしまさんはバーテンダーから大企業の社長に至るまでいろいろな仕事を歴任した。",
        "english": "Nishima-san held various positions, from a bartender to a president of a large company."
      },
      {
        "japanese": "今日では、CPUはパソコンから歯ブラシに至るまで、さまざまな装置に見られる。",
        "english": "Nowadays, CPUs can be found in various kinds of devices, from computers to toothbrushes, etc."
      },
      {
        "japanese": "アジアでは、箸は昔より現在に至るまで長きに渡って、食べるために使われている。",
        "english": "In Asia, Chopsticks have been used to eat for a long time, from long ago to the present."
      },
      {
        "japanese": "国税庁に調べられるとき、銀行口座のお金の額から１０年前の金曜の朝にお弁当にいくらで買ったかに至るまで何でもチェックされる。",
        "english": "When you are investigated by a national tax agency everything is checked, from money in your bank account to how much you spent on a bentou, Friday morning 10 years ago."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に至るまで",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-612"
  },
  "dojg": {
    "grammar_point": "から~に至るまで",
    "description": "A structure that expresses a wide range of things.",
    "meaning": "Starting with ~ ending with ~; from ~ to ~",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "99",
    "examples": [
      {
        "japanese": "(ks).スミスさんは週刊誌から学術書に至るまで、幅広い日本語が読める。",
        "english": "Mr. Smith can read Japanese widely, ranging  from weekly magazines to scholastic books."
      },
      {
        "japanese": "(a).その新聞記者は首相の公の生活から私生活に至るまで、何でも知っている。",
        "english": "That newspaper reporter knows everything  about the premier, ranging from his public life to his private life."
      },
      {
        "japanese": "(b).私が日本へ行った時、友人の山田さんは空港への出迎えからホテルの予約に至るまで、実に親切にしてくれた。",
        "english": "When I went to Japan, my friend Mr. Yamada  was very kind to me. He did everything from picking me up at the airport to  making the hotel reservation for me."
      },
      {
        "japanese": "(c).その女の人は私に家族のことから自分の悩みに至るまで、細かに話した。",
        "english": "That lady told me everything in detail,  starting with her family and ending with the worries of her life."
      },
      {
        "japanese": "(d).社長が現れた時には、守衛から副社長に至るまで、門の前で待っていた。",
        "english": "When the president of the company arrived,  everyone from the guards to the vice-president was waiting in front of the  gate."
      },
      {
        "japanese": "(e).ルーシーは靴から帽子に至るまで、緑の装束だった。",
        "english": "Lucy was dressed in green, from her shoes to  her hat."
      }
    ],
    "writeup": "##",
    "formation": "##",
    "part_of_speech": "Structure(used in writing and formal speech only)",
    "related": "【Related Expression: から~まで】",
    "antonym": "",
    "source": "resources/original/dojg/all/から~に至るまで.yaml"
  }
}