{
  "grammar_point": "に限らず",
  "rank": 6,
  "bunpro": {
    "grammar_point": "に限らず",
    "jlpt": "N2",
    "meaning": "Not just, Not only… but also",
    "meaning_warning": "More formal than だけでなく",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "に限らずis a sentence pattern in Japanese used that highlights when something is 'not just (A), but (B) too', or 'not only (A), but also (B)'. It is a combination of に, the う-Verb限る 'to limit', and theliterary auxiliary verbず, which connects with verbs in the same way, and carries the same meaning as ない.This structure will appear after nouns, before the (B) part of the sentence will go on to explain things that can be included in the same scope or category as (A).Occasionally, も may be added for extra emphasis in the (B) part ofに限らずsentences. This is especially true when several extra things are being indicated, not just (B). For example, '(B) も (C) も'.",
    "examples": [
      {
        "japanese": "USJは週末に限らず、平日でも多くの人で賑わっています。",
        "english": "USJ is crowded not only on weekends, but also on weekdays."
      },
      {
        "japanese": "この遊園地は子供に限らず、大人でも楽しめます。",
        "english": "This amusement park is enjoyable not only for children, but also for adults."
      },
      {
        "japanese": "このカフェは女性に限らず、男性の方にも人気があります。",
        "english": "This café is popular not only with women, but also with men."
      },
      {
        "japanese": "このブランドは日本だけに限らず、韓国でも中国でも愛されています。",
        "english": "This brand is loved not only in Japan, but also in Korea and China."
      },
      {
        "japanese": "新しい言語を習う場合、文法に限らず、その国の文化もニュアンスも同じぐらい勉強したほうがいい。",
        "english": "When learning a new language, you should study not only the grammar, but also the culture and nuances of the country, if possible."
      },
      {
        "japanese": "均整で良い姿になるために、夏に限らず、年中運動すべきです。",
        "english": "In order to have a well-balanced appearance, we should exercise not only in summer, but throughout the year."
      },
      {
        "japanese": "イエローストーン火山の爆発の可能性は、アメリカに限らず世界レベルの問題だ。",
        "english": "The possibility of the Yellowstone super volcano erupting is not only a problem in the U.S., but also on an international level."
      },
      {
        "japanese": "ペラペラになるためには勉強に限らず練習を積むことが大切だ。",
        "english": "In order to become fluent, it is important to not only study, but also to practice."
      },
      {
        "japanese": "マンションに限らず、綺麗な部屋なら住んでみたい。",
        "english": "Not just apartments, but if there are beautiful rooms I want to try living there."
      },
      {
        "japanese": "酔っ払いに限らず、お酒を飲んでいる人と話すのが苦手です。",
        "english": "Not only drunks, but I dislike talking to people who are drinking alcohol."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に限らず",
    "false_friends": [
      {
        "term": "のみならず",
        "meaning": "Not only...but, Not just...but, What is more",
        "kind": "synonym"
      },
      {
        "term": "だけでなく",
        "meaning": "Not only… but also",
        "kind": "synonym"
      },
      {
        "term": "はもちろん",
        "meaning": "Not only but also, Let alone, Not to mention, Of course",
        "kind": "synonym"
      },
      {
        "term": "ばかりでなく",
        "meaning": "Not only…but also, As well as",
        "kind": "synonym"
      },
      {
        "term": "をはじめ",
        "meaning": "Not only...but also..., Starting with",
        "kind": "synonym"
      },
      {
        "term": "はもとより",
        "meaning": "Not only... but also, Let alone, Of course,",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-621"
  },
  "dojg": {
    "grammar_point": "に限らず",
    "description": "Not limiting something to ~.",
    "meaning": "Not limited to ~ (but also); not only ~ (but also)",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "249",
    "examples": [
      {
        "japanese": "(ks).見合い結婚は日本に限らずほかの国でも行われている。",
        "english": "Arranged  marriage is not limited to Japan; it is practiced in other countries, too."
      },
      {
        "japanese": "(a).音楽はクラシックに限らず何でも聞きます。",
        "english": "Talking  about music, I listen to any music, not just classical music."
      },
      {
        "japanese": "(b).このバーは男性だけに限らず女性の間にも人気がある。",
        "english": "This  bar is popular not only among men but also among women."
      },
      {
        "japanese": "(c).果物は何に限らず好きです。",
        "english": "My  preference for fruit is unlimited (literally: not limited to something); I like  any kind."
      },
      {
        "japanese": "(d).何事に限らず仕事は誠意をもって行うことが大切だ。",
        "english": "Whatever  you do (literally: Not limited to anything), it is important to do it with  sincerity."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Noun\n- に限らず\n- 日本語に限らず\n- Not limited to Japanese",
    "part_of_speech": "Compound Particle",
    "related": "【Related Expression: だけで(は)なく~も】",
    "antonym": "",
    "source": "resources/original/dojg/all/に限らず.yaml"
  }
}