{
  "grammar_point": "に限る",
  "rank": 4,
  "bunpro": {
    "grammar_point": "に限る",
    "jlpt": "N3",
    "meaning": "Nothing better than, There's nothing like, Limited to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "に限る is a combination of thecase marking particleに(marking a location), and the う - Verb限る 'to limit'. This expression can be translated as 'there's nothing better than (A)', or 'there's nothing like (A)'.に限る may be paired with verbs in their base form, or with nouns.に限る may also appear with verbs that have been negated with theauxiliary verbない. Care will need to be taken with translating these sentences, as they will express that 'there is nothing better than -not- doing (A)'.Fun FactThe literal meaning of限る is境を付ける 'to set a boundary'. This means thatにmarks the location (or situation), within which the speaker then states as being 'the boundary'. Because of this, 'to be bound to', or 'to be limited to', are also possible translations of に限る.",
    "examples": [
      {
        "japanese": "暑い日は冷たいシャワーを浴びるに限る。",
        "english": "There is nothing better than taking a cold shower on a hot day."
      },
      {
        "japanese": "回転寿司はくら寿司に限る。",
        "english": "There is nothing better than Kurazushi when it comes to kaiten-sushi."
      },
      {
        "japanese": "寒い日には温かい部屋を出ないに限る。",
        "english": "There is nothing better to do than not leaving your warm room on a cold day."
      },
      {
        "japanese": "休みの日には仕事をしないに限る。",
        "english": "There is nothing better than doing no work on a day off."
      },
      {
        "japanese": "暑い日にはアイスクリームを食べるに限る。",
        "english": "I am bound to eat ice cream on a hot day."
      },
      {
        "japanese": "この施設を利用できるのはこのアパートの住民に限る。",
        "english": "Using this facility is limited to those who live in this apartment complex."
      },
      {
        "japanese": "ダイエットをしたいなら、運動をするに限る。",
        "english": "There is nothing better than exercise when it comes to losing weight."
      },
      {
        "japanese": "アルバイト募集中。ただし、英語ができる人に限る。",
        "english": "They are hiring. However, the position is only limited to people who can speak English."
      },
      {
        "japanese": "家具を買うなら、このお店に限る。",
        "english": "If you are going to buy furniture, there is nowhere better than this place."
      },
      {
        "japanese": "やっぱり秋刀魚は目黒に限る。",
        "english": "There is nothing like Samma (fish) from Meguro."
      },
      {
        "japanese": "仕事の後はジュースに限る。",
        "english": "There is nothing better than a juice after work."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に限る",
    "false_friends": [
      {
        "term": "限り",
        "meaning": "As long as, While… is the case, Limited to",
        "kind": "synonym"
      },
      {
        "term": "に越したことはない",
        "meaning": "There is nothing better than, It is the best, Would be the best",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-622"
  }
}