{
  "grammar_point": "に限って",
  "rank": 6,
  "bunpro": {
    "grammar_point": "に限って",
    "jlpt": "N2",
    "meaning": "Particularly when, Those who, Only when",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "The expressionに限ってin Japanese is a phrase that has three primary uses, the first is to show that (B) is an unbelievable thing about (A), the second is to express that something is limited to (A), and the third highlights that in most cases for (A), (B). Depending on the particular nuance that is being used, common translations include 'particularly when (A), (B)', 'those who (A), (B)', and 'only when (A), (B)'.This structure is comprised of に, and the て-form of the う-Verb限る 'to limit'. Let's look at a few examples of each potential meaning.First, when something about (A) is unbelievable due to what is either expected or previously known.Second, when something is limited to (A).Third, when (B) is true in most cases concerning (A).While each of these uses can roughly be translated as 'only when', it will be important to keep all three meanings in mind when interpreting sentences that useに限って.",
    "examples": [
      {
        "japanese": "うちの子に限って、他の子に手を出すなんて考えられない。",
        "english": "I can't imagine that my child, in particular, would hit another kid."
      },
      {
        "japanese": "彼に限って、こんな簡単なことでミスをする訳が無い。",
        "english": "There is no way that he, in particular, would make a mistake on something this simple."
      },
      {
        "japanese": "武くんと釣りに行く日に限って、いつも雨が降るんだよな。",
        "english": "Only on days when I go fishing with Takeshi-kun does it always rain."
      },
      {
        "japanese": "先輩は忙しい日に限って、飲みに誘ってくる。",
        "english": "My senpai invites me to go drinking with him only on days that I am busy."
      },
      {
        "japanese": "「クレームを入れるぞ」って言う人に限ってクレームを入れないからあまり気にしていない。",
        "english": "I'm not too worried because particularly those who say, 'I'm going to file a claim', never do (file a claim)."
      },
      {
        "japanese": "「絶対後でやる」って言う人に限って、いつまでもやらない人が多い。",
        "english": "Many of those who say, 'I'll definitely do it later', never do."
      },
      {
        "japanese": "よく節約を口にしている人に限って、給料を受け取っては、後で身につけもしない服など無駄遣いしがちだ。",
        "english": "Those who often speak about 'economizing' tend to waste their money on things like clothes they don't even wear whenever they receive salary."
      },
      {
        "japanese": "外に調査へ出かける時に限って、雨が降る。",
        "english": "It is only when I go out to investigate that it rains"
      },
      {
        "japanese": "飛行機に乗る時に限って、天候が悪かったりする。",
        "english": "The weather becomes bad and such particularly when I board an airplane."
      },
      {
        "japanese": "定休日ではないのに、僕があの店に行く日に限って臨時休業している。",
        "english": "Despite it not being a set holiday, only on days when I go to that store is it temporarily closed."
      },
      {
        "japanese": "僕がカメラを忘れた日に限って虹が出る。",
        "english": "Only on days when I forget my camera, do rainbows appear."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/に限って",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-620"
  },
  "dojg": {
    "grammar_point": "に限って",
    "description": "A compound particle to show that only X is different from others.",
    "meaning": "(X) of all (X's); only",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "250",
    "examples": [
      {
        "japanese": "(ks).うちの子供に限ってそんなひどいことはしませんよ。",
        "english": "Our  child, of all children, would not do such a terrible thing."
      },
      {
        "japanese": "(a).中野先生はたいてい研究室にいらっしゃるのに、今日に限っていらっしゃらなかった。",
        "english": "Professor  Nakano is usually in his office, but today, of all days, he wasn't there."
      },
      {
        "japanese": "(b).傘を持って来ない日に限って雨が降るんですよ。",
        "english": "Only  on the day when I don't bring my umbrella, it rains, you know."
      },
      {
        "japanese": "(c).急ぐ時に限って、バスがなかなか来ない。",
        "english": "Of  all times, when I am in a hurry, the bus doesn't come for ages."
      },
      {
        "japanese": "(d).嫌なことがある時に限って、嫌なことが重なる。",
        "english": "Only  when something unpleasant happens, do other unpleasant things occur."
      },
      {
        "japanese": "(e).この小説家の書いたものに限って、つまらないものはない。",
        "english": "Only  works written by this novelist are never boring."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Noun\n- に限って\n- あの日に限って\n- Only on that day\n- あの人に限って\n- Only that person",
    "part_of_speech": "Compound Particle",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/に限って.yaml"
  }
}