{
  "grammar_point": "のに (in order to)",
  "rank": 2,
  "bunpro": {
    "grammar_point": "のに (in order to)",
    "jlpt": "N3",
    "meaning": "In order to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Regarded as aconjunction particleby itself,のにis simply a fusion of thecase marking particlesの and に.のにhas two primary functions in Japanese. It can be used to show that something is the opposite of what is expected for (A) (translated as 'despite'), or it can be used to show that something is required for (A) to be realized (translated as 'in order to'). We will focus on the 'in order to' meaning in this lesson.To useのに, simply attach it to the base (non-past) form of a verb that you would like to express as being the 'goal', before following it with the conditions required to meet that goal.Fun FactAlthoughのにcan be translated as 'despite', or 'in order to', it actually has the same meaning in each of these situations. の nominalizes what comes before it (turning it into a noun-phrase), while に converts that new noun-phrase into a 'location', or 'goal'. In this way,のにalways means 'to that which is (A), (B)'.",
    "examples": [
      {
        "japanese": "トラックは車と違って、ブレーキをかけてから止まるのに時間がかかる。",
        "english": "Unlike cars, trucks take longer to stop after stepping on the brakes."
      },
      {
        "japanese": "風が強すぎて、ピクニックシートを広げるのに苦労した。",
        "english": "The wind was so strong that I struggled to spread out the picnic blanket."
      },
      {
        "japanese": "さっき食べたばかりなのに、またお腹が空いた。",
        "english": "I just ate earlier, but I am hungry again."
      },
      {
        "japanese": "食べるのに時間をかけすぎて寝る時間が遅くなった。",
        "english": "I took so long to eat, so I slept at a later time."
      },
      {
        "japanese": "宿題をするのに、3時間かかる。",
        "english": "It takes 3 hours in order to do homework."
      },
      {
        "japanese": "食べるのに時間がかかりすぎて、昼休みが終わってしまった。",
        "english": "It took too long in order for me to eat lunch, so my lunch break unfortunately came to an end."
      },
      {
        "japanese": "お茶を飲むのに必要なコップがありません。",
        "english": "I do not have the necessary cup in order to drink tea."
      },
      {
        "japanese": "本を読むのに眼鏡を買った。",
        "english": "I bought glasses in order to read books."
      },
      {
        "japanese": "電車で音楽を聴くのにイヤフォンを忘れてしまいました。",
        "english": "I forgot to bring the earphones I use in order to listen to music on the train."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/のに",
    "false_friends": [
      {
        "term": "ため(に)",
        "meaning": "For, For the sake of, In order to",
        "kind": "synonym"
      },
      {
        "term": "には",
        "meaning": "In order to, In regard to, For",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-639"
  },
  "dojg": {
    "grammar_point": "のに②",
    "description": "In the process or for the purpose of doing something expressed in the の nominalised clause.",
    "meaning": "In the process of doing ~; (in order) to do ~; for the purpose of ~",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "335",
    "examples": [
      {
        "japanese": "(ks).私は日本語の新聞を読むのに辞書を使う・使います。",
        "english": "I used a dictionary to read Japanese newspapers."
      },
      {
        "japanese": "(a).すき焼きを作るのには何が要りますか。",
        "english": "What do you need to make sukiyaki?"
      },
      {
        "japanese": "(b).このレポートを書くのに一ヶ月かかりました。",
        "english": "It took me a month to write this paper."
      },
      {
        "japanese": "(c).会社に行くのにバスと電車を使っている。",
        "english": "I am using the bus and the train to get to my company."
      }
    ],
    "writeup": "## 1. In the のに2 construction, only informal, nonpast, volitional verbs can precede のに.",
    "formation": "## \n\n- Vinformal nonpast\n- のに\n- 話すのに\n- In order to talk\n- 食べるのに\n- In order to eat",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: に5; 為(に)】",
    "antonym": "",
    "source": "resources/original/dojg/all/のに②.yaml"
  }
}