{
  "grammar_point": "のがじょうず",
  "rank": 0,
  "bunpro": {
    "grammar_point": "のがじょうず",
    "jlpt": "N5",
    "meaning": "To be good at, Proficient",
    "meaning_warning": null,
    "details": {
      "Part of Speech": "Adjectival Noun",
      "Register": "Standard",
      "品詞": "表現",
      "単語の種類": "形容動詞",
      "使用域": "一般"
    },
    "writeup": "〜のが上手 is a phrase that behaves in almost exactly the same way as 〜のが好き , but rather than meaning 'to like' something, it means 'to be good at' something. This particular expression is used with the plain (dictionary) form of verbs only.In these examples, we can see that there is no difference between Ichidan verbs and Godan   verbs. Both will appear in their plain form. In this expression, のが is performing the same function as in the regular のは・のが construction. This function is nominalization (turning a phrase into a noun). However, のは cannot be used with this phrase, as が is always required with adjectives.CautionIf you want to express that you were good at something (in the past), the verb will still remain in the plain form, but 上手 will change to the past tense.CautionThis grammar point can sound a little bit arrogant if you are referring to your own skills, so the word 得意 may also be used if you want to sound a bit more humble.",
    "examples": [
      {
        "japanese": "お母さんは若い頃、踊るのが上手だった。",
        "english": "When my mother was young, she was good at dancing."
      },
      {
        "japanese": "歌うのが上手です。",
        "english": "I am good at singing. (Like, how am I not famous)"
      },
      {
        "japanese": "歌うのが得意です。",
        "english": "I am good at singing. (I have confidence in my singing)"
      },
      {
        "japanese": "トムはサッカーをするのがじょうずです。",
        "english": "Tom is good at playing soccer."
      },
      {
        "japanese": "漢字を覚えるのがじょうず。",
        "english": "(He) is good at remembering Kanji."
      },
      {
        "japanese": "田中さんは文法を勉強するのがじょうずです。",
        "english": "Tanaka-san is good at studying grammar."
      },
      {
        "japanese": "彼は日本に行ってから、日本語を話すのがじょうずになりました。",
        "english": "After going to Japan, he became good at speaking Japanese."
      },
      {
        "japanese": "彼は漢字を書くのがじょうずでしょう。",
        "english": "He is good at writing kanji, isn't he?"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/のがじょうず",
    "false_friends": [
      {
        "term": "のがすき",
        "meaning": "Like doing, Love doing",
        "kind": "synonym"
      },
      {
        "term": "のがへた",
        "meaning": "To be bad at, Poor at, Unskillful",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-630"
  }
}