{
  "grammar_point": "のに (despite)",
  "rank": 1,
  "bunpro": {
    "grammar_point": "のに (despite)",
    "jlpt": "N4",
    "meaning": "Despite, Although, Even though",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Althoughのにis often thought of as a simple combination of the particlesのandに, it is actually its own particle, with the meaning of 'despite', or 'in order to'. In this lesson, we will focus primarily on the 'despite' nuance.Due toのにbeing aconjunction particle, it can be linked to almost any word type, to show that 'despite (A), (B)'. As with many conjunction particles, な will be required after a noun/な-Adjective, but beforeのに.It is also possible to seeだのに, instead ofなのに, but this is something that is only seen in certain dialects, and would be considered incorrect by the vast majority of native speakers.Fun FactRegardless of having two quite different translations ('despite', and 'in order to'),のにalways functions in the same way.In the situation of '(A)のに, (B)', (B) is/will be the result.The only difference between how the nuance will be read, is whether the (B) statement is a logical conclusion, or an illogical one. When logical, the meaning is usually 'in order to', when 'illogical', the meaning is usually 'despite'.",
    "examples": [
      {
        "japanese": "明日テストがあるのに彼は勉強をしないでゲームをしている。",
        "english": "Despite having a test tomorrow, he is playing games without studying."
      },
      {
        "japanese": "何で納豆は臭いのに美味しいの?",
        "english": "Why does natto taste good, despite smelling bad?"
      },
      {
        "japanese": "彼はイケメンなのにいつも汗臭い。",
        "english": "Even though he is a good looking guy, he always smells like sweat."
      },
      {
        "japanese": "この車はスポーツカーなのに遅い。",
        "english": "Despite being a sports car, this car is slow."
      },
      {
        "japanese": "虫歯だのに、チョコレートを食べたから歯が痛い。",
        "english": "My tooth hurts because I ate chocolate, despite having a cavity."
      },
      {
        "japanese": "彼は忙しいのに、ゲームをしている。",
        "english": "Despite being busy, he is playing video games. (even though)"
      },
      {
        "japanese": "天気予報は悪かったのに、晴れた。",
        "english": "Despite the weather forecast being bad, it was sunny. (even though)"
      },
      {
        "japanese": "あの女の人はきれいなのに、彼氏がいない。",
        "english": "Despite being pretty, that woman doesn't have a boyfriend. (even though)"
      },
      {
        "japanese": "無理って言ったのにまだやるの?",
        "english": "Even though I said it was impossible, you're still going to do it? (despite)"
      },
      {
        "japanese": "あまり牛乳がないのにスーパーに行った時買わなかったの?",
        "english": "Even though we are running low on milk, you didn't buy any when you went to the store? (despite)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/のに-despite",
    "false_friends": [
      {
        "term": "ものの",
        "meaning": "Although, But, Even Though",
        "kind": "synonym"
      },
      {
        "term": "にしても",
        "meaning": "Even though, Even if, Even when, Also",
        "kind": "synonym"
      },
      {
        "term": "くせに",
        "meaning": "Even though, And yet, Despite",
        "kind": "synonym"
      },
      {
        "term": "ながらも",
        "meaning": "But, Even while, Even though, Despite, Although",
        "kind": "synonym"
      },
      {
        "term": "それなのに",
        "meaning": "And yet, Despite this",
        "kind": "synonym"
      },
      {
        "term": "それでも",
        "meaning": "But still, And yet, Even so, Nevertheless",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-640"
  },
  "dojg": {
    "grammar_point": "のに①",
    "description": "Contrary to everybody’s expectation based on the sentence preceding [x], the proposition in the sentence following [x] is the case.",
    "meaning": "Even though; despite the fact that ~; although; but; in spite of the fact that ~",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "331",
    "examples": [
      {
        "japanese": "(ksa).毎日漢字を勉強しているのによく覚えられない・覚えられません。",
        "english": "Although I'm studying kanji every day, I cannot memorize them well."
      },
      {
        "japanese": "(ksb).このステーキは高いのに美味しくない・美味しくありません。",
        "english": "In spite of the fact that this steak is expensive, it isn't delicious."
      },
      {
        "japanese": "(ksc).清水さんはゴルフが下手なのに大好きだ・大好きです。",
        "english": "Although Mr. Shimizu is not good at golf, he loves it."
      },
      {
        "japanese": "(ksd).ホールさんはアメリカ人なのに肉が嫌いだ・嫌いです。",
        "english": "In spite of the fact that Mr. Hall is an American, he doesn't like meat."
      },
      {
        "japanese": "(a).中学と高校で六年間も英語を勉強したのにまだ英語が話せません。",
        "english": "I studied English for as many as six years at junior high and senior high, but I still cannot speak it."
      },
      {
        "japanese": "(b).寒いのにオーバーを着ないで出かけた。",
        "english": "Although it was cold, he went out without wearing an overcoat."
      },
      {
        "japanese": "(c).あの人はピアノが上手なのにめったに弾きません。",
        "english": "He is good at piano, but seldom plays."
      },
      {
        "japanese": "(d).父は九十歳なのにまだ働いています。",
        "english": "My father is still working in spite of the fact that he is ninety years old."
      }
    ],
    "writeup": "## 1. のに is the nominalizer の plus the particle に 'to', meaning 'in contrast to the fact that ~'. The のに clause expresses a highly presupposed, speaker-oriented action or state. (⇨ の3) In other words, the speaker of SentenceのにSentence2 is personally involved with the proposition of Sentence1. This personal involvement tends to create some emotive overtone.\n\n- Sentence informalがSentence informal/formal\n- vs\n- Sentence informalのにSentence informal/formal\n- Sentence formalがSentence formal",
    "formation": "## \n\n- (i){V/Adjective い} informal\n- のに\n- {話す /話した}のに\n- Although someone talks/talked\n- {高い /高かった}のに\n- Although something is/was expensive\n- (ii){Adjective な stem/ N}\n- {な/だった}のに\n- {静かな/静かだった}のに\n- Although something is/was quiet\n- {先生な/先生だった}のに\n- Although something is/was a teacher",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: が; けれど(も)】",
    "antonym": "",
    "source": "resources/original/dojg/all/のに①.yaml"
  }
}