{
  "grammar_point": "の極み",
  "rank": 8,
  "bunpro": {
    "grammar_point": "の極み",
    "jlpt": "N1",
    "meaning": "Ultimate, Extreme, Utter, Epitome, Peak",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "When paired with a noun followed by the case-marking particle の,極み 'extremity' will indicate something that is 'the ultimate (A)', 'the extreme (A)', or 'the epitome of (A)'. This may be used in either positive or negative sentences.As極み itself is a noun, it will often be followed by theauxiliary verbだ, or theconjunctive formで when going on to describe something that is as a result of (A).Cautionの極みis a structure that is paired with nouns, while極まる and極まりない are grammar patterns that will be paired with adjectives, despite the meanings being quite similar.",
    "examples": [
      {
        "japanese": "あと5分待って居れば私が大好きなアイドルに会えていたとは...痛恨の極みだ。",
        "english": "If only I had waited five more minutes, I would have met my favorite idol... It's the peak of despair."
      },
      {
        "japanese": "今までこんなに良くしてくれて、感激の極みです。",
        "english": "I am beyond thrilled that you have been so good to me so far."
      },
      {
        "japanese": "有給は取るなとか鬼畜の極みだ。",
        "english": "Telling us to not take paid time off? That's the epitome of being evil."
      },
      {
        "japanese": "こんな景色がいいところで、こんな美味しい料理を食べられるなんて、なんて贅沢の極みだ。",
        "english": "It's the ultimate luxury to be able to eat such delicious food in such a scenic place."
      },
      {
        "japanese": "この曲の歌詞は感動の極みで、聞くたびに涙が溢れ出てくる。",
        "english": "The lyrics of this song are the peak of emotion and bring tears to my eyes every time I listen to it."
      },
      {
        "japanese": "小説：「ダイモス王はこの報道を聞いて、驚きの極みに達しました。」",
        "english": "Novel: 'Hearing the news, the King Daimos reached the very peak of surprise.'"
      },
      {
        "japanese": "目上の人にはじめて出会う時：「お目に掛かることができ、光栄の極みです。」",
        "english": "When meeting a superior for the first time: 'It is an extreme honor to be able to meet you.'"
      },
      {
        "japanese": "レストランサイト：「寿司 - 日本の極み、主に米飯に魚介類など組み合わせた和食です。」",
        "english": "Restaurant website: 'Sushi - the epitome of Japan. This Japanese-style meal is made by combining fish and shellfish with cooked rice.'"
      },
      {
        "japanese": "地震によってビルに閉じ込められた人々は混乱の極みにあった。",
        "english": "The people trapped in the building due to the earthquake were in extreme (utter) turmoil."
      },
      {
        "japanese": "釈迦様は当初贅沢の極みを尽くした生活をしていた。",
        "english": "At first, Buddha lived an utterly luxurious life."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/の極み",
    "false_friends": [
      {
        "term": "極まりない・極まる",
        "meaning": "Extreme, Extremely",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-649"
  }
}