{
  "grammar_point": "はおろか",
  "rank": 9,
  "bunpro": {
    "grammar_point": "はおろか",
    "jlpt": "N1",
    "meaning": "Let alone, Much less, Needless to say, Not to mention, Not only but also",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "は疎かis an expression that works similarly to はもちろん 'of course (A), but (B)' in Japanese.疎か itself is a な-Adjective that means 'negligent', or 'alienation'. However, this use of疎か is not seen much in modern Japanese, and the word will mainly be used in set expressions where it doesn't behave exactly as a な-Adjective usually would. Despite this, the meaning of 'alienation', or 'completely removed from' is kept inはおろか, as it simply means 'completely putting aside (A), (B)'.Common translations include 'let alone (A), (B)', and 'it's needless to say that (A), when (B)'. (B) and (A) will usually be things that fall into the same category, where (B) is considered the far more obvious of the two. Due to this obviousness, (B) will often be immediately followed by theadverbial particleさえ. This shows that (B) is the noteworthy minimum extent.Alternatively, さえ may be exchanged with otheradverbial particlesthat fill a similar purpose such a も, すら, or まで. In most cases,は疎かsentences tend to have a fairly negative nuance.",
    "examples": [
      {
        "japanese": "彼は掃除はおろか、料理さえできない。",
        "english": "He can't even cook, let alone clean."
      },
      {
        "japanese": "私はスーパーはおろか、コンビニさえもないど田舎に住んでいる。",
        "english": "I live in a very rural area where there isn't a convenience store, let alone a supermarket."
      },
      {
        "japanese": "父はパソコンはおろか、スマホさえも使うことができない。",
        "english": "My father can't use a smartphone, let alone a computer."
      },
      {
        "japanese": "「ルームメイトはオムライスは疎か、おにぎりさえ作れない。」",
        "english": "'My roommate cannot even make onigiri, let alone omurice.'"
      },
      {
        "japanese": "「最近、痔が痛み出したなぁ。座ってるのは疎か、歩くのも痛いぞ。」",
        "english": "'Recently my hemorrhoids have been so painful. It even hurts to walk, much less sit.'"
      },
      {
        "japanese": "小説：敵は疎か味方からも恐れられ、「バーサーカー」と言われるようになった。",
        "english": "Novel: Feared by friends, much less enemies, she has come to be called 'berserker'."
      },
      {
        "japanese": "彼はアクションアドベンチャーの有名な本をシリーズで執筆したが、実は祖国は疎か、故郷すら出たことがないという。",
        "english": "It is said that although he wrote a famous action-adventure series, he has never left his hometown, let alone motherland."
      },
      {
        "japanese": "日本語の文字と中国語の文字の区別は疎か、ロシア語の文字との区別さえつかない人も少なくない。",
        "english": "There are quite a few people who cannot tell the difference between Japanese characters and Russian characters, let alone Japanese Characters and Chinese characters."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/はおろか",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-657"
  },
  "dojg": {
    "grammar_point": "はおろか",
    "description": "A phrase that is used when something is not only true with one thing or person, but also with another thing or person that is less expected or understandable.",
    "meaning": "Let alone; not only ~ (but also ~); not to mention; to say nothing of; never mind; much less",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "694",
    "examples": [
      {
        "japanese": "(ks).インターネットはおろか、パソコンも触ってことがないのだが、講習会についていけるだろうか。",
        "english": "Never having touched a computer, let alone used the Internet, I wonder if I will be able to keep up in the workshop."
      },
      {
        "japanese": "(a).最近は大学生はおろか、中学生でもかなりの者が海外旅行を経験している。",
        "english": "Never mind college students, these days even junior and senior high school students often have experienced traveling abroad."
      },
      {
        "japanese": "(b).アメリカでは、隣町まで１００マイル、途中ガソリンスタンドはおろか、民家さえないという場所がたくさんある。",
        "english": "In America there are many places where the next town is 100 miles away and there are no houses, let alone a gas station, in between."
      },
      {
        "japanese": "(c).ハリス氏は日本の現代文学はおろか、古典にまで通じている。",
        "english": "Mr. Harris is quite familiar with classics of Japanese literature, to say nothing of (his knowledge of) modern Japanese literature."
      },
      {
        "japanese": "(d).「近くて遠い」。この表現は日本との国交がない北朝鮮はおろか、韓国との関係を指すのにもよく使われてきた。",
        "english": "Near yet far. This phrase has often been used to describe Japan's relationship not only with North Korea, with which it has no diplomatic relations, but with South Korea as well."
      },
      {
        "japanese": "(e).英語を話すのが好きなだけで、英米の文学はおろか日本の文学もろくに読んでいない学生が英米学専攻に入ってくると悲惨だ。",
        "english": "It'll be a tragedy if a student who has barely even read any  Japanese literature, much less British or American literature, signs up to  major in English literature just because he or she likes to speak English."
      },
      {
        "japanese": "(f).企業は今、セキュリティのための支出を増やさなければ、セキュリティの強化はおろか、維持さえも難しくなっているという。",
        "english": "It is said that it has become more difﬁcult for businesses to  maintain security, let alone enhance it, without increasing their security  expenses."
      },
      {
        "japanese": "(g).このサイトは検索はおろか、本の内容紹介までしてくれるので非常に便利だ。",
        "english": "Not only does this website let you search (for books), it also  gives a summary of the (searched) books' contents, so it's very convenient."
      },
      {
        "japanese": "(h).戦争はおろか食糧難すら経験したことがない者が、口先だけて戦争を議論しているのは笑止だ。",
        "english": "It is laughable that those people who have  never even experienced a food shortage, much less a  war, make glib arguments about war."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Noun1\n- はおろかNoun2{も/でも/さえ/すら/まで}\n- ひらがなはおろか漢字{も/でも/さえ/すら/まで}\n- Even (in) kanji, let along (in) hiragana",
    "part_of_speech": "Phrase (usually used in formal writing and formal speech)",
    "related": "【Related Expression: は言うまでもなく; は言うに及ばず; はもちろん; だけでなく; のみならず】",
    "antonym": "",
    "source": "resources/original/dojg/all/はおろか.yaml"
  }
}