{
  "grammar_point": "はずだ",
  "rank": 1,
  "bunpro": {
    "grammar_point": "はずだ",
    "jlpt": "N4",
    "meaning": "Bound to (be), Expected to (be), Should be (able)",
    "meaning_warning": "There is also another, even less used kanji for はず：弭。",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "はず, coming from the kanji筈, is a word in Japanese that is very similar to 'bound' in English. This means that it expresses something that the speaker is 'quite sure is true', but cannot confirm. The most common translations ofはずare 'bound to be (A)', and 'should be (A)'.Asはずis a noun, it may be used in any place that a noun would usually be used. It will often be followed byだ, orです.CautionDespiteはずsometimes being translated as 'should', this is only when you think that something 'should be true', and cannot be used when making suggestions/giving advice. Due to this, 'bound' is the more accurate translation of筈, in almost all situations.Fun FactTheだ(orです) inはずだmay be omitted. This usually makesはずsound a little less certain, like 'bound to be (A)... probably'. In the same way, speakers may sometimes addはずto the end of their sentences in a similar way to多分, in order to show that they are not 100% certain about whether what they just said is accurate or not.",
    "examples": [
      {
        "japanese": "今日は雨が降るはずだ。",
        "english": "It is supposed to rain today. (But I am not 100% sure if it will)"
      },
      {
        "japanese": "新幹線で行った方が速いはずだ。",
        "english": "It is bound to be faster if we go by shinkansen. (But I am not 100% sure if it will)"
      },
      {
        "japanese": "彼は魚が嫌いだから寿司は嫌いなはずだ。",
        "english": "He does not like fish, so he is sure to dislike sushi. (But I am not 100% sure if he will)"
      },
      {
        "japanese": "頼んだのはコーヒーのはずだったけどお茶が来た。",
        "english": "I was sure that I ordered coffee, but tea came. (But I am not 100% sure if I did)"
      },
      {
        "japanese": "ハリーも今日のパーティーに行く…はず。",
        "english": "Harry will go to the party today… Probably."
      },
      {
        "japanese": "出かける前に家の中の電気は全部消した… はず。",
        "english": "I turned off all the lights in my house before I left… I'm pretty sure."
      },
      {
        "japanese": "彼は借りたペンを返す筈だ。",
        "english": "He is bound to return the pen he borrowed. (expected to)"
      },
      {
        "japanese": "妻は夜七時までに、帰ってくる筈だ。",
        "english": "My wife is expected to return home by seven o'clock. (bound to)"
      },
      {
        "japanese": "夏だから、暑い筈だ。",
        "english": "Because it is summer, it is expected to be hot. (bound to be)"
      },
      {
        "japanese": "ここから富士山が見える筈だ。",
        "english": "One should be able to see Mt. Fuji from here. (bound to)"
      },
      {
        "japanese": "この港には船がある筈だ。",
        "english": "There are bound to be boats in this harbor. (expected to be)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/はずだ",
    "false_friends": [
      {
        "term": "はずがない",
        "meaning": "Hardly possible, Cannot be, Highly unlikely, Improbable",
        "kind": "antonym"
      },
      {
        "term": "べきではない",
        "meaning": "Should not, Must not , Ought not to",
        "kind": "antonym"
      },
      {
        "term": "わけだ",
        "meaning": "For that reason, No wonder, As you'd expect, Naturally, Thus, This is why",
        "kind": "synonym"
      },
      {
        "term": "つもりだ",
        "meaning": "To plan to, To intend to",
        "kind": "synonym"
      },
      {
        "term": "ことになっている",
        "meaning": "To be expected to, To be scheduled to",
        "kind": "synonym"
      },
      {
        "term": "ばいい",
        "meaning": "Can, Should, It'd be good if",
        "kind": "synonym"
      },
      {
        "term": "べき",
        "meaning": "Must, Should , Ought to",
        "kind": "synonym"
      },
      {
        "term": "たらいい・といい",
        "meaning": "It would be nice if, It would be good if, Should, I hope",
        "kind": "synonym"
      },
      {
        "term": "ものだ",
        "meaning": "Supposed to, Should, That's the way it is",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-661"
  },
  "dojg": {
    "grammar_point": "はず",
    "description": "A dependant noun which expresses the speaker’s expectation that something will take place or took place or that someone/something is or was in some state.",
    "meaning": "I expect that ~; it is expected that ~; ~ is expected to; I am fairly certain that ~; should; ought to; it is natural that ~; no wonder ~",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "133",
    "examples": [
      {
        "japanese": "(ks).クラークさんはパーティーに行くはずだ・です。",
        "english": "I expect that Mr. Clark will go to the party."
      },
      {
        "japanese": "(a).大野先生はサンドラを知っているはずです。",
        "english": "I expect that Professor Ono knows Sandra."
      },
      {
        "japanese": "(b).あの本は高かったはずだ。",
        "english": "I expect that book was expensive."
      },
      {
        "japanese": "(c).そのアパートは奇麗なはずです。",
        "english": "I expect that apartment is clean."
      },
      {
        "japanese": "(d).カールソンさんは昔先生だったはずだ。",
        "english": "I'm fairly sure that Ms. Carlson was a teacher before."
      }
    ],
    "writeup": "## 1. \"Sentenceはず\" expresses the speakers expectation, not in the sense of hoping or looking forward to something, but in the sense that the proposition expressed by Sentence should be true or come true. Thus, when the speaker uses はず he is not merely guessing, but stating a proposition based on reliable information or knowledge.",
    "formation": "## \n\n- (1){V/Adjectiveい} informal\n- はずだ\n- {話す /話した}はずだ\n- It is expected that someone will talk/talked.\n- {高い /高かった}はずだ\n- It is expected that something is/was expensive.\n- (2)Adjective な stem\n- [な/だった]はずだ\n- {静かな/静かだった}はずだ\n- It is expected that something is/was quiet.\n- (3)Noun\n- {の/だった}はずだ\n- {先生の /先生だった} はずだ\n- It is expected that s.o. is/was a teacher",
    "part_of_speech": "Noun",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/はず.yaml"
  }
}