{
  "grammar_point": "ば",
  "rank": 1,
  "bunpro": {
    "grammar_point": "ば",
    "jlpt": "N4",
    "meaning": "If… then, (Conditional)",
    "meaning_warning": "Hypothetical",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "There are several different ways to express 'if' in Japanese. One of these is through using theconjunction particleば.ばpresents hypothetical situations (possibilities), and pairs with verbs using an う to え sound-change conjugation method on the terminal (last) kana. Let's examine this with a few verbs first.As we can see with these verbs, the final kana will change to an え sound, from its original う (る to れ, う to え, く to け, す to せ, etc.) before addingば. It is important to practice these, to not get them mixed up with verbs that useれる, andられる. Unlike with these verbs, the base form ofするandくるwill not change when usingば.To conjugateい-Adjectiveswithば, the い will be replaced with けれ, one of the standardい-Adjectiveconjugation forms. After this, just addば.Forな-Adjectives, and nouns,なら(another standard conjugation form of these words) will be added, before attachingば.In the negative form (using ない), both theauxiliary verbない, and theい-Adjectiveない will conjugate in the same way. Simply replace い with けれ, and then addば.Fun FactTheならinならばis often used by itself to mean 'if', and is an abbreviation of theclassical auxiliary verbなり 'to be'. In itshypothesisform, なり will becomeならば. However, なり is very irregularly used by itself in modern Japanese, withなら, andならばbeing far more common.CautionSo that you do not mix up the conjugation rules forば, andpassiveverbs, remember that the last kana of the verb will change to an あ sound, before addingれるwithpassiveverbs. However, this change is to an え sound withば.",
    "examples": [
      {
        "japanese": "仕事を辞めれば自由時間が増えるけど、お金が無くなる。",
        "english": "If I quit work, I will have more free time, but I will have no money."
      },
      {
        "japanese": "雨が止めば、今日も釣りに行くつもりです。",
        "english": "If it stops raining, I intend to go fishing today also."
      },
      {
        "japanese": "そこの信号で右に曲がれば病院に着きます。",
        "english": "If you turn right at the light just there, you will get to the hospital."
      },
      {
        "japanese": "店に電話をすれば、すぐに予約ができるよ。",
        "english": "If you call the store, you will be able to make a reservation immediately."
      },
      {
        "japanese": "あいつがくればパーティーが楽しくなると思う。",
        "english": "If he comes to the party, I think it will be more fun."
      },
      {
        "japanese": "頭が痛ければ、薬を飲んで寝た方がいい。",
        "english": "If your head hurts, it would be better if you take some medicine and then sleep."
      },
      {
        "japanese": "ラーメン屋のチャーハンが不味ければ、そこのラーメンも不味いだろう。",
        "english": "If a ramen shop's fried rice tastes bad, then the ramen probably tastes bad too, right?"
      },
      {
        "japanese": "刺身が嫌いならば 、寿司も嫌いでしょう。",
        "english": "If you do not like sashimi, then you probably don't like sushi either, right?"
      },
      {
        "japanese": "バイクならば、バイク専用の駐輪場に止めてください。",
        "english": "If it's a motorcycle, please park it in the designated bike parking lot."
      },
      {
        "japanese": "私が作ったクッキーを食べたくなければ、捨ててもいいよ。",
        "english": "If you don't want to eat the cookie that I made, you can throw it away."
      },
      {
        "japanese": "カレーが辛くなければ、いっぱい食べれる。",
        "english": "If the curry isn't spicy, I can eat a lot of it."
      },
      {
        "japanese": "トラックの運転手でなければ、この仕事の辛さが分からない。",
        "english": "If you aren't a truck driver, then you wouldn't understand the hardships of this job."
      },
      {
        "japanese": "運動をすれば痩せるよ。",
        "english": "If you exercise, you will lose weight."
      },
      {
        "japanese": "夜遅くに電話をされると迷惑です。",
        "english": "It is very inconsiderate of you to call this late at night."
      },
      {
        "japanese": "明日雨が降れば、映画を見に行くつもり。",
        "english": "If it rains tomorrow, then I will go watch a movie."
      },
      {
        "japanese": "毎日サッカーの練習に行けば、プロのサッカー選手になれる。",
        "english": "If you go to soccer practice every day, then you can become a professional soccer player."
      },
      {
        "japanese": "今週の金曜日までに出来なければ、来週末に終わらせなくてはいけない。",
        "english": "If (you) cannot do it by this Friday, then (you) have to finish it next weekend."
      },
      {
        "japanese": "ヘルメットを被らなければ、バイクに乗れない。",
        "english": "If (you) do not wear a helmet, then (you) cannot ride a motorbike."
      },
      {
        "japanese": "展覧会に行けば、色々なことを学べる。",
        "english": "If (you) go to an exhibit, then (you) can learn a variety of things."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ば",
    "false_friends": [
      {
        "term": "たら",
        "meaning": "When, From when, Just when, If",
        "kind": "synonym"
      },
      {
        "term": "なら",
        "meaning": "Were it, If, If it's the case, As for (Conditional)",
        "kind": "synonym"
      },
      {
        "term": "と (quotation)",
        "meaning": "If, When, Whenever, And, [Conditional]",
        "kind": "synonym"
      },
      {
        "term": "もし",
        "meaning": "If (For emphasis)",
        "kind": "synonym"
      },
      {
        "term": "ば〜ほど",
        "meaning": "The more…the more",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-668"
  },
  "dojg": {
    "grammar_point": "ば",
    "description": "A conjunction which indicates that the preceding clause expresses a conditional.",
    "meaning": "If",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "81",
    "examples": [
      {
        "japanese": "(ks).この薬を飲めばよくなる・なります。",
        "english": "If you take this medicine, you'll get well."
      },
      {
        "japanese": "(a).これは松本先生に聞けば分かります。",
        "english": "You'll understand it if you ask Professor Matsumoto."
      },
      {
        "japanese": "(b).その町は車で行けば三十分で行ける。",
        "english": "You can get to that town in thirty minutes if you go by car."
      },
      {
        "japanese": "(c).安ければ買います。",
        "english": "I'll buy it if it's cheap./I would buy it if were cheap."
      },
      {
        "japanese": "(d).時間があれば京都へも行きたい。",
        "english": "If I have time, I want to go to Kyoto too./If I had time, I would want to go to Kyoto, too."
      },
      {
        "japanese": "(e).見たければ見なさい。",
        "english": "If you want to see it, see it."
      },
      {
        "japanese": "(f).出来ればこれもやってください。",
        "english": "Please do this, too, if you can."
      }
    ],
    "writeup": "## 1. \"Sentence1ばSentence2\" basically expresses a general conditional relationship between the two propositions represented by Sentence1 and Sentence2. Sentence1 represents a condition and Sentence2 a proposition which holds or will hold true under the condition. (ば is, in fact, the origin of the topic marker は.)",
    "formation": "## \n\n- (i)Group 1 verbs\n- Vconditionalば\n- 話せば\n- If someone talks\n- (ii)Group 2 verbs\n- Vstemれば\n- 食べれば\n- If someone eats\n- (iii)Irregular verbs\n- 来る→来れば\n- If someone comes\n- する→すれば\n- If someone does\n- (iv)Adjective い\n- Adjective い stemければ\n- 高ければ\n- If something is expensive\n- (v)Adjective な\n- Adjective な stem {なら(ば)/であれば}\n- {静かなら(ば)/ 静かであれば}\n- If something is quiet\n- (vi)Noun+copula\n- Noun {なら(ば)/であれば}\n- {先生なら(ば)/ 先生であれば}\n- If someone is a teacher",
    "part_of_speech": "Conjunction",
    "related": "【Related Expression: たら; (なら,と4)】4】",
    "antonym": "",
    "source": "resources/original/dojg/all/ば.yaml"
  }
}