{
  "grammar_point": "ばあいは",
  "rank": 2,
  "bunpro": {
    "grammar_point": "ばあいは",
    "jlpt": "N4",
    "meaning": "In the event of, In the case of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "場合はis a phrase in Japanese that is often translated to 'in the event of (A)', or 'in the case of (A)'. It can be used with almost any type of word, but will require な when following aな-Adjective, orのwhen following a noun.場合by itself is usually translated as 'case', or 'situation'. It is frequently used to highlight a hypothetical situation, or a viewpoint/characteristic of another person.When場合はis highlighting a viewpoint/characteristic of another person, this is almost always in contrast/comparison to something that is already being discussed. This is an example of the contrastive nuance of theはparticle.CautionIn relation to a situation, because場合means 'to encounter (A)', it has a nuance of randomness. Due to this,場合はwill not be used to describe events that regularly occur, or events that can be planned/controlled.",
    "examples": [
      {
        "japanese": "オートバイに乗る場合はヘルメットをかぶってください。",
        "english": "In the event that you will ride a motorbike, please wear a helmet."
      },
      {
        "japanese": "咳がひどい場合はマスクをしてください。",
        "english": "In the case that you have a bad cough, please wear a mask."
      },
      {
        "japanese": "仕事が大変な場合は私に電話をしてください。",
        "english": "In the case that your work is difficult, call me."
      },
      {
        "japanese": "私の場合は冬が好きです。",
        "english": "In my case, I like winter. (Personally I like winter)"
      },
      {
        "japanese": "浅草駅に行く場合はどの電車で行った方がいいですか?",
        "english": "If I were to go to Asakusa station, which train would be the best to take?"
      },
      {
        "japanese": "あなたの場合、こういう時はどうする?",
        "english": "In a situation like this, what would you do?"
      },
      {
        "japanese": "学校に行く場合は早く起きます。",
        "english": "If I were to go to school, I would wake up early. (Unnatural Japanese, unless going to school is an unusual thing for this person)"
      },
      {
        "japanese": "学校に行くときは早く起きます。",
        "english": "When I go to school, I wake up early. (Natural Japanese, if going to school is a regular thing for this person)"
      },
      {
        "japanese": "あしたのパーティーに来る場合はビールを持って来てください。",
        "english": "In the event that you will come to tomorrow's party, please bring some beer. (Focuses on the possibility of coming)"
      },
      {
        "japanese": "あしたのパーティーに来るときにビールを持って来てください。",
        "english": "When you come to the party, bring some beer with you. (Focuses on the request)"
      },
      {
        "japanese": "危険な場合はここに電話をしてください。",
        "english": "In the event that it is dangerous, please call me."
      },
      {
        "japanese": "私の犬の場合は家族と一緒です。",
        "english": "In the case of my dog, he is like family."
      },
      {
        "japanese": "遊んでいる場合は、危ないことをしないで。",
        "english": "In the case that you are playing, don't do anything dangerous."
      },
      {
        "japanese": "この商品が売り切れの場合は買えないよ。",
        "english": "You cannot buy this product in the event that it is out of stock."
      },
      {
        "japanese": "山が崩れている場合は運転をしないでください。",
        "english": "In the event of the mountain crumbling, please do not drive. (In the event of a landslide)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ばあいは",
    "false_friends": [
      {
        "term": "と (quotation)",
        "meaning": "If, When, Whenever, And, [Conditional]",
        "kind": "synonym"
      },
      {
        "term": "なら",
        "meaning": "Were it, If, If it's the case, As for (Conditional)",
        "kind": "synonym"
      },
      {
        "term": "としたら・とすれば・とすると",
        "meaning": "If it were the case that, Assuming that...",
        "kind": "synonym"
      },
      {
        "term": "に取って",
        "meaning": "To, For, Concerning",
        "kind": "synonym"
      },
      {
        "term": "万が一",
        "meaning": "Just in case, In the worst-case scenario, In the unlikely event, By any chance",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-670"
  }
}