{
  "grammar_point": "ばかりでなく",
  "rank": 4,
  "bunpro": {
    "grammar_point": "ばかりでなく",
    "jlpt": "N3",
    "meaning": "Not only…but also, As well as",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ばかりでなくis a combination of theadverbial particleばかり, with the conjugated (and negated) form of theauxiliary verbだ. It can be translated as 'not only (A), (B)', or 'not limited to (A), (B).As ばかり is anadverbial particle, it may be paired with theattributive formof other words.Like all other grammar points that negateだ, several forms may be seen. でなく, でなくて, ではなく,ではなくて, じゃなく,じゃなくて. However, it is important to remember that the addition of the は particle will place further emphasis on ない.Cautionばかりでなくis considered to be the more formal version ofだけでなく. This means thatだけでなくwill appear far more commonly in everyday speech and writing.",
    "examples": [
      {
        "japanese": "彼は仕事ばかりではなく、家事もちゃんとやっています。",
        "english": "Not only does he work, but he does house chores too."
      },
      {
        "japanese": "都内にある安いアパートは古いばかりではなく、だいたい小さくて汚い。",
        "english": "Cheap apartments in metropolitan areas aren't only old, but they are usually small and dirty."
      },
      {
        "japanese": "この池は綺麗なばかりではなく、ワニが沢山いるので危ないです。",
        "english": "This lake is more than just beautiful, there are a lot of alligators, so it is dangerous too."
      },
      {
        "japanese": "彼は宝くじに当たって、車ばかりではなく、ボートとバイクも買った。",
        "english": "He won the lottery, and not only did he buy a car, but he also bought a bike and a boat."
      },
      {
        "japanese": "彼は友達だけでなく、家族にも内緒で海外へ引っ越した。",
        "english": "Not only did he not tell his friends, but he didn't even tell his family about moving abroad."
      },
      {
        "japanese": "彼女はバスケだけでなく、水泳もするそうです。",
        "english": "Not only can she play basketball, but I heard that she can swim too."
      },
      {
        "japanese": "田中さんはサッカーばかりでなく水泳も上手です。",
        "english": "Tanaka is good at soccer as well as swimming."
      },
      {
        "japanese": "日本語は漢字ばかりでなく、ひらがなとカタカナもある。",
        "english": "Japanese not only has Kanji, but also has Hiragana and Katakana too."
      },
      {
        "japanese": "山田さんがアメリカに行ったことは、友達ばかりでなく、家族も知らなかった。",
        "english": "Not only did Yamada's friends not know that she went to America but her family didn't know either."
      },
      {
        "japanese": "悪いことばかりではなく、楽しいことを考えてみよう。",
        "english": "Try not to think only of bad things, but fun things as well!"
      },
      {
        "japanese": "自分ばかりでなく、家族にも迷惑をかけてしまった。",
        "english": "I have inconvenienced not only myself, but also my family."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ばかりでなく",
    "false_friends": [
      {
        "term": "ばかり",
        "meaning": "Just, Only, Nothing but",
        "kind": "antonym"
      },
      {
        "term": "のみならず",
        "meaning": "Not only...but, Not just...but, What is more",
        "kind": "synonym"
      },
      {
        "term": "だけでなく",
        "meaning": "Not only… but also",
        "kind": "synonym"
      },
      {
        "term": "はもちろん",
        "meaning": "Not only but also, Let alone, Not to mention, Of course",
        "kind": "synonym"
      },
      {
        "term": "だけでなく(て)〜も",
        "meaning": "Not only ~ but ~ also, Not just ~ but ~ also",
        "kind": "synonym"
      },
      {
        "term": "をはじめ",
        "meaning": "Not only...but also..., Starting with",
        "kind": "synonym"
      },
      {
        "term": "に加えて",
        "meaning": "Not only...but also, In addition, Not to mention",
        "kind": "synonym"
      },
      {
        "term": "に限らず",
        "meaning": "Not just, Not only… but also",
        "kind": "synonym"
      },
      {
        "term": "はもとより",
        "meaning": "Not only... but also, Let alone, Of course,",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-674"
  }
}