{
  "grammar_point": "ば〜ほど",
  "rank": 5,
  "bunpro": {
    "grammar_point": "ば〜ほど",
    "jlpt": "N3",
    "meaning": "The more…the more",
    "meaning_warning": "The conditional part of the structure is sometimes omitted.  この豆を食べれば食べるほど痩せるらしい。→ この豆を食べるほど痩せるらしい。",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ば〜ほど is a combination of theconjunction particleば, and thenounほど. It is used in a similar way to 'the more ~ the more' in English. Literally, it just highlights that 'if it is (A), then the limit of (A) will be controlled only by its extent'.To use ば〜ほど,ばwill be paired with thehypothetical formof any verb/い-Adjective(or noun/な-Adjectivewith なら on the end), before the same word will be repeated in itsattributive form. After this, a (B) part of the sentence will highlight what the expected result of (A) is.Asである(the formal version ofだ) may replace な withな-Adjectives(or なら with nouns), sometimesであるwill be used instead of な/なら, in regard to both nouns andな-Adjectives.CautionWhen this expression is used withするverbs, the noun thatするis linked to in theばpart of the sentence does not need to be repeated in the ほど part.Fun FactSometimes, theば'hypothetical' part of the sentence will be omitted altogether, leaving ほど to perform a similar function by itself.",
    "examples": [
      {
        "japanese": "いい肉は噛めば噛むほど味が出る。",
        "english": "The more you chew good meat, the more flavorful it gets."
      },
      {
        "japanese": "公園は広ければ広いほどいい。",
        "english": "The bigger the park is, the better it is."
      },
      {
        "japanese": "ビルは丈夫ならば丈夫なほど安心できる。",
        "english": "The stronger a building is, the safer you feel."
      },
      {
        "japanese": "プロならばプロほど速く泳げる。",
        "english": "The more of a pro you are, the faster you can swim."
      },
      {
        "japanese": "アプリが便利であれば便利であるほどユーザーが増える。",
        "english": "The more useful an app is, the more users will increase."
      },
      {
        "japanese": "職人であれば職人であるほど凄いものが作れる。",
        "english": "The more of a craftsman a person is, the more likely that they will be able to make something amazing."
      },
      {
        "japanese": "漢字の勉強をすればするほど色んな本が読めるようになる。",
        "english": "The more you study kanji, the more you will be able to read various books."
      },
      {
        "japanese": "掃除をすればするほど、部屋が綺麗になっていく。",
        "english": "The more you clean, the cleaner your room will get."
      },
      {
        "japanese": "身体を鍛えるほど、身体が強くなる。",
        "english": "The more you workout, the stronger your body gets."
      },
      {
        "japanese": "この豆を食べれば食べるほど痩せるらしい。",
        "english": "I hear that the more of these beans you eat the thinner you will become."
      },
      {
        "japanese": "早ければ早い程いい。",
        "english": "The sooner the better."
      },
      {
        "japanese": "綺麗ならば綺麗なほど見続けたくなる。",
        "english": "The more beautiful it is, the more I want to continue looking at it."
      },
      {
        "japanese": "スーパーは近ければ近い程買い物に行きやすい。",
        "english": "The closer the supermarket, the easier it is to go shopping."
      },
      {
        "japanese": "勝てば勝つほど、またやりたくなる。",
        "english": "The more you win, the more you want to play again."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ば-ほど",
    "false_friends": [
      {
        "term": "どんどん",
        "meaning": "Progressively, Rapidly increasing, More and more",
        "kind": "synonym"
      },
      {
        "term": "ば",
        "meaning": "If… then, (Conditional)",
        "kind": "synonym"
      },
      {
        "term": "一方だ",
        "meaning": "More and more, Continue to, Keep on, -er and -er",
        "kind": "synonym"
      },
      {
        "term": "ますます",
        "meaning": "Increasingly, More and more, Decreasingly, Less and less, Keep -ing",
        "kind": "synonym"
      },
      {
        "term": "ほど",
        "meaning": "The more, About, To the extent that, So much… that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-669"
  },
  "dojg": {
    "grammar_point": "~ば~ほど",
    "description": "A structure indicating that something happens in proportion to the increase of extent/degree of action or state.",
    "meaning": "The more ~, the more ~",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "6",
    "examples": [
      {
        "japanese": "(ksa).日本語は勉強すれば(勉強)するほど面白くなります。",
        "english": "The harder you study Japanese, the more  interesting it will become."
      },
      {
        "japanese": "(ksb).パーティーは人が多ければ多いほど楽しい。",
        "english": "At a party the more the merrier."
      },
      {
        "japanese": "(ksc).機械は簡単{であればある/なら簡単な}ほど壊れにくい。",
        "english": "A machine is harder to break, the simpler it  is."
      },
      {
        "japanese": "(a).この酒は飲めば飲むほど美味しくなります。",
        "english": "The more you drink this sake, the tastier it  becomes."
      },
      {
        "japanese": "(b).大学はよければよいほど入るのが難しいです。",
        "english": "The better the university, the harder it is  to get in."
      },
      {
        "japanese": "(c).アパートは駅に近ければ近いほど(家賃が)高い。",
        "english": "The closer apartments are to the station, the  more expensive they are (to rent)."
      },
      {
        "japanese": "(d).普段元気なら元気なほど体に気を付けた方がいいですよ。",
        "english": "The healthier you are, the more careful you  should be about your health."
      }
    ],
    "writeup": "## 1. The construction of ば~ほど is very close in meaning to 'the more ~, the more ~' construction in English.",
    "formation": "## \n\n- (i)V1 Conditional V2 Informal nonpast\n- ほど\n- Where Verb1=Verb2\n- 話せば話すほど\n- The more someone talks, the more ~\n- (ii)Adjective い1 conditional Adjective い2 informal nonpast\n- ほど\n- Where Adjective い1 = Adjective い2\n- 高ければ高いほど\n- The more expensive something is, the more ~\n- (iii)Adjective な1stem\n- {であるばある/ならAdjective な2 stemな}ほど\n- Where Adjective な1=Adjective な2\n- {静かであるばある/ 静かなら静かな}ほど\n- The quieter something/someone is, the more ~",
    "part_of_speech": "Structure",
    "related": "【Related Expression: ほど】",
    "antonym": "",
    "source": "resources/original/dojg/all/~ば~ほど.yaml"
  }
}