{
  "grammar_point": "ふうに",
  "rank": 6,
  "bunpro": {
    "grammar_point": "ふうに",
    "jlpt": "N2",
    "meaning": "~ way, In a way that suggests, Like ~",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "風'wind', 'air', commonly appearing as kana, is asuffixin Japanese used to indicate that something is in the style, manner, or method of what comes before it.This use of ふう appears following verbs, and works in the same way as a な-Adjective. This means that it will be followed by に when being used adverbially to further describe something that is being done 'in the way of (A)'.Also, it is common forふうにto be used after pre-noun adjectival words such as こんな, そんな, and あんな. This just highlights that something is being done 'like this', 'like that', etc.Fun-fact - For ease of remembering, coming from the kanji for風'wind', ふう can be thought of as similar to English phrases like 'to have an air of (A)', etc. However, this is just a tool for memorization, as the overlap in meaning is not 100%.",
    "examples": [
      {
        "japanese": "彼は仕事をやっているふうに見えるけど、ただそう見えるだけで、何もしていない。",
        "english": "He looks like he is doing his job, but it just looks like it and he isn't actually doing anything."
      },
      {
        "japanese": "先輩には頑張っているふうには見えないかもしれないけど、これでもめちゃくちゃ頑張っているんです。",
        "english": "Senpai, it may not look like I'm working hard, but this is me trying my hardest."
      },
      {
        "japanese": "こんなふうに結んだらすぐ解けちゃうよ。",
        "english": "If you tie a knot like this, it will get undone easily."
      },
      {
        "japanese": "そんなふうに私をみないでよ。私は本当に何もやってないから！",
        "english": "Don't look at me like that. I really didn't do anything!"
      },
      {
        "japanese": "あんなふうには絶対なりたくない。",
        "english": "I never want to be like that."
      },
      {
        "japanese": "どんなふうにやればいいのか分からない。",
        "english": "I don't know in what way doing it would be good. (I don't know how to do it)"
      },
      {
        "japanese": "いつか自分もこんなふうになりたい。",
        "english": "At some point, I too want to become like this (way)."
      },
      {
        "japanese": "どうすればあんなふうになれるのだろうか。",
        "english": "I wonder what it would take to (what if done would) be able to become that way."
      },
      {
        "japanese": "あの態度は、昇進を考えているふうには見えない。",
        "english": "With that attitude, (he) doesn't appear to be thinking about a promotion. (In that way)"
      },
      {
        "japanese": "思ってもいないのに、好きだと思っているふうに装うのは不誠実だ。",
        "english": "Pretending in a way that suggests you think you like it, even though you really don't, is insincere."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ふうに",
    "false_friends": [
      {
        "term": "のように・のような",
        "meaning": "Like (Noun), Similar to (Noun)",
        "kind": "synonym"
      },
      {
        "term": "という風に",
        "meaning": "As if to say, As if to suggest that, In such a way that, Things like",
        "kind": "synonym"
      },
      {
        "term": "如何",
        "meaning": "Depending on",
        "kind": "synonym"
      },
      {
        "term": "ように・ような",
        "meaning": "As・like, Just like",
        "kind": "synonym"
      },
      {
        "term": "かのようだ",
        "meaning": "As if, Just like",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-680"
  }
}