{
  "grammar_point": "ふりをする",
  "rank": 4,
  "bunpro": {
    "grammar_point": "ふりをする",
    "jlpt": "N3",
    "meaning": "To pretend, To act as if",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ふりをするis an expression in Japanese that is used to show that someone is 'pretending to be (A)', 'putting on airs of (A)', or 'acting as if (A)'. This construction comes from a combination of the noun振り 'a shake', theadverbial particleを, andする. It can be thought of as meaning 'to give off the impression of (A)', or 'to shake off the impression of (A)'.As ふり itself is a noun, this expression may be used with theattributive formof any other word.Fun FactThe noun振り has several different nuances in Japanese, with only one of them being used in this particular expression. That meaning is 'to show a certain behavior pattern on the outside'. Due to this, ふり doesn't specifically mean 'to pretend', just that what is happening on the outside may be different to what is happening within a person (either mentally or physically).",
    "examples": [
      {
        "japanese": "この蛇は人等大きな動物が近づくと死んだ振りをするらしい。",
        "english": "I heard that this snake pretends to be dead when humans and bigger animals approach it."
      },
      {
        "japanese": "僕は子供の頃、よく寝ている振りをした。",
        "english": "When I was a child, I would often pretend to sleep."
      },
      {
        "japanese": "欲しいのはこれではなかったけど、せっかく買ってくれたから嬉しい振りをする。",
        "english": "This is not what I wanted, but since they went out of their way and bought it for me, I will pretend that I am happy."
      },
      {
        "japanese": "俺の前ではそんな、元気な振りをしなくていいよ。",
        "english": "You don't have to pretend that you are happy in front of me."
      },
      {
        "japanese": "カケル君はカエルが好きだからいつもカエルの振りをして遊んでいる。",
        "english": "Because Kakeru-kun likes frogs, he always pretends to be a frog when he plays."
      },
      {
        "japanese": "私の犬は寝た振りをすることがある。",
        "english": "There are times when my dog pretends to sleep."
      },
      {
        "japanese": "子供は、注意された時に、聞こえない振りをした。",
        "english": "The child pretended not to hear while she was being scolded."
      },
      {
        "japanese": "どんなことについても知っている振りをする人は信頼ができない。",
        "english": "I don't trust people who act as if they know everything."
      },
      {
        "japanese": "病気の振りをして会社を休んだ。",
        "english": "Pretending to be sick, I took the day off work."
      },
      {
        "japanese": "熊に遭遇した時、死んだ振りをしてもあまり意味がないと聞いた。",
        "english": "I have heard that when you encounter a bear, even if you pretended to be dead, it won't make much difference"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ふりをする",
    "false_friends": [
      {
        "term": "っぽい",
        "meaning": "-ish, -like, Characteristic of, Typical of, Tendency to",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-681"
  }
}