{
  "grammar_point": "べく",
  "rank": 9,
  "bunpro": {
    "grammar_point": "べく",
    "jlpt": "N1",
    "meaning": "For the purpose of, In order to, To ensure",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "As theconjunctive formof theclassical auxiliary verbべし,べくwill be attached to thedictionary formof verbs in order to convey the purpose of an action. This will be translated as 'for the purpose of (A), (B)', 'in order to (A), (B)', or 'to ensure that (A), (B)'.べくitself will only attach to verbs that can be done intentionally, with some purpose in mind. The (B) part ofべくsentences will also indicate an intentional action that will be performed in order to reach the goal of (A).When combining する withべく, due toべくbeing aclassical auxiliary verb, it will attach to the classical stem of する, す. However, in modern Japanese it is fairly common to see bothすべくandするべく, with both forms being considered correct.べくitself is a very formal structure in modern Japanese, so will rarely be used in standard speech.Fun FactAlthough べし and all of its conjugations have slightly different translations based on the grammar points that they appear in, the underlying meaning can be stemmed from the originating kanji可し, meaning 'to be permissible'. The focus with this kanji and all forms of べし are just that the word it is attached to is being marked as a strong goal. This means that rather than 'in order to (A)',べくis closer to 'to attain (A)', in that it adds further emphasis.",
    "examples": [
      {
        "japanese": "地域の高齢者の安全を守るべく、交番が設置されました。",
        "english": "In order to ensure the safety of the elderly in the community, a police box has been set."
      },
      {
        "japanese": "息子は医者になるべく、ここ3年間ほぼ寝ずに毎日勉強をしている。",
        "english": "In order to become a doctor, he has been studying these past 3 years without much sleep."
      },
      {
        "japanese": "ここでの交通事故を防止すべく、ガードレールなどの設備を設置することになった。",
        "english": "In order to prevent car accidents here, things such as guardrails are to be installed."
      },
      {
        "japanese": "次の大会で優勝するべく、彼らは毎日朝から夜まで練習をするようにしている。",
        "english": "They try to practice every day from morning to night in order to win the next competition."
      },
      {
        "japanese": "彼は研修医となるべく、5年以上医科大学で修練しました。",
        "english": "In order to become a medical intern, he studied at a medical college for five years."
      },
      {
        "japanese": "コーポレートサイト：「クライアントのニーズに応える可く、我が社は世界で初めて、AIカスタマーサポートを生み出しました。」",
        "english": "Corporate site: 'In order to meet our customers' needs, our company has developed the world's first AI customer support.'"
      },
      {
        "japanese": "大学ウェブサイト：「IZU科学技術大学では、予定通り秋期講座を開講す可く、鋭意準備を進めてまいりました。」",
        "english": "University website: 'We, at the IZU university of science and technology, have been making preparations in order to launch lectures for the Fall Term as planned.'"
      },
      {
        "japanese": "社長の演説：「当社はCO2排出量の低減義務を果たす可く、工場にCO2専用フィルタの取り付けを決定いたしました。」",
        "english": "Company president speech: 'Our company has decided to install specialized CO2 filters in our factories to ensure that we meet CO2 emission reduction obligations.'"
      },
      {
        "japanese": "伝記：「ホテル業界での有力者としての地位を固める可く、海外でもホテルを購入しようとしたが、拒否されてしまった。」",
        "english": "Biography: 'In order to cement his influential position in the hotel world, he also attempted to buy hotels abroad, but he was refused.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/べく",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-688"
  },
  "dojg": {
    "grammar_point": "べく",
    "description": "The verb modification form of the auxiliary bekida, which is used to indicate a purpose or aim.",
    "meaning": "In order to; to; for the purpose of; for; so that ~ (can)",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "32",
    "examples": [
      {
        "japanese": "(ks).この大学では、二学期制に変えるべく今準備が進められている。",
        "english": "At this university, preparation is under way for changing (the  current system) to a semester system."
      },
      {
        "japanese": "(a).K社は人件費を削減すべく大規模なリストラを行う予定だ。",
        "english": "K Company plans to execute large-scale restructuring in order  to reduce personnel expenses."
      },
      {
        "japanese": "(b).当社はいち早くお客さまの多様なニーズに対応すべく、最新の設備を導入してまいりました。",
        "english": "We (literally: our company) have installed the newest  facilities so that we can quickly respond to our customers' various needs."
      },
      {
        "japanese": "(c).二児の母親ですが、現在フットセラピストとして独立すべく勉強中です。",
        "english": "I am a mother of two children and am currently studying to  start my own practice as a foot therapist (literally: to become independent as  a foot therapist)."
      },
      {
        "japanese": "(d).本学は、経済的な理由で大学教育を受けられない海外の優秀な学生にその機会を与えるべく、奨学金を供与している。",
        "english": "We (literally: our university) provide scholarships to give  educational opportunities to excellent students from overseas who cannot go on  to higher education for ﬁnancial reasons."
      },
      {
        "japanese": "(e).重大な事故が発生した場合、お客様の安全確保を最優先として迅速な対応を行うべく、社内システムの見直しを行いました。",
        "english": "We have re-examined our internal systems so that we can rapidly  respond to major accidents in a manner that gives highest priority to customer  safety."
      },
      {
        "japanese": "(f).より進んだ経営革新を行うためには、マネジメントシステム運用時の無駄を省くべく、システム間の重複をなくすことが重要である。",
        "english": "In order to engage in management innovation that is more advanced,  it is important to remove redundancy in management systems so that we can  eliminate unnecessary operations."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vinformal nonpast\n- べく\n- Exception: する→{す/する}べく\n- 話すべく\n- In order to talk (to someone)\n- 勉強す(る)べく\n- In order to study",
    "part_of_speech": "Auxiliary (usually used in formal writing and formal speech)",
    "related": "【Related Expression: 為(に)】",
    "antonym": "",
    "source": "resources/original/dojg/all/べく.yaml"
  }
}