{
  "grammar_point": "ほかに(も)・ほか(に)は",
  "rank": 2,
  "bunpro": {
    "grammar_point": "ほかに(も)・ほか(に)は",
    "jlpt": "N4",
    "meaning": "Other, Another, Any other, Anything else, As well as, Besides, In addition",
    "meaning_warning": "ほかにもcannot be used in negative sentences, with the exception of questions外is another way to write ほか",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "他にis regularly considered to be one of the more difficult structures to master in Japanese, so let's take a thorough look at it. Basically,他by itself just means 'another', or 'other'.にhighlights他'another thing' as being the target of what comes next in any particular sentence. The possibilities are as follows:他に- Another thing.他に(も) - Even another thing (sounds less certain).他に(は) - Was there another thing (focuses on something pre-existing, which someone may have forgotten).他の+Noun - Another 'specific thing'.他に(は) may be used in either positive or negative sentences, but it tends to appear in negative sentences more often.CautionBecause他に(も) focuses on the 'addition' of another thing, it cannot be used in negative sentences (with the exception of questions).The reason this is acceptable in questions, but not statements, is due to the 'isn't it?' meaning that negative questions can have in Japanese (just like English). It is the equivalent of the following:この他にもない - In addition to this, there is also nothing (sounds strange in English!)その他にもないか - In addition to that, is there nothing else? (sounds normal in English!)",
    "examples": [
      {
        "japanese": "他に、欲しいものはある?",
        "english": "Is there anything else you want?"
      },
      {
        "japanese": "動物園の他にもどこかへ行きますか。",
        "english": "Is there anywhere else you want to go, other than the zoo?"
      },
      {
        "japanese": "他にはない物が食べたい。",
        "english": "I want to eat something that isn't anywhere else. (Something unique to this place)"
      },
      {
        "japanese": "この電子レンジは壊れているので他の電子レンジをお使いになってください。",
        "english": "This microwave is broken so please use a different one."
      },
      {
        "japanese": "お金の他には何が欲しいですか。",
        "english": "Other than money, what do you want?"
      },
      {
        "japanese": "彼の他にはフランス語を話せる人はいません。",
        "english": "Other than him, there isn't anyone else that can speak French."
      },
      {
        "japanese": "欲しいものは、その他にもない。",
        "english": "There is also nothing else besides what I want. (Unnatural Japanese)"
      },
      {
        "japanese": "その他にも何か質問がありませんか?",
        "english": "Besides that, are there no other questions? (Natural Japanese)"
      },
      {
        "japanese": "(その)他に、行きたいところはありますか?",
        "english": "Are there any other places (in addition to that) you would like to go to?"
      },
      {
        "japanese": "この本だけですか。(この/この本の)他にもほしいものはありますか。",
        "english": "Only this book? Is there anything else (besides this one/this book) you want?"
      },
      {
        "japanese": "他は?",
        "english": "Anything else?"
      },
      {
        "japanese": "いいえ、他はいりません。",
        "english": "No, I don't need anything else."
      },
      {
        "japanese": "私はあまりジュースを飲まないから、他の飲み物がほしいです。",
        "english": "Since I do not really drink juice, I want another beverage."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ほかにも-ほかには",
    "false_friends": [
      {
        "term": "いがい",
        "meaning": "Except・besides, Other than, With the exception of",
        "kind": "synonym"
      },
      {
        "term": "をおいてほかに〜ない",
        "meaning": "No...but, Nothing else but, None other than",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-691"
  }
}