{
  "grammar_point": "ほど",
  "rank": 5,
  "bunpro": {
    "grammar_point": "ほど",
    "jlpt": "N3",
    "meaning": "The more, About, To the extent that, So much… that",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ほど, coming from the kanji程'an extent', is used for describing rough estimates about the 'amount' of something. However, unlike expressions such as くらい (which focuses more on the speaker's uncertainty about the exact number), ほど puts emphasis on the upper (or lower) limit of something as having been 'reached'. Due to this, it is usually translated as 'so much that (A)', or 'to the extent that (A)'.ほど can be added on to the end of theattributive formof any word. Theattributive formbeing the form that is able to be partnered directly with nouns.CautionAlthough くらい may be used to describe something that is 'around' a certain extent (regardless of whether it is above or below that extent),程refers specifically to the 'limit' of something, and therefore cannot be used to describe something that exceeds the stated limit. Due to this, it is regularly used to express some sort of exaggerated limit of (A), when the real extent is far below that.",
    "examples": [
      {
        "japanese": "死ぬほど練習したけれど、試合に出られなかった。",
        "english": "I practiced myself to death, but I was not able to enter the tournament."
      },
      {
        "japanese": "その気持ちは痛いほど分かるけど、だからってそういう事言ってもいいと言う訳では無いよ。",
        "english": "I understand how you feel to the point that it hurts, but that doesn't mean that you can say stuff like that."
      },
      {
        "japanese": "それは嫌なほど聞かされたから、分かってる。",
        "english": "I have been told that so much that I don't want to hear it anymore, I get it."
      },
      {
        "japanese": "あと10分ほどで着きます。",
        "english": "I will be there in about 10 minutes."
      },
      {
        "japanese": "今日は二度と走りたくないほど走った。",
        "english": "Today, I ran so much that I never want to run again."
      },
      {
        "japanese": "ピンが落ちた音が聞こえる程、静かだった。",
        "english": "It was quiet to the extent that you could hear a pin drop. (degree・bounds・limit)"
      },
      {
        "japanese": "二度と食べたくない程、ピザを食べた。",
        "english": "I ate pizza to the extent that I don't ever want to eat it again. (degree・bounds・limit)"
      },
      {
        "japanese": "わがままと言う程甘やかしている。",
        "english": "I am spoiling her/him to the extent that people would say she/he's selfish. (degree・bounds・limit)"
      },
      {
        "japanese": "今回は一週間程旅行するつもりだ。",
        "english": "This time, I plan to go on a trip for about one week. (degree・bounds・limit)"
      },
      {
        "japanese": "あの二人は他人なのに、驚く程よく似ている。",
        "english": "Those two are complete strangers, but they look surprisingly similar. (so much so)(They look similar to the extent that I am surprised) (degree・bounds・limit)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ほど",
    "false_friends": [
      {
        "term": "くらい ①",
        "meaning": "About, Approximately",
        "kind": "synonym"
      },
      {
        "term": "まで",
        "meaning": "Even, To even, To the extent of",
        "kind": "synonym"
      },
      {
        "term": "ば〜ほど",
        "meaning": "The more…the more",
        "kind": "synonym"
      },
      {
        "term": "ほど〜ない",
        "meaning": "Is not as…as, Isn't... like..., Not to the extent of...",
        "kind": "synonym"
      },
      {
        "term": "くらい ②",
        "meaning": "To the extent that, So…that, About the only thing that...",
        "kind": "synonym"
      },
      {
        "term": "は〜くらいです",
        "meaning": "About the only, To the extent that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-693"
  },
  "dojg": {
    "grammar_point": "ほど",
    "description": "A particle which indicates the extent or the degree to which someone/something does something or is in some state.",
    "meaning": "The ~, the ~; as; to the extent",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "57",
    "examples": [
      {
        "japanese": "(ksa).この音楽は舞台に近いほど聞きやすい。",
        "english": "The closer (you sit) to the stage, the easier  this music is to hear."
      },
      {
        "japanese": "(ksb).上空に行くほど酸素が薄くなる。",
        "english": "Oxygen is less dense at higher altitudes.  (literally: Oxygen becomes thinner as you go higher / the extent to which you  go higher in the air.)"
      },
      {
        "japanese": "(ksc).私は難しい仕事ほどやる気が出てくる。",
        "english": "I get more motivated by a harder job."
      },
      {
        "japanese": "(a).子供は小言を言うほど反発するものだ。",
        "english": "The more you nag children, the more they  disobey you."
      },
      {
        "japanese": "(b).私は静かなほど落ち着かない。",
        "english": "The quieter it is, the more uneasy I feel."
      },
      {
        "japanese": "(c).駅に近くなるほど家賃が高くなる。",
        "english": "The closer to the station, the higher the  rent."
      },
      {
        "japanese": "(d).運動するほど体の調子が変になる。",
        "english": "The more I exercise, the worse I feel."
      },
      {
        "japanese": "(e).元気な人ほど無理をしがちだ。",
        "english": "Stronger people tend to strain themselves  more."
      },
      {
        "japanese": "(f).あまり働かない者ほど不平が多い。",
        "english": "Lazier people complain more."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjective い}informal nonpast\n- ほど\n- 勉強するほど\n- The more someone studies\n- 高いほど\n- The more expensive something is\n- (ii)Adjective な stem\n- {な/である}ほど\n- 便利{な/である}ほど\n- The more convenient something is\n- (iii)Relative Clause+Noun\n- ほど\n- 考え方が論理的な人ほど\n- The more logical a person’s way of thinking is\n- よく勉強する学生ほど\n- A student who studies harder; the harder a student studies",
    "part_of_speech": "Particle",
    "related": "【Related Expression: ば~ほど; くらい】",
    "antonym": "",
    "source": "resources/original/dojg/all/ほど.yaml"
  }
}