{
  "grammar_point": "までもない",
  "rank": 7,
  "bunpro": {
    "grammar_point": "までもない",
    "jlpt": "N1",
    "meaning": "There is no need to, Do not have to, It is not necessary to, Needless to",
    "meaning_warning": "While までもなくて is also used、 it is less common than までもなく",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "までもないis a grammar pattern that consists of the particle まで 'until', theadverbial particleも, and ない 'there is not'. This structure will primarily be seen with a translation similar to 'there is no need to (A)', or 'it is not necessary to (A)'. However, a more literal translation of 'it is not so far as to (A)' is also completely acceptable, and still carries the correct nuance.までもないwill be used following verbs in theirdictionary form, and may or may not have a part (B) explaining why (A) is not necessary.As can be assumed by the use of まで, the primary nuance ofまでもないis that while there may be some sort of slight issue or problem, the speaker does not consider it as being something that has reached a point that is worth being concerned about. It may also indicate that because something is obvious, it does not need to be confirmed, etc.CautionWhen coming between an (A) and a (B) phrase, theconjunctive formまでもなくwill be used, but this is less common.",
    "examples": [
      {
        "japanese": "痛いけど、指は全部ちゃんと動くから病院に行くまでもないと思う。",
        "english": "Although it hurts, all my fingers move properly so there is no need to go to the hospital."
      },
      {
        "japanese": "息子を見て、何か悪いことをしたと分かった。聞くまでもなかった。",
        "english": "I could tell that my son did something bad by just looking at him. It was not necessary for me to ask anything."
      },
      {
        "japanese": "あの人ならなんとかしてくれるよ。心配するまでもないよ。",
        "english": "Knowing that person, they would probably do something about it. There is no need to worry."
      },
      {
        "japanese": "言うまでもなく、不法投棄で近所の人が迷惑しています。",
        "english": "It goes without saying that illegal disposal of garbage is causing troubles to the people in this neighborhood."
      },
      {
        "japanese": "あのね......そんごくうはクリリンなんかとは比べるまでもなく、それどころかベジータよりもずっと強いんだから。",
        "english": "Hey, there is no need to compare Goku to someone like Krillin, because he is far stronger than Vegeta."
      },
      {
        "japanese": "先生は、すでに全て解説したので聞くまでもない。",
        "english": "There is no need to ask questions because the teacher has already explained everything."
      },
      {
        "japanese": "この試験の難しさから考えると、試験の結果発表は見るまでもなく明らかだ。",
        "english": "Judging from this exam's difficulty, the results are clear without the need to see them."
      },
      {
        "japanese": "ゆきちゃん：「さきちゃん、あれはひどかったよ。」さきちゃん：「あんな奴なら、優しくするまでもない。」",
        "english": "Yuki: 'Saki, that was cruel.'Saki: 'If it's a guy like that, there is no need to be friendly.'"
      },
      {
        "japanese": "「今さら訂正するまでもなく、明らかに間違っている。」",
        "english": "'There is no need to correct it, it is clearly wrong.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/までもない",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-711"
  },
  "dojg": {
    "grammar_point": "までもない",
    "description": "There is no point in going as far as to do something.",
    "meaning": "Not necessary (to bother) to; do not need (to go as far as) to; do not have to",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "159",
    "examples": [
      {
        "japanese": "(ksa).これは簡単な計算だから計算器を使うまでもない。",
        "english": "This  is a simple calculation, so it is not necessary (to bother) to use a  calculator."
      },
      {
        "japanese": "(ksb).言うまでもなくジョージ・ワシントンはアメリカの初代大統領だ。",
        "english": "Needless  to say, George Washington was the first president of the United States."
      },
      {
        "japanese": "(a).彼がみんなに尊敬されたのは言うまでもない。",
        "english": "It  goes without saying that he was respected by everybody."
      },
      {
        "japanese": "(b).大した用事じゃないからあなたがわざわざ行くまでもないでしょう。",
        "english": "It  is not important business, so it is probably not necessary for you to (take the  trouble to) get there."
      },
      {
        "japanese": "(c).行けば分かることですから電話して聞くまでもありません。",
        "english": "We  can find out when we get there, so we don't need to call and about it."
      },
      {
        "japanese": "(d).今更申すまでもありませんが、山中先生はこの分野では指導的な立場にあるお方です。",
        "english": "Needless  to say (now), Professor Yamanaka is a leading figure in this field."
      },
      {
        "japanese": "(e).それは説明するまでもなく明らかなことだ。",
        "english": "It  is so obvious that no explanation is necessary."
      },
      {
        "japanese": "(f).待つまでもなく妻は買い物から帰ってきた。",
        "english": "My  wife came back from shopping without my having to wait for her."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vinformal nonpast\n- までもない\n- 話すまでもない\n- Not necessary (to bother) to talk",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: 必要はない; ほどのこともない; には及ばない】",
    "antonym": "",
    "source": "resources/original/dojg/all/までもない.yaml"
  }
}