{
  "grammar_point": "ままに (as desired)",
  "rank": 8,
  "bunpro": {
    "grammar_point": "ままに (as desired)",
    "jlpt": "N1",
    "meaning": "As (one likes, feels or pleases), Spur of the moment, Wherever one fancies, Spontaneously, On a whim",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Unlike theままにthat is partnered with passive structures like れる and られる 'to do as one is told', when paired with verbs in theirstandard forms, ままに means 'to do (A) as one wishes', or 'to do (A) on a whim'.ままにis a combination of thenounまま 'as is', and thecase marking particleに.ままにwill follow verbs in theirdictionary form.In many cases, this use ofままにindicates that the speaker or doer is letting the action of (A) happen in whatever way is most natural, and is not making any particular effort to control the outcome. Due to this, there are only a limited number of verbs that are commonly used withままに, and it is best not to attempt to use combinations that you have not come across before.Some standard sequences are気の向くままに'in whatever way my attention is inclined',思うままに'in whatever way I think up',思いつくままに'in whatever way I come up with',足の向くままに'in whatever direction my feet are pointed',赴くままに'in whatever way it proceeds',欲するままに'in whatever way is desired', and風の吹くままに'in whatever way the wind blows'.",
    "examples": [
      {
        "japanese": "これはもうあなたのものだから、自分が思うままに使えばいいよ。",
        "english": "This is yours now, so you can use it as you see fit."
      },
      {
        "japanese": "僕はしばらくの間一人で、足の向くままに旅をする。",
        "english": "I will be alone for a while, traveling wherever my feet take me."
      },
      {
        "japanese": "文法とかは気にしなくていい！ただ思いつくままに書いてくれればいい。",
        "english": "There is no need to worry about grammar! Just write whatever comes to mind."
      },
      {
        "japanese": "筆者とのインタビュー：「これまで、思いつくままにいろいろと書いてきましたが、出来が良くないような気がしましたので出版しないことに決めました。」",
        "english": "Interview with an author: 'Previously, I wrote many things as they spontaneously came to my mind, but because I felt the end product was not very good, I decided not to publish them.'"
      },
      {
        "japanese": "A：「ジラヤさんはどこ?」B：「わからん。どこかに行ったんだ。」A：「相変わらず、風の吹くまま、赴くなぁ。」",
        "english": "A: 'Where is Jiraya?'B: 'Dunno. He went somewhere.'A: 'As always, he goes wherever the wind takes him.'"
      },
      {
        "japanese": "モーガンさん、クリスチャンさんに：「あなたのものですから気兼ねなく自分の思うままに扱ってもいいです。」",
        "english": "Mr. Morgan to Mr. Christian: 'It belongs to you, so feel free to handle it as you please.'"
      },
      {
        "japanese": "抽象画家は深く考えずに形や色を気の向くままに選ぶ。",
        "english": "Abstract painters choose shapes and colors as they please, without thinking deeply about them."
      },
      {
        "japanese": "小説：「彼女は特に行き先も目的も考えず足の向くままに歩き続けた。」",
        "english": "Novel: 'She kept on going as her feet led her, without any particular goal or destination in mind.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ままに",
    "false_friends": [
      {
        "term": "したがって",
        "meaning": "Therefore, Thus, As a result",
        "kind": "synonym"
      },
      {
        "term": "とおり",
        "meaning": "In that way, Exactly, Precisely, Just as",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-713"
  }
}