{
  "grammar_point": "まで(のこと)だ",
  "rank": 10,
  "dojg": {
    "grammar_point": "まで(のこと)だ",
    "description": "A phrase indicating someone’s decision to cope with a negative situation, or a simple, straight forward reason for his/her action.",
    "meaning": "Just; merely; only",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "243",
    "examples": [
      {
        "japanese": "(ksa).もしTOEFLの点が悪かったらもう一度受けるまで(のこと)だ。",
        "english": "If my TOEFL score isn't good, then I'll just take the test  again."
      },
      {
        "japanese": "(ksb).日本語は面白そうだったので、取ったまで(このと)だ。",
        "english": "I took Japanese language only because it looked interesting  (not for any other reason)."
      },
      {
        "japanese": "(a).結婚できなかったら、一生独身で仕事をするまでのことだ。",
        "english": "If I cannot marry I will just stay single for the rest of my  life and do my work."
      },
      {
        "japanese": "(b).就職できなかったら、フリーターになるまでのことだ。",
        "english": "If I cannot get a regular job, I will just become a permanent  part-time worker."
      },
      {
        "japanese": "(c).バスが来ないんなら歩いて帰るまでだ。",
        "english": "If a bus doesn't come, I will just walk home."
      },
      {
        "japanese": "(d).夕食にどうぞと言われたから彼女のアパートに行ったまでだ。とやかく言われる筋合いはない。",
        "english": "I went to her apartment just because she invited me over to  dinner. You have no right to say such a critical thing to me."
      },
      {
        "japanese": "(e).小説みたいなものを書いたが、別に小説家になりたいと思ったのではない。小説を書くということがどんなことか知りたかったまでのことだ。",
        "english": "I've written something like a novel, but I never particularly  thought I wanted to be a novelist. I just wanted to know what it was like to  write a novel. That's all."
      },
      {
        "japanese": "(f).あなたに私の個人的なことを話したのは、あなたの将来に多少役立つかと思ったまでのことです。",
        "english": "The reason I told you about my personal matters is just because  I thought it would be useful for you in the future. Nothing more and nothing  less."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vinformal\n- まで(のこと)だ\n- 帰るまで(のこと)だ\n- Someone will just go home, and that’s all\n- 言ったまで(のこと)だ\n- Someone just said something, and that’s all",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: だから(のこと)だ】",
    "antonym": "",
    "source": "resources/original/dojg/all/まで(のこと)だ.yaml"
  }
}