{
  "grammar_point": "もしも〜なら・もしも〜でも",
  "rank": 4,
  "bunpro": {
    "grammar_point": "もしも〜なら・もしも〜でも",
    "jlpt": "N3",
    "meaning": "If, Supposing",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "もしもis anadverbin Japanese that strengthens the base meaning ofもし'a bit'. Therefore, the literal meaning ofもしもis 'even a bit'. Despite this, asもしandもしもare almost exclusively paired with sentences that use some sort ofassumption, or 'hypothesis' based expression,もしもwill often be translated as 'supposing that'.もしもwill be used at the beginning of sentences that include almost any form ofhypothesisexpression. For example,ば,と,なら, or ても.Althoughもしもis considered a stand-alone adverb, it is just a combination ofもし, and theadverbial particleも.Cautionもしandもしもare most often used to express some type of result. This means that (B) will happen if (A) happens, or if (A) is true. However, たとえ is contrastive, and therefore asks 'what the result' of a specific situation may be.",
    "examples": [
      {
        "japanese": "もしも、今年中に引っ越すのならば、僕が手伝ってやるよ。",
        "english": "Supposing that you move within this year, I will help you."
      },
      {
        "japanese": "もしも仕事で怪我をすると、現場が止まるので気をつけてください。",
        "english": "Supposing that you get hurt at work, the site will be shut down, so please be careful."
      },
      {
        "japanese": "もしも明日休みなら、一緒に博物館へいかない?",
        "english": "Assuming you have a day off tomorrow, do you want to go to the museum with me?"
      },
      {
        "japanese": "もしも彼がいたとしても、今日中には終わらなかっただろう。",
        "english": "Supposing he were even here, don't you think we would not have been able to complete it by today?"
      },
      {
        "japanese": "もし、また宿題を忘れたら親に電話をします。",
        "english": "Assuming you forget your homework again, I will call your parents. (Calling their parents will be the result of forgetting their homework)"
      },
      {
        "japanese": "たとえ、テストが難しくても最後まで諦めないで頑張ってください。",
        "english": "If, for example, the test is hard, don't give up, and do your best until the very end. (If the test is difficult, doing your best is not a result, just one of many choices that could be made)"
      },
      {
        "japanese": "もしもドラえもんがいたなら、助けてもらえるのに。",
        "english": "If Doraemon were here, he would help us."
      },
      {
        "japanese": "もしも僕がドラえもんでも助けられない。",
        "english": "Even if I were Doraemon I would be unable to help."
      },
      {
        "japanese": "もしも戦うなら囲碁がいい。",
        "english": "If we are going to battle, I say we settle it with a game of Go."
      },
      {
        "japanese": "もしもこの計画が実現したなら、この街はもっと住みやすくなるでしょう。",
        "english": "If the plan becomes a reality, this town will become much easier to live in."
      },
      {
        "japanese": "シリクス：「もしも生まれ変わるなら、その時も僕と結婚してくれる?」",
        "english": "Sirix: 'If you were reborn, would you marry me again?'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/もしも〜なら・もしも〜でも",
    "false_friends": [
      {
        "term": "たとえ〜ても",
        "meaning": "Even if…is the case, Supposing that",
        "kind": "synonym"
      },
      {
        "term": "なら",
        "meaning": "Were it, If, If it's the case, As for (Conditional)",
        "kind": "synonym"
      },
      {
        "term": "もし",
        "meaning": "If (For emphasis)",
        "kind": "synonym"
      },
      {
        "term": "でも",
        "meaning": "Or something,  Any... (with question words), No matter (who)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-728"
  }
}