{
  "grammar_point": "ものなら (if you were to do)",
  "rank": 8,
  "bunpro": {
    "grammar_point": "ものなら②",
    "jlpt": "N1",
    "meaning": "If you were to do, If you try to, If … happens, Should there be",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "ものならis a combination of the noun もの ‘thing’, and thehypothetical formof theauxiliary verbだ, なら ‘if’. Common translations include ‘If you were to (A), (B)’, of ‘if (A) happens, (B)’. In this particular use ofものなら, (A) will be a verb in its volitional form, and (B) will be some sort of negative result that would come about from that. Let’s have a look at a few examples.Keeping in mind that the volitional form can mean to approach an action with reckless abandon, it can be thought of as being similar to the English ‘to go and do (A)’, where the ‘to go and’ just indicates proceeding ahead without carefully considering the outcome.Fun Factなら is often translated as ‘if’ in many textbooks and online resources, but knowing that it is just a conjugation of だ ‘is’, the more literal translation is ‘were’. This ‘were’ behaves exactly the same way in English in hypothetical situations, so may potentially be better if you would like to avoid confusion between other ‘if’ grammar patterns like ば, と, and たら. An example of this can be seen in sentences like ‘were it to rain tomorrow, then I would need an umbrella’. Because of this, it is recommended to memorize なら purely as ‘were’, rather than the ‘if’ interpretation that is usually attached to it.",
    "examples": [
      {
        "japanese": "彼女の誕生日を忘れようものなら、一日中機嫌が悪くなる。",
        "english": "If you were to forget her birthday, she would be in a bad mood all day."
      },
      {
        "japanese": "このレポートを出し忘れようものなら、今までの努力が水の泡だ。",
        "english": "All of our efforts would be worth nothing, if I happen to forget to submit this paper."
      },
      {
        "japanese": "以前同じようなことで炎上したから、また似たようなことで炎上しようものならこの業界から干されるに違いない。",
        "english": "Since we went under fire with something similar before, if we go under fire for something similar again, I am sure we would be sidelined from this industry."
      },
      {
        "japanese": "しのぶさんはとても血を恐れている。万が一、一滴でも血を見ようものなら気絶してしまうはずだ。",
        "english": "Shinobu is completely terrified of blood. If she were to see even one drop of it by chance, she would faint for sure."
      },
      {
        "japanese": "ブラッド・ピットに出逢おうものなら、死んでしまう。",
        "english": "If I were to run into Brad Pitt, I would die."
      },
      {
        "japanese": "秘密を打ち明けようものなら、彼女はすぐに他の奴らにしゃべってしまうだろう。",
        "english": "If you happen to tell her a secret, she will quickly spill it to others."
      },
      {
        "japanese": "万が一このプロジェクトが失敗しようものなら、我々は終わりだ。",
        "english": "If this project were to fail, we'd be finished."
      },
      {
        "japanese": "うっかり彼のお菓子を食べようものなら、きっと、ものすごく彼にしかられるはずだ。",
        "english": "If you were to go and eat his sweets, you would be scolded for sure."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ものなら②",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-741"
  }
}