{
  "grammar_point": "ものがある",
  "rank": 6,
  "bunpro": {
    "grammar_point": "ものがある",
    "jlpt": "N2",
    "meaning": "Strong judgement, There is something, Feel strongly that",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "ものがあるis an interesting grammar structure in Japanese that is used to declare that something has a particular trait of (A), according to the speaker's subjective opinion. Often,ものがあるis translated as 'I feel strongly that (A)', or 'there is something (A) about (B)'. The latter meaning is very close to the literal translation here, as もの 'thing', がある 'there is' implies that the speaker strongly senses the presence of (A) within (B), even if they themselves cannot figure out why they feel that way.ものがあるis primarily seen following verbs in either their dictionary or negated forms, い-Adjectives, or な-Adjectives followed by な.Asものがあるemphasizes the existence of (A) within (B), it is very common for the emphasized には to also be used in place of に when highlighting the topic.Caution - Although 'I feel strongly that (A)' is a common interpretation ofものがある, it is important to remember that the actual thing that is generating that feeling within the speaker may either be very strong, or very weak. In other words,ものがあるmay be used even when something isn't obvious about (A), so long as the speaker themselves feel strongly about it.Fun-fact -目を見張るものがあるis a set phrase that is a combination of目を見張る 'to be astonished', andものがある. In most cases, this expression just means that (B) is extremely surprising or impressive.",
    "examples": [
      {
        "japanese": "この映画は人の心を動かすものがある。",
        "english": "This film has something that moves people's hearts."
      },
      {
        "japanese": "彼の話には納得いかないものがある。",
        "english": "There is something about his story that I don't agree with."
      },
      {
        "japanese": "自分が好きなことを仕事にできるのは、嬉しいものがある。",
        "english": "There is something delightful about being able to do what you love for a living."
      },
      {
        "japanese": "子供だけで川で遊ばせるのは、危険なものがある。",
        "english": "There is something dangerous about letting children play in the river alone."
      },
      {
        "japanese": "彼の運動神経の良さは目を見張るものがある。",
        "english": "His athleticism is remarkable."
      },
      {
        "japanese": "日本の伝統芸能には、心を動かすものがある。",
        "english": "In Japanese traditional art, there is something that really moves your heart."
      },
      {
        "japanese": "美味しいものを食べるため、寒い中行列に並ぶのはつらいものがある。",
        "english": "It is very hard to stand in line in the bitter cold, just to eat something delicious. (strong judgment)"
      },
      {
        "japanese": "こちらのお店のメニューには、人を引き付けるものがある。",
        "english": "I feel strongly that this restaurant's menu will bring in people."
      },
      {
        "japanese": "君の俳句にはなんとも言えないものがある。",
        "english": "(I feel strongly that) there is something about your haiku that words cannot describe."
      },
      {
        "japanese": "彼の遺した言葉には考えさせられるものがあった。",
        "english": "I felt strongly that his last words were inspiring."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ものがある",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-732"
  }
}