{
  "grammar_point": "も又",
  "rank": 6,
  "bunpro": {
    "grammar_point": "も又",
    "jlpt": "N2",
    "meaning": "Too, Also (with more emphasis than も alone), Again",
    "meaning_warning": "Can also mean \"even\"",
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "When used adverbially, the grouping of も and又'once again', or 'also' will indicate that 'in addition to (A), (B)', or 'also with (A), (B)'. This structure appears after nouns, or noun-like phrases and simply emphasizes that something important needs to be considered about (A).The noun or noun-phrase thatもまたis connected to will be interpreted to be the primary point of a statement, regardless of any contrasting opinion that is given within a sentence. Additionally,もまたwill primarily appear in hiragana, and may be thought of simply as a stronger version of も.",
    "examples": [
      {
        "japanese": "高橋さんが提案したアイディアはいいのですが田中さんが提案したことを実行するのも又、いい考えだと思います。",
        "english": "The idea suggested by Takahashi-san is good, but I also think it's a good idea to implement what Tanaka-san suggested."
      },
      {
        "japanese": "カレーは甘くても美味しいけど、辛いのもまた美味しいんだよ。",
        "english": "Curry is good even if it's sweet, but spicy curry is also good."
      },
      {
        "japanese": "先生になるには知識がたくさん必要です。ですが、経験が必要なのも又確かだ。",
        "english": "Being a teacher requires a lot of knowledge. However, experience is also necessary."
      },
      {
        "japanese": "明日もまた同じ時間にここにきてね！",
        "english": "Please come here again at the same time tomorrow!"
      },
      {
        "japanese": "子育てについての論文：「可愛い子に旅をさせてみること、それも又大切なことです。」",
        "english": "Essay/article about parenting: 'Sending your beloved children out into the world, that is also important.'"
      },
      {
        "japanese": "論文：「改革に対して民衆の支持が多かったのは嘘ではない。しかし、反対する者が少なくなかったのも又、真実である。」",
        "english": "Essay/article: 'It is no lie that there was a lot of public support for the reform. However, it is also true that there were quite a few against it.'"
      },
      {
        "japanese": "友達との話：「海外旅行はカッコいいよ。けど田舎に行くのも又いいね。」",
        "english": "Chat between friends: 'Going abroad is cool. But going to the countryside is also nice, right?'"
      },
      {
        "japanese": "論文：「狐や犬だけではなく、イルカも又哺乳類に分類される。」",
        "english": "Essay/article: 'Not just dogs and foxes, but dolphins are also classified as mammals.'"
      },
      {
        "japanese": "チームのキャプテン：「今日も又頑張ろう！」",
        "english": "Team captain: 'Let's do our best today again!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/も又",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-745"
  }
}