{
  "grammar_point": "やる (send)",
  "rank": 7,
  "bunpro": {
    "grammar_point": "〜てやる",
    "jlpt": "N1",
    "meaning": "Just wait and see, Just you wait, To do a favor, For you, Definitely, For sure",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "The う-Verb やる, occasionally seen in the kanji form遣る, primarily means ‘to do’, but can also mean ‘to give’ as the casual form of あげる. When attached to the て-form of verbs, it acts as asubsidiary verb. When substituting for あげる, it will often sound patronizing, or that the speaker is doing an action because it is unavoidable, and the person they are doing it for cannot do it themselves. This will be translated as ‘to do for’.In other cases, やる acts more like見せる ‘to show’, and indicates the speaker’s strong will to perform an action. In these cases, it will be translated as ‘I will do (A), just wait and see’, or ‘I’ll definitely do (A)’.However, in either the place of あげる or みせる, the underlying meaning is just ‘to do’, with emphasis on the doer being the person that is in power over the result of the action due to their superiority.",
    "examples": [
      {
        "japanese": "いいよいいよ、俺がやってやるからお前は見とけ。",
        "english": "Don’t worry about it, I’ll do it for you, so just watch."
      },
      {
        "japanese": "今夜は俺が奢ってやるから、どんどん好きなもん頼めばいいからな。",
        "english": "I’m going to pay for you, so don’t hesitate and order whatever you want."
      },
      {
        "japanese": "絶対奇麗になって見返してやる！",
        "english": "I am going to become pretty and prove them wrong, just wait!"
      },
      {
        "japanese": "こうなったら勝ってやるしかないだろ。",
        "english": "Well, in a situation like this there is no other choice but to win!"
      },
      {
        "japanese": "アクション映画のマッチョな主人公：「ぶっころしてやる！」",
        "english": "The macho protagonist in an action movie: 'I'm gonna kill you!'"
      },
      {
        "japanese": "お金がなくて行きたい大学に行けないという状況：「金持ちになってやる！」",
        "english": "The situation of not being able to go to the school one wants to, due to money problems: 'I will get rich, just you wait!'"
      },
      {
        "japanese": "低得点で馬鹿にされた後：「絶対、次のテストでは100点取って、あいつをみかえしてやる。」",
        "english": "After being ridiculed for a low score: 'I will definitely score 100 on the next test and prove I'm better than that dude, just you wait!'"
      },
      {
        "japanese": "「絶対、合格してやる！」",
        "english": "'I will surely pass, just wait and see!'"
      },
      {
        "japanese": "A子：「こっちからあっちまで競走しよ！」 B子：「いいよ、かってやる!」",
        "english": "Child A: 'Let's race from here to there!' Child B: 'Okay! I'll win!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/てやる",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-376"
  },
  "dojg": {
    "grammar_point": "やる①",
    "description": "To cause something/someone to move to a place or to do/eat/drink something.",
    "meaning": "Send; give; do; play; operate; eat; drink",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "584",
    "examples": [
      {
        "japanese": "(ksa).貧乏な家庭は子共を大学にやれない。",
        "english": "Poor  families cannot send their children to college."
      },
      {
        "japanese": "(ksb).僕は弟に自転車をやるつもりだ。",
        "english": "I  intend to give a bike to my younger brother."
      },
      {
        "japanese": "(ksc).午後、テニスをやりませんか。",
        "english": "Won't  you play tennis this afternoon?"
      },
      {
        "japanese": "(ksd).今アメリカで日本語の教師をやっています。",
        "english": "I'm  now (literally: doing) a Japanese instructor in the U.S."
      },
      {
        "japanese": "(kse).三船敏郎のやる役は正義感の強い男だ。",
        "english": "The  role played by Toshiro Mifune is a male with a strong sense of justice."
      },
      {
        "japanese": "(ksf).先月まで煙草をやっていました。",
        "english": "I  was smoking up until last month."
      },
      {
        "japanese": "(a).息子を郵便局にやって、切手を買って来させた。",
        "english": "I  sent my son to the post office and had him buy stamps."
      },
      {
        "japanese": "(b).猫にこのえさをやってね。",
        "english": "Give  this food to the cat, OK?"
      },
      {
        "japanese": "(c).宿題をやりましたか。",
        "english": "Did  you do your homework?"
      },
      {
        "japanese": "(d).チェスをやろうか。",
        "english": "Shall  we play chess?"
      },
      {
        "japanese": "(e).来月クラス会をやります。",
        "english": "We  will have (literally: do) a class reunion next month."
      },
      {
        "japanese": "(f).ちょっと遅れるから、先に(食事を)やっていて下さい。",
        "english": "I'm  coming in a bit late, so please start eating without me."
      },
      {
        "japanese": "(g).私は酒も煙草もやりません。",
        "english": "I  neither drink nor smoke."
      },
      {
        "japanese": "(h).私は去年から生け花をやっています。",
        "english": "I  have been learning flower arrangement since last year."
      },
      {
        "japanese": "(i).僕は小さい時色々な病気をやりました。",
        "english": "When  I was a kid I suffered from various diseases"
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)someone が someone を place\n- にやる\n- 私が息子を外国にやる。\n- I will send my son to a foreign country\n- (ii)someone が someone に something\n- をやる\n- 僕が妹に人形をやる。\n- I will give my younger sister a doll\n- (iii)someone が something\n- をやる\n- 友達が弁護士をやる。\n- My friend is (literally doing) a lawyer",
    "part_of_speech": "Verb (Group 1)",
    "related": "【Related Expression: する】",
    "antonym": "",
    "source": "resources/original/dojg/all/やる①.yaml"
  }
}