{
  "grammar_point": "ようが〜まいが",
  "rank": 8,
  "bunpro": {
    "grammar_point": "ようが〜まいが",
    "jlpt": "N1",
    "meaning": "Even if, No matter what, Whether or not, [Emphatic], Volitional+が",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "When both the positive and negative volitionalauxiliary verbsare combined with a verb in Japanese, it has the nuance of 'whether or not (A)', the result will be (B)'. This is quite emphatic, and has a literal meaning similar to 'say it does (A) or say it doesn't (A), it will still be (B)'.As a reminder, the positiveauxiliary verbsof volition are either う or よう, depending on what they are being connected to, while the negativeauxiliary verbof volition is まい. Either thecase marking particleが or と will appear after both the positive and the negative, with が being slightly more common.While this structure is primarily seen after verbs, it is important to remember that otherauxiliary verbssuch as だ can be conjugated in the same way, as can い-Adjectives with the less common かろう structure. This means that both nouns, な-Adjectives and い-Adjectives can also appear using a similar grammar pattern. However, because the negative volitional まい cannot pair with these structures, an antonym will usually appear with them instead, with both words using the う or よう positive volitional.Based primarily on the use of volitionals, this grammar pattern will often indicate the speaker's strong will or opinion that will not change regardless of (A).",
    "examples": [
      {
        "japanese": "忘年会に出席しようが出席するまいが、会費はみんなからもらっています。",
        "english": "Whether you attend the year-end party or not, we will collect the admissions fee from everyone."
      },
      {
        "japanese": "雨が降ろうが降るまいが、明日は絶対に釣りに行くと決めた。",
        "english": "Whether it rains or not, I have decided to go fishing tomorrow."
      },
      {
        "japanese": "楽しかろうが楽しくなかろうが、学校は子供の仕事だから学校には行かなくてはだめだ。",
        "english": "Whether it is fun or not, school is a child's job, so you must go to school."
      },
      {
        "japanese": "安全だろうが安全でなかろうが、２メートル以上の場所に上がる場合は安全帯を必ず装着してください。",
        "english": "Whether it is safe or not, always wear a safety belt when you climb to a place higher than 2 meters."
      },
      {
        "japanese": "犬であろうが猫であろうが、どちらにしても動物なので軽い気持ちで買っては行けない。",
        "english": "Whether it is a dog or a cat, they are both animals, so they must not be bought on a whim."
      },
      {
        "japanese": "人が何と言おうが、ずっとあなたを愛しています！",
        "english": "No matter what people say, I will always love you!"
      },
      {
        "japanese": "生徒が授業に出席しようが出席するまいが、私はきちんと授業を進めていく。",
        "english": "Whether or not students attend, I will proceed with my lecture as planned."
      },
      {
        "japanese": "何年がかかろうと、ドラゴンボールを見つけるつもりだ！",
        "english": "Even if it takes many years, I intend to find the dragon balls!"
      },
      {
        "japanese": "商品は上質であろうが悪質であろうが、よく売れるものはよく売れる。",
        "english": "Whether the product is of good quality or low quality, if it sells well, it sells well."
      },
      {
        "japanese": "日本語の勉強が難しかろうが易しかろうが、流暢に話せるようになるまで勉強する。",
        "english": "Whether learning Japanese is difficult or easy, I will learn until I become fluent."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/-よう--う-まい - が-と",
    "false_friends": [
      {
        "term": "〜ても〜なくても",
        "meaning": "Whether ~ or not",
        "kind": "synonym"
      },
      {
        "term": "てでも",
        "meaning": "Even if I have to, By any or all means, No matter what",
        "kind": "synonym"
      },
      {
        "term": "とも",
        "meaning": "Even if, No matter",
        "kind": "synonym"
      },
      {
        "term": "ても",
        "meaning": "Even if, Even though",
        "kind": "synonym"
      },
      {
        "term": "たって",
        "meaning": "Even if, Even though, No matter how",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-4"
  }
}