{
  "grammar_point": "ように (so that)",
  "rank": 1,
  "bunpro": {
    "grammar_point": "ように",
    "jlpt": "N4",
    "meaning": "So that, In order to, In such a way that",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When partnered with verbs in thepotentialform, or in the negative form, theauxiliary verbようだ(in its adverbial formように) implies that the speaker has a lack of direct control over an outcome, and therefore is 'trying to do (B) in the manner of (A)', but cannot guarantee the result. This grammar point is usually translated as 'to do (A) in such a way that will enable (B)', or 'in order to allow (B)'.To useようにin this way, simply add it to the non-past form of any verb in its negative,potential, or standard conjugation.As mentioned in our lesson aboutpotentialverbs,するdoes not actually have apotentialform, and thereforeできるwill be used instead.",
    "examples": [
      {
        "japanese": "お母さんから離れないように手をつなぐ。",
        "english": "I hold my mothers hands so that I won't get separated from her."
      },
      {
        "japanese": "泥棒が入れないように家のカギを閉める。",
        "english": "I lock my house, so that burglars can't come in."
      },
      {
        "japanese": "マイケルジャクソンみたいに踊れるように毎日ダンスの練習をする。",
        "english": "I practice dancing everyday, so that I can dance like Michael Jackson."
      },
      {
        "japanese": "日本語をペラペラに話せるように毎日近所の人と日本語で話をしている。",
        "english": "I speak Japanese with my neighbor everyday, so that I can speak Japanese fluently."
      },
      {
        "japanese": "勉強ができるように机の上を掃除した。",
        "english": "I tidied up my desk so that I could study."
      },
      {
        "japanese": "平日にスキーが出来るように仕事を休んだ。",
        "english": "I took the day off of work, in order to be able to ski on a weekday."
      },
      {
        "japanese": "例えば風邪を引かないように、暖かい服装をする。",
        "english": "For example, I wear warm clothes so that I won't catch a cold."
      },
      {
        "japanese": "目が悪いので、字幕が見えるように椅子をテレビに近づけた。",
        "english": "Because I have bad eyes, I moved the chair closer to the TV so that I can see the subtitles."
      },
      {
        "japanese": "子供がナイフなどに近づかないようにキッチンキャビネットを閉める必要がある。",
        "english": "It is necessary to close the kitchen cabinets so that children won't get near knives and the like."
      },
      {
        "japanese": "彼が理解出来るように説明しようと思っている。",
        "english": "I plan to explain it in such a way that he will be able to understand."
      },
      {
        "japanese": "大事なことを忘れないようにいつもメモをしている。",
        "english": "I always take notes so that I won't forget important things."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ように",
    "false_friends": [
      {
        "term": "如何",
        "meaning": "Depending on",
        "kind": "synonym"
      },
      {
        "term": "ようにいう",
        "meaning": "To tell, request, or order to do (in such a way)",
        "kind": "synonym"
      },
      {
        "term": "ように〜てほしい",
        "meaning": "Want ~ to ~ like ~, Want ~ to be able to ~, Want ~ to ~ in the way of ~",
        "kind": "synonym"
      },
      {
        "term": "ようになる",
        "meaning": "To reach the point that, To come to be that, To turn into",
        "kind": "synonym"
      },
      {
        "term": "ようにいのる",
        "meaning": "Pray that/for, Hope that/for, Keep fingers crossed that",
        "kind": "synonym"
      },
      {
        "term": "ようにする",
        "meaning": "To try to, To make sure to, To endeavor to",
        "kind": "synonym"
      },
      {
        "term": "れる・られる+ままに",
        "meaning": "Do as (one is told or ordered…), In accordance with, In compliance with, Just like",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-762"
  },
  "dojg": {
    "grammar_point": "ように①",
    "description": "Do something in such a way that ~.",
    "meaning": "So that",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "553",
    "examples": [
      {
        "japanese": "(ksa).読めるように字を奇麗に書いて下さい。",
        "english": "Please write it neatly so that I can read it."
      },
      {
        "japanese": "(ksb).風邪を引かないように気をつけている・います。",
        "english": "I'm taking care of myself so that I don't catch a cold."
      },
      {
        "japanese": "(a).僕が分かるようにスミスさんはゆっくり英語を話してくれた。",
        "english": "Mr. Smith spoke English slowly so that I could understand him."
      },
      {
        "japanese": "(b).遅れないようにタクシーで行きました。",
        "english": "I went there by taxi so that I wouldn't be late."
      },
      {
        "japanese": "(c).病気が治るように薬を飲んだ。",
        "english": "I took medicine so that I would recover from illness."
      },
      {
        "japanese": "(d).子供が本を読むように面白そうな本を買って来た。",
        "english": "I bought some interesting-looking books so that my child would read books."
      }
    ],
    "writeup": "## 1. Although ように1 can be used with almost any informal nonpast verb, it is most commonly used with potential verb forms (as in Key Sentence(A) and Example (a)) and negative verb forms (as in Key Sentence (B) and Example (b)).",
    "formation": "## \n\n- Vinformal nonpast\n- {potential/ negative}ように\n- {話せる/話さない}ように\n- So that someone can talk/does not talk\n- {食べられる/食べない}ように\n- So that someone can eat/does not eat",
    "part_of_speech": "Conjunction",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/ように①.yaml"
  }
}