{
  "grammar_point": "ようがない・ようもない",
  "rank": 6,
  "bunpro": {
    "grammar_point": "ようがない・ようもない",
    "jlpt": "N2",
    "meaning": "There's no way to, It's impossible to",
    "meaning_warning": "This is not Verb[volitional]",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "様がないor様もないis an expression used to highlight that there is no 'method' or 'manner' in which to do (A). It can be interpreted as 'there is no way to (A)', or 'it's impossible to (A)'.This phrase will appear attached to theconjunctive formof verbs.様がないoften focuses on that the action of (A) is not possible, despite that the speaker may actually want to do it.Caution - Because様will often appear in hiragana, it is important not to get it mixed up with よう, theauxiliary verbused to create the volitional form of verbs such as する.",
    "examples": [
      {
        "japanese": "車も自転車も壊れているので買い物に行きようがない。",
        "english": "Because my car and bicycle are broken, there is no way for me to go shopping."
      },
      {
        "japanese": "パソコンが車にひかれて粉々になったため直しようがない。",
        "english": "It's impossible to fix my computer because it was run over by a car and smashed to pieces."
      },
      {
        "japanese": "電話番号もメールアドレスも分からないので、連絡のしようがありません。",
        "english": "I have no way to contact them because I don't know their phone number nor their email address."
      },
      {
        "japanese": "何とも言いようがない味だ。",
        "english": "There is no way to put this taste/flavor into words."
      },
      {
        "japanese": "弁解のしようがない。",
        "english": "It is impossible to explain."
      },
      {
        "japanese": "これはどうにもしようがない。",
        "english": "There is no way to do this."
      },
      {
        "japanese": "彼は速すぎて追い越しようがない。",
        "english": "He is too fast, there is no way to overtake him."
      },
      {
        "japanese": "そんな無理な要求をされても、応じようがない。",
        "english": "Even if such an impossible demand is made, it is impossible to comply."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ようがない・ようもない",
    "false_friends": [
      {
        "term": "がたい",
        "meaning": "Hard to, Difficult to",
        "kind": "synonym"
      },
      {
        "term": "っこない",
        "meaning": "There is no chance of, There is no way of, Impossible",
        "kind": "synonym"
      },
      {
        "term": "はずがない",
        "meaning": "Hardly possible, Cannot be, Highly unlikely, Improbable",
        "kind": "synonym"
      },
      {
        "term": "わけがない",
        "meaning": "There is no way, There is no reason, It is impossible, Cannot be",
        "kind": "synonym"
      },
      {
        "term": "そうもない",
        "meaning": "Very unlikely to, Does not seem that, Does not appear that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-756"
  }
}