{
  "grammar_point": "ようにも(〜ない)",
  "rank": 10,
  "dojg": {
    "grammar_point": "ようにも(〜ない)",
    "description": "A conjunctive phrase that indicates concession: “even though someone tries to do something, he/she cannot do it for some reason”.",
    "meaning": "Even though ~ try/want to ~; even though ~ be thinking of doing ~; although ~ try/want to ~; although ~ be thinking of doing ~",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "730",
    "examples": [
      {
        "japanese": "(ksa).徹に連絡しようにも電話番号もメールアドレスも知らない。",
        "english": "Even though I want to contact Toru, I don't  know either her phone number or her e-mail address."
      },
      {
        "japanese": "(ksb).ひどく頭が痛くて起きようにも起きられない。",
        "english": "I have a terrible headache, and I cannot get up even though I  want to."
      },
      {
        "japanese": "(a).記事を書こうにも書く材料がない。",
        "english": "Even though I'm thinking of writing an article, I have nothing  to write about."
      },
      {
        "japanese": "(b).寿司を作ろうにも材料が手に入られない。",
        "english": "Even though I want to make sushi, I cannot get the ingredients (literally:  materials)."
      },
      {
        "japanese": "(c).苦情を言おうにも誰に言っていいか分からなかった。",
        "english": "Although I wanted to complain, I didn't know who to complain  to."
      },
      {
        "japanese": "(d).体を動かそうにもあちこち痛くて腕も上げられない。",
        "english": "Although I'm trying to move my body, every part aches and I  can't even lift my arms."
      },
      {
        "japanese": "(e).母は僕の日本人のガールフレンドと話しそうにも日本語ができなかった。",
        "english": "Even though my mother wanted to talk with my Japanese  girlfriend, my mother (couldn't because she) can't speak Japanese."
      },
      {
        "japanese": "(f).気の毒に彼女は悩み事を相談しようにも相談できる人が近くにいない。",
        "english": "It's sad that even though she wants to talk  to someone about her troubles, she has no one to talk to near her."
      },
      {
        "japanese": "(g).カウンセリングに行こうにも、その質や学派も様々でついつい懐疑的になってしまいます。",
        "english": "Although I am thinking of going for counselling, the variation  in quality and schools of thought makes me sceptical."
      },
      {
        "japanese": "(h).その本は買おうにも絶版だった。",
        "english": "Although I wanted to buy the book, it was out of print."
      },
      {
        "japanese": "(i).携帯電話の電池が切れたので、電話をかけようにもかけられない。",
        "english": "Because my cell phone battery is dead, I cannot make a call  even though I want to."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Vvolitional\n- にも(〜ない)\n- 話そうにも(〜ない)\n- (not) even though someone tries to talk\n- 教えようにも(〜ない)\n- (not) even though someone tries to teach",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: ようたって; にも; たくても(~ない); たくとも(~ない)】",
    "antonym": "",
    "source": "resources/original/dojg/all/ようにも(～ない).yaml"
  }
}