{
  "grammar_point": "ように〜てほしい",
  "rank": 2,
  "bunpro": {
    "grammar_point": "ように〜てほしい",
    "jlpt": "N4",
    "meaning": "Want ~ to ~ like ~, Want ~ to be able to ~, Want ~ to ~ in the way of ~",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "(A)ように〜てほしいis an expression in Japanese which combines theauxiliary verb,ようだ, with theてほしいstructure (indicating that you/someone else wants someone to do something). Asようだis being linked to a verb which comes later in the sentence, it will take on the adverbial formように.This expression is used to highlight that you (or someone else) want someone to do something 'in the way of (A)'.Note that whenようにfollows a noun,のwill be required.Eitherにorがmay mark the thing that the speaker 'wants' to do. It is more common forにto be used to mark people, whileがwill often mark events/objects.Fun FactSometimesがandにwill be switched, if either of those particles have already been used somewhere else in a sentence. This is mainly to avoid sounding repetitive, or confusion about what the subject of the sentence is.",
    "examples": [
      {
        "japanese": "弁護士になれるように頑張ってほしい。",
        "english": "I want you to work your hardest, so that you can become a lawyer."
      },
      {
        "japanese": "このチームが大会で勝てるようになってほしい。",
        "english": "I want this team to be able to win a tournament."
      },
      {
        "japanese": "お前にはスポーツ選手のように走ってほしい。",
        "english": "I want you to run like an athlete."
      },
      {
        "japanese": "もっとアナウンサーのように話してほしい。",
        "english": "I want you to talk more like an announcer."
      },
      {
        "japanese": "あなたに漢字を書けるようになってほしい。",
        "english": "I want you to be able to write kanji."
      },
      {
        "japanese": "事故が無くなるように運転をしてほしい。",
        "english": "I want people to drive in a way that will reduce accidents."
      },
      {
        "japanese": "トムに友達ができるようになってほしい。",
        "english": "I want Tom to be able to make some friends."
      },
      {
        "japanese": "私たちの子供には君のようになって欲しい。",
        "english": "I want our children to become like you."
      },
      {
        "japanese": "この電車にも新幹線のように早く走って欲しいです。",
        "english": "I want this train to run fast like a bullet train."
      },
      {
        "japanese": "赤ちゃんの前でも大人のように喋って欲しい。",
        "english": "I want (you) to talk like an adult even in front of my baby."
      },
      {
        "japanese": "頭がよくなるように勉強して欲しい。",
        "english": "I want (you) to study in a way that allows you to become smart."
      },
      {
        "japanese": "ウサインボルトのように走って欲しい。",
        "english": "I want (you) to run like Usain Bolt."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/ように-てほしい",
    "false_friends": [
      {
        "term": "がほしい",
        "meaning": "To want something, To be in need of",
        "kind": "synonym"
      },
      {
        "term": "てほしい",
        "meaning": "I want you to",
        "kind": "synonym"
      },
      {
        "term": "ように・ような",
        "meaning": "As・like, Just like",
        "kind": "synonym"
      },
      {
        "term": "ようにする",
        "meaning": "To try to, To make sure to, To endeavor to",
        "kind": "synonym"
      },
      {
        "term": "ようにいう",
        "meaning": "To tell, request, or order to do (in such a way)",
        "kind": "synonym"
      },
      {
        "term": "ように",
        "meaning": "So that, In order to, In such a way that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-763"
  }
}