{
  "grammar_point": "られる (passive)",
  "rank": 1,
  "bunpro": {
    "grammar_point": "Causative-Passive",
    "jlpt": "N4",
    "meaning": "Verbs (Causative-passive voice), To be made to do something, To be forced to do",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When theauxiliary verbせる(orさせる) 'to make/let do' is combined with theauxiliary verbられる'to be the receiver of', it creates the causative-passive form of verbs in Japanese. These sentences will be from the perspective of the person who has 'been made to do' something, and are very often negative (against the will of the speaker).First, verbs must be conjugated in the same way that they would be withせる, orさせる. After that simply remove the る, and then addられる. This will create the verb formさせられる(linked withる-Verbs), orせられる(linked withう-Verbs).As with the causative form,するand来るhave special conjugation rules.するwill be replaced completely byさせられる, while来るwill become来させられる.CautionUnlike with causative verbs, where the actual doer of a sentence (marked withが) is considered to be the person who 'caused' the action,られるreverses the perspective. This makes the doer (marked withが) the person who is being 'forced' to do something. When the person that is 'causing' the action appears in a causative-passive sentence, they will be marked withに.Cautionれるmay not be used in place ofられるin causative-passive sentences. This is becauseせるandさせるboth have せ (an え sound kana) at the point where they will connect withられる. This is a rule for all verbs with an え sound kana at their conjugation point (excluding the 'potential' use ofれるandられる).",
    "examples": [
      {
        "japanese": "おばあちゃんの家に行くとお腹がいっぱいでもいっぱい食べさせられる。",
        "english": "When I go to my grandma's house, she makes me eat a lot, even if I am full."
      },
      {
        "japanese": "そんな事させられるとは思わなかった。",
        "english": "I didn't think that I would be forced to do something like that."
      },
      {
        "japanese": "先輩に色んなお酒を飲ませられたから頭が痛い。",
        "english": "Because my senpai made me drink all sorts of alcohol, my head hurts."
      },
      {
        "japanese": "友達に冷たい水を浴びさせられるのが嫌いだ。",
        "english": "I don't like it when my friend douses me with cold water."
      },
      {
        "japanese": "上司に力仕事をさせられる。",
        "english": "My boss forces me to do physical labor."
      },
      {
        "japanese": "友達に知らないバンドのコンサートに連れてこさせられる。",
        "english": "My friend forced me to go to the concert of a band that I do not know."
      },
      {
        "japanese": "子供の頃は兄が勉強をさせられていた。",
        "english": "When we were still kids, my older brother was forced to study."
      },
      {
        "japanese": "子供の頃は兄に勉強をさせられていた。",
        "english": "When we were still children, my older brother forced me to study."
      },
      {
        "japanese": "お腹がいっぱいなのに、ケーキを食べさせられた。",
        "english": "I was forced to eat the cake even though I was full."
      },
      {
        "japanese": "私は兄に宿題をさせられた。",
        "english": "I was forced to do homework by my older brother."
      },
      {
        "japanese": "どんなことをさせられたの?",
        "english": "What kind of things were you forced to do?"
      },
      {
        "japanese": "嫌なことをさせられた。",
        "english": "I was made to do awful things."
      },
      {
        "japanese": "あまり見たくない動画を見させられたのです。",
        "english": "I was forced to watch a video I didn't really want to watch."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/causative-passive",
    "false_friends": [
      {
        "term": "Verb[れる・られる]",
        "meaning": "Was done to ~ by ~, Done without consent, Done to one's dismay",
        "kind": "synonym"
      },
      {
        "term": "Verb[せる・させる]",
        "meaning": "To make/let/have (somebody do something)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-14"
  },
  "dojg": {
    "grammar_point": "られる①",
    "description": "A state or an action cannot be controlled by someone or something.",
    "meaning": "Be –ed; get –ed",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "364",
    "examples": [
      {
        "japanese": "(ksa).一郎は花子に騙された・騙されました。",
        "english": "Ichiro was deceived by Hanako."
      },
      {
        "japanese": "(ksb).ジェーンはフレッドに夜遅くアパートに来られた・来られました。",
        "english": "Fred came to Jane's apartment late at night (and Jane was unhappy)."
      },
      {
        "japanese": "(ksc).私は弟にケーキを食べられた・食べられました。",
        "english": "I got my cake eaten by my younger brother. / My younger brother ate my cake (and I was unhappy)."
      },
      {
        "japanese": "(ksd).田中先生は日本へ帰られた・帰られました。",
        "english": "Professor Tanaka went back to Japan (honorific)."
      },
      {
        "japanese": "(a).このビルは二年前に建てられた。",
        "english": "This building was built two years ago."
      },
      {
        "japanese": "(b).この本は１９６５年にアメリカで出版された。",
        "english": "This book was published in America in 1965."
      },
      {
        "japanese": "(c).私は二年前妻に死なれた。",
        "english": "My wife died two years ago (and gave me sorrow)."
      },
      {
        "japanese": "(d).原田さんは奥さんに高いコートを買われた。",
        "english": "Mr. Harada's wife bought an expensive coat (and he is unhappy)."
      },
      {
        "japanese": "(e).林先生は日本の大学のことを話された。",
        "english": "Professor Hayashi talked about Japanese universities (honorific)."
      }
    ],
    "writeup": "## 1.There are two types of passive sentences in Japanese. One can be called \"direct passive\" and the other, \"indirect passive\". The direct passive is similar to the English passive. (Key Sentence (A), Examples (a) and (b)) That is, for every passive sentence, there is a corresponding active sentence. For example, the active version of Key Senence(A) is (1).\n\n- 話される\n- nonpast informal affirmative\n- 話されない\n- nonpast informal negative\n- 話されて\n- て form\n- 話された\n- past informal affirmative",
    "formation": "## \n\n- (i)Group 1 verbs\n- Vnegれる\n- 話される\n- Be told\n- (ii)Group 2 verbs\n- Vstemられる\n- 食べられる\n- Be eaten\n- (iii)Irregular verbs\n- 来る→来られる\n- Someone (X) comes to someone (Y) and Y is unhappy\n- する→される\n- Be done",
    "part_of_speech": "Auxiliary Verb (Group 2)",
    "related": "【Related Expression: お~になる; られる2】",
    "antonym": "",
    "source": "resources/original/dojg/all/られる①.yaml"
  }
}