{
  "grammar_point": "わけがない",
  "rank": 5,
  "bunpro": {
    "grammar_point": "わけがない",
    "jlpt": "N3",
    "meaning": "There is no way, There is no reason, It is impossible, Cannot be",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "One of the strongest ways to use thenounわけ in Japanese, is in the expressionわけがない. This is regularly translated as 'there is no way that (A)', or 'it is impossible that (A)'. However, as mentioned in other わけ lessons, わけ is used very similarly to 'so' in English, so may also be thought of as 'it is SO not (A)', with 'so' being used for emphasis. In this structure, わけ is combined with thecase marking particleが, and theい-Adjectiveない.わけがないmay be used with verbs, or adjectives in theirattributive form.CautionCompared to わけではない,わけがないis much stronger, and emphasizes the 'non-existence' of something. This can be thought of as similar to the difference between 'it is so that it isn't (A)' (for わけではない), and 'it is SO not (A)' (forわけがない).'It is so that it isn't (A)' highlights that (A) is a thing that exists, but not in the way of (A). On the other hand, 'it is SO not (A)' highlights that no part of (A) whatsoever can be considered to be correct/accurate.",
    "examples": [
      {
        "japanese": "このステーキ2キロもあるの?！こんなの一人で食べれるわけがない！",
        "english": "This steak weighs 2kg?! I SO can't eat something like this alone!"
      },
      {
        "japanese": "キムラシェフが作ったパスタだよ、不味い訳がないじゃん！",
        "english": "This pasta is made by Chef Kimura, there is no way this would taste bad!"
      },
      {
        "japanese": "このアパートは線路の隣にあるから静かなわけがない。",
        "english": "This apartment is next to the train track, so there is no way it is quiet."
      },
      {
        "japanese": "彼はいつも遊んでいるが、暇なわけではない。",
        "english": "He is always going out, but it is not necessarily so that he has a lot of free time."
      },
      {
        "japanese": "彼はいつも仕事をしているから、暇なわけがない。",
        "english": "Since he is always working, he SO does not have any free time."
      },
      {
        "japanese": "日本人ならそんなことを言うわけがない。",
        "english": "There is no way that a Japanese person would say that."
      },
      {
        "japanese": "手を繋いでいるので、子供が勝手にどこかに行くわけがない。",
        "english": "I am holding my kid's hand, so there is no way that he would just run off somewhere."
      },
      {
        "japanese": "日本にいるだけで、日本語を学べるわけがない。",
        "english": "There is no way you can learn Japanese from just being in Japan."
      },
      {
        "japanese": "あれだけ着込んだら寒いわけがない。",
        "english": "There is no reason why you would feel cold, wearing all those extra clothes."
      },
      {
        "japanese": "彼が嘘をつくわけがない。",
        "english": "There is no way he would lie."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/わけがない",
    "false_friends": [
      {
        "term": "ことはない",
        "meaning": "There is no need to, Never happens",
        "kind": "synonym"
      },
      {
        "term": "はずがない",
        "meaning": "Hardly possible, Cannot be, Highly unlikely, Improbable",
        "kind": "synonym"
      },
      {
        "term": "わけではない",
        "meaning": "It doesn't mean that, It is not the case, It's not like",
        "kind": "synonym"
      },
      {
        "term": "ようがない・ようもない",
        "meaning": "There's no way to, It's impossible to",
        "kind": "synonym"
      },
      {
        "term": "そうもない",
        "meaning": "Very unlikely to, Does not seem that, Does not appear that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-786"
  },
  "dojg": {
    "grammar_point": "わけがない",
    "description": "A phrase which negates the existence of a reason to believe that someone does something or is in some state, or that something takes place; or which negates a possibility of someone's doing something or being in some state, or something's taking place.",
    "meaning": "There is no reason why ~; it is impossible (for ~) to ~; cannot",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "578",
    "examples": [
      {
        "japanese": "(ksa).こんな易しい仕事が君に出来ないわけがない。",
        "english": "There  is no reason why you cannot do such an easy job."
      },
      {
        "japanese": "(ksb).日本語がそんなに速くマスター出来るわけがない。",
        "english": "It  is impossible to be able to master Japanese that quickly."
      },
      {
        "japanese": "(a).そんなことをしていいわけがない。",
        "english": "No  one is allowed to do that kind of thing. (literally: There is no reason why it  is all right to do such a thing.)"
      },
      {
        "japanese": "(b).そんなことを言って人が喜ぶわけがない。",
        "english": "There  is no reason for people to be pleased if you say such a thing to them."
      },
      {
        "japanese": "(c).彼女がそんなひどいことを言うわけがない。",
        "english": "There  is no reason for her to say such a terrible thing. / It is impossible for her  to say such a terrible thing."
      },
      {
        "japanese": "(d).彼はあんなに酔っていて大丈夫なわけがない。",
        "english": "Being  that drunk, he cannot be all right."
      },
      {
        "japanese": "(e).あの店の物がこんなに安いわけがない。",
        "english": "Things  at that shop cannot be this cheap."
      },
      {
        "japanese": "(f).彼女がこの時間にこんな所にいるわけがない。",
        "english": "It  is impossible for her to be in such a place at this time (of the day)."
      },
      {
        "japanese": "(g).彼がこの学校の卒業生であるわけがない。",
        "english": "It  is impossible for him to be a graduate of this school."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjective い}informal nonpast\n- わけがない\n- 分かるわけがない\n- It is impossible to understand\n- 面白いわけがない\n- It is impossible for something to be interesting\n- (ii){Adjective な} stem\n- なわけがない\n- 奇麗なわけがない\n- It is impossible to something to be clean\n- (iii)Noun\n- であるわけがない\n- 先生であるわけがない\n- It is impossible for someone to be a teacher",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: はずがない】",
    "antonym": "",
    "source": "resources/original/dojg/all/わけがない.yaml"
  }
}