{
  "grammar_point": "わ〜わ",
  "rank": 9,
  "bunpro": {
    "grammar_point": "わ〜わ",
    "jlpt": "N1",
    "meaning": "~and ~and, Keep ~ing, One after another, So much, So many, One after another",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "わis anadverbial particlethat is commonly used in cases of stress of emphasis in Japanese. When appearing after thedictionary formof a verb that is being repeated, it highlights a large amount, something happening successively, or more and more. It will often be translated as 'more and more (A)', '(A) keeps on happening', or 'so much (A)'.わ〜わmay be used either positively or negatively.To use this structure, simply placeわafter the verb, and then repeat the same verb with a secondわ.わ〜わprimarily emphasizes the speaker's surprise in regard to the amount or extent of (A). This structure is predominantly used by men, but it may also sometimes be used by women. However, there are several different variations of わ depending on where they appear in sentences, each of which have gender usage tendencies that will need to be learned.In many cases where a する verb is being used withわ〜わ, the second instance of the action will be omitted, with する appearing by itself. For example, instead of勉強するわ勉強するわ,勉強するわするわwould be used.Fun Factわis simply an emphatic version of the usual はadverbial particle, and originates from は being changed toわ. Due to this, the literal meaning can be thought of as a stronger version of the standard 'as for (A)' meaning of は. This would come across something like 'as for (A), it did (A)', with the repetition itself adding to the emphasis.",
    "examples": [
      {
        "japanese": "もう、昨日子供達が喧嘩して泣くわ泣くわで大変だったんだから。",
        "english": "Oh my god, it was so hectic yesterday because the kids got into a fight and cried so much."
      },
      {
        "japanese": "空き家を買ったのはいいけど、家中にはゴキブリがいるわいるわ。多分自分じゃ何もできないから業者に頼むしかなさそう。",
        "english": "I bought a vacant house, and that's exciting, but there are so many cockroaches all over the house. I probably won't be able to do anything myself, so I will have to call someone."
      },
      {
        "japanese": "私の息子なんて、部活を始めてからというもの食べるわ食べるわ、食費が心配だよ。",
        "english": "Ever since my son has started after school activities, he eats so much that I am worried about the cost of food."
      },
      {
        "japanese": "あの子は医者になりたいって決めてから、毎日勉強するわするわ。",
        "english": "Ever since he has decided that he wants to be a doctor, he studies a lot."
      },
      {
        "japanese": "「病院に入院してた時、いろいろ検査したらまあ、出るわ出るわ…(思った以上のことが指摘された)。」",
        "english": "'When I was in the hospital, they did various tests and, well, they just kept coming up...' (the results that were worse than expected)"
      },
      {
        "japanese": "「新婚旅行から戻ったらメールボックスには郵便物があるわあるわ、つかえてしまって引っ張ることができなかった。」",
        "english": "'When we got back from our honeymoon, there was so much mail in the mailbox that it was stuck and I couldn't pull it out.'"
      },
      {
        "japanese": "「子供が転んで泣くわ泣くわ。なだめるの大変だった。」",
        "english": "'Our child fell and cried so much that it was hard to calm her down.'"
      },
      {
        "japanese": "「先輩は面白いのなんのって喋ると笑うわ笑うわ。」",
        "english": "'Senpai is so funny, that I laugh so much whenever he talks.'"
      },
      {
        "japanese": "「ちょっとからかっただけで、あいつ怒るわ怒るわ。」",
        "english": "'He gets so angry just by teasing him a bit.'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/わ-わ",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-784"
  },
  "dojg": {
    "grammar_point": "〜わ〜わ",
    "description": "A structure that emphatically presents actions, events or states as examples or reasons, or indicates that someone does something or something happens to a great extent.",
    "meaning": "X and Y; for example, X and Y; because X and Y; so many; so much; one after another",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "701",
    "examples": [
      {
        "japanese": "(ksa).飛行機は12時間も遅れるわ荷物はなくなるわ(で)、今度の旅行は最悪だった。",
        "english": "The ﬂight was delayed l2 hours, and my luggage was lost; this trip was the worst."
      },
      {
        "japanese": "(ksb).客が来るわ来るわ、またたく間に小さい店はいっぱいになった。",
        "english": "Customers came in one after another, and in the blink of an eye, the small shop had ﬁlled up."
      },
      {
        "japanese": "(a).仕事は増えるわ給料が下がるわ、今の状況は最悪だ。",
        "english": "We have more work to do, and our salaries have been cut; the current situation could not be&nbsp; worse."
      },
      {
        "japanese": "(b).クレジットカードをなくすわ怪我をするわで、今度のスキー旅行ではひどい目に遭った。",
        "english": "Having lost my credit card and gotten injured--I had an awful time on this ski trip."
      },
      {
        "japanese": "(c).新しく雇った学生アルバイトは、仕事は遅いわ文句は多いわで、とても使いものにならない。",
        "english": "The student part-timer we hired recently is (of) no help (to us) because he (literally: his work) is slow and he complains a lot."
      },
      {
        "japanese": "(d).この辺りは買い物には不便だわ環境は悪いわ、何一ついいところがない。",
        "english": "There's nothing good around here—the shopping is inconvenient  and the environment is bad."
      },
      {
        "japanese": "(e).台所は何一つ手伝おうとしないわ、一緒に外食してもお金を払わないわ、もうあんな客は来てほしくない。",
        "english": "She never offered to help in the kitchen or paid anything when  we went out to eat; I don't want any more houseguests like that."
      },
      {
        "japanese": "(f).面白い仕事はもらえるわ給料は上げてもらえるわ、新井君は最近いいことずくめだ。",
        "english": "He gets interesting work and a raise—Arai has had a real  streak of good fortune lately."
      },
      {
        "japanese": "(g).辞書で「コウ」という発音の漢字を調べてみたら、あるわあるわ、全部で１７４も出ていた。",
        "english": "When I looked up the kanji with the  pronunciation \"kou\" in a dictionary, there were so many of  them—174 in all."
      },
      {
        "japanese": "(h).余程おなかが空いていたのだろう。食べるわ食べるわ、またたく間に大きな茶わんでご飯を5杯も平らげた。",
        "english": "He must have been very hungry. He ate and  ate, and ﬁnished ﬁve large bowls of rice in an instant."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)S1informal nonpast\n- わS2informal nonpastわ\n- 会議に遅れるわ名刺を忘れるわ\n- Someone was late for the meeting and forgot to bring his/her business cards\n- 交通は不便だわ家賃は高いわ\n- Transportation is inconvenient and the rent is expensive\n- (ii)V1informal nonpast\n- わV2informal nonpastわ\n- Where V1=V2\n- 増えるわ増えるわ\n- Something increases so much (literally: increases and increases)",
    "part_of_speech": "Structure (usually used in conversation)",
    "related": "【Related Expression: やら~やら】",
    "antonym": "",
    "source": "resources/original/dojg/all/～わ～わ.yaml"
  }
}