{
  "grammar_point": "を (object of an emotion)",
  "rank": 0,
  "dojg": {
    "grammar_point": "を④",
    "description": "A particle that marks the cause of some human emotion.",
    "meaning": "Indicates the object or cause of an emotion or feeling.",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "352",
    "examples": [
      {
        "japanese": "(ksa).次郎は父の死を悲しんだ・悲しみました。",
        "english": "Jiro was saddened at his father's death."
      },
      {
        "japanese": "(ksb).次郎は父が死んだこと・のを悲しんだ・悲しみした。",
        "english": "Jiro was sad that his father died."
      },
      {
        "japanese": "(a).私は浩の大学入学を喜んだ。",
        "english": "I was happy about Hiroshi's entering college."
      },
      {
        "japanese": "(b).ヨーロッパ人はまだ戦争が起きることを恐れている。",
        "english": "Europeans are afraid that war will break out again."
      },
      {
        "japanese": "(c).信子は京都での一年を懐かしんだ。",
        "english": "Nobuko nostalgically recollected her year in Kyoto."
      },
      {
        "japanese": "(d).林は英語が出来ないことを悩んでいる。",
        "english": "Hayashi is worried that he cannot speak English."
      }
    ],
    "writeup": "## 1. Because the main verbs used in the Key Sentences and the Examples, such as 悲しむ 'sadden', 喜ぶ 'rejoice', 恐れる 'fear', 懐かしむ nostalgically recollect' and 悩む 'worry' are all inwardly-oriented psychological verbs they cannot be considered transitive verbs in Japanese. Therefore, the particle を4 preceding these verbs cannot be the ordinary direct object marker を which normally marks an outwardly-oriented event. Rather it indicates the cause for human emotion expressed by the main verb. Thus, it is sometimes possible to rewrite the sentence in question using ので 'because'. (⇨ ので) For example, Key Sentence (A) and Example (a) can be paraphrased as (1a) and (1b), respectively.",
    "formation": "##",
    "part_of_speech": "Particle",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/を④.yaml"
  }
}