{
  "grammar_point": "をよそに",
  "rank": 9,
  "bunpro": {
    "grammar_point": "をよそに",
    "jlpt": "N1",
    "meaning": "Ignoring, Disregarding, Despite",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "を余所にis used to express that (A) is something that effectively has nothing to do with the speaker, or that the speaker is ignoring it in relation to something else. It may be translated as 'ignoring (A)', or 'disregarding (A)'. It is a combination of theadverbial particleを, the noun余所'other place', and the case-marking particle に. Due to this, its literal meaning is close to 'putting (A) completely aside, (B)'.This structure will follow nouns, or phrases that have been nominalized with の. It is reasonably formal, so will be seen more often in writing.The most common pattern forをよそにto follow is that (A) expresses some overall situation, while (B) indicates an action that is being done without any thought or care given toward those circumstances. Because of this, it is often used critically about actions that are seen as irresponsible.CautionWhile this grammar point will primarily highlight the actions of people, it will not be used to refer to the speaker's own actions.",
    "examples": [
      {
        "japanese": "彼は親の心配をよそに、毎晩夜遅くまで友達たちと遊んでいる。",
        "english": "Ignoring his parent's worries, he hangs out with his friends every night until late at night."
      },
      {
        "japanese": "社長は社員の反対をよそに、仕事の効率を上げるために休憩所を撤去した。",
        "english": "Ignoring objections from his workers, the president got rid of the break room inorder to increase efficiency."
      },
      {
        "japanese": "彼は周囲の視線をよそに、コンビニの店員に暴言を吐き続けていた。",
        "english": "Ignoring the eyes of those around him, he continued to lash out on the convenience store worker."
      },
      {
        "japanese": "私は両親の反対をよそに、彼と結婚することにした。",
        "english": "Ignoring my parents' objections, I decided to marry him. (Unnatural Japanese)"
      },
      {
        "japanese": "母の心配を余所に、彼は商船の船員になった。",
        "english": "Ignoring his mother's worries, he has become a merchant seaman."
      },
      {
        "japanese": "メアリーと武は親の反対 を余所に一緒になった。",
        "english": "Ignoring objections from their parents, Mary and Takeshi got together."
      },
      {
        "japanese": "私たちがその衝撃的な言葉の意味をまだ飲み込めてないの を余所に彼女は説明を続けた。",
        "english": "Ignoring that we still haven't digested the meaning of her shocking remark, she continued the explanation."
      },
      {
        "japanese": "ピーターは周りの忠告 を余所に、MMORPGゲームばかりすることを存分に楽しんだ。",
        "english": "Ignoring the advice of those close to him, Peter does nothing but play MMORPG games to his heart's content"
      },
      {
        "japanese": "地域住民の反対の声 を余所に、自治体が空港建設の計画を進めている。",
        "english": "Ignoring the voices of opposition, the local government carries forward the plan of airport construction."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/をよそに",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-800"
  },
  "dojg": {
    "grammar_point": "をよそに",
    "description": "A compound particle that expresses someone’s indifference to warnings, criticism, advice, accusations, opposition, anxiety, wishes, eagerness, provocative actions, etc.",
    "meaning": "Indifferent to ~; contrary to ~; ignoring ~; despite",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "531",
    "examples": [
      {
        "japanese": "(ksa).首相は国民の批判をよそにイラク戦争支持を表明した。",
        "english": "Setting aside people's criticism, the prime minister declared  his support for the Iraq War."
      },
      {
        "japanese": "(ksb).青春時代、友達がデートに明け暮れるのをよそに、僕は家に一人こもってSFを読んでいた。",
        "english": "During my adolescent years, I secluded myself at home and read  science ﬁction, ignoring my friends, who were spending all their time dating."
      },
      {
        "japanese": "(a).今回のイベントは、我々の心配をよそに多くの参加者を集め、大成功だった。",
        "english": "Despite our worries, many people participated in the event, so  it turned out to be a big success."
      },
      {
        "japanese": "(b).たび重なる妻の忠告をよそに、彼は酒もタバコもやめなかった。",
        "english": "Ignoring his wife's repeated advice, he never quit drinking and  smoking."
      },
      {
        "japanese": "(c).彼はその恋を自身の最後の恋と感じて、周囲の警告をよそにのめり込んでいった。",
        "english": "Feeling that it would be his last chance for love, he ignored  the warnings of those around him, and allowed himself to get deeply involved."
      },
      {
        "japanese": "(d).２００６年12月、様々な反対の声をよそに、教育基本法改正案が国会の十分な審議を経ることなく可決された。",
        "english": "In December 2006, the revision of the Fundamental Law of  Education was passed without sufﬁcient deliberation by the Diet, despite  opposition from various sectors."
      },
      {
        "japanese": "(e).平和を希求する市民による核兵器廃絶への切なる願いをよそに、核兵器開発、核軍拡競争は、今なおとどまるところを知りません。",
        "english": "Despite the heartfelt pleas of peace-minded citizens who want  to abolish all nuclear weapons, the nuclear arms race and the development of  nuclear weapons still know no limits."
      },
      {
        "japanese": "(f).多くの国々が経済発展ばかりに躍起になっているのをよそに、この国は個人の豊かな生活を基盤にした幸福を追求している。",
        "english": "Contrary to the many countries in the world that  enthusiastically pursue economic growth, this country is pursuing happiness  based on an afﬂuent life for individuals."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)NP\n- をよそに\n- 不景気をよそに\n- Indifferent to economic recession\n- (ii)Sinformalの\n- をよそに\n- だ cannot be used before の. Adjectiveなstem{な/である}の;Nounであるの\n- 困っているのをよそに\n- Indifferent to the fact that someone is having trouble\n- 不便{な/である}のをよそに\n- Ignoring the inconvenience\n- 不況であるのをよそに\n- Indifferent to the state of depression",
    "part_of_speech": "Compound Particle (usually used in formal writing and formal speech)",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/をよそに.yaml"
  }
}