{
  "grammar_point": "をもとに",
  "rank": 6,
  "bunpro": {
    "grammar_point": "をもとに",
    "jlpt": "N2",
    "meaning": "Based on, From, According to",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When linked to a noun,を元にis an expression that indicates that something is 'based on (A)', 'from (A)', or 'according to (A)'. This is a combination ofを, the noun元'origin', andに. The literal meaning is similar to 'with (A) as the origin, (B)', and is used primarily to reference a source from which something is created or started.Most of the time, をもとに will be written without kanji, but it is also possible to see it asを元に.As this grammar pattern is mainly used to highlight an origin of creation, it will often be seen in sentences that use verbs like書く 'to write', できる 'to be able', and作る 'to make'.Caution -を元に'based on' differs toに基づいて'based on', in thatに基づいてindicates a foundation from which the judgement or conclusion of (B) is made, whileを元にfocuses more on being a source of inspiration for (B), or enabling (B).",
    "examples": [
      {
        "japanese": "このドラマは実際に起こったことをもとに作られたそうだ。",
        "english": "Apparently, this TV show was created based on actual events."
      },
      {
        "japanese": "研究の結果をもとにレポートを書いてください。",
        "english": "Please write a report based on the results of the research."
      },
      {
        "japanese": "私はこのデータをもとにこのグラフを作成しました。",
        "english": "I created this graph based on this data."
      },
      {
        "japanese": "彼は法律に基づいて処分されるだろう。",
        "english": "He will be receiving punishment according to the law."
      },
      {
        "japanese": "彼は法律をもとに処分されるだろう。",
        "english": "He will be punished based on the law."
      },
      {
        "japanese": "この恋愛漫画は実際に起こったことを元に作られているらしい。",
        "english": "I heard that this romance manga is based on actual events."
      },
      {
        "japanese": "税金の総額は年度の収入を元にして計算される。",
        "english": "The amount of tax is calculated based on revenue in a fiscal year."
      },
      {
        "japanese": "本当の魚の姿を元にしたロボットは普通の魚とともに暮らし、海洋生物についてのデータを収集しています。",
        "english": "Robots based on the shape of an actual fish are living with ordinary fish and are collecting data about marine life."
      },
      {
        "japanese": "息子の足跡を元に後を追った。",
        "english": "I pursued my son based on his footprints."
      },
      {
        "japanese": "電話帳を元に宛名を書いてください。",
        "english": "Please write the name and address according to the telephone book."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/をもとに",
    "false_friends": [
      {
        "term": "にしたがって",
        "meaning": "As, Following, As then, According to, In accordance with",
        "kind": "synonym"
      },
      {
        "term": "に応じて",
        "meaning": "Depending or based on, According to, In response to, Suitable for or to,",
        "kind": "synonym"
      },
      {
        "term": "によると・によれば",
        "meaning": "According to",
        "kind": "synonym"
      },
      {
        "term": "にもとづいて",
        "meaning": "Based on, In accordance with",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-798"
  }
}