{
  "grammar_point": "をものともせず",
  "rank": 9,
  "bunpro": {
    "grammar_point": "をものともせず",
    "jlpt": "N1",
    "meaning": "Making nothing of, Ignoring, In defiance of, Regardless of, Disregarding",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "をものともせずis a combination of theadverbial particleを, thenoun物'thing', the particle とも 'even as', and the negative form of する paired withclassical auxiliary verbず, せず. The common translations of 'to make nothing of (A)', or 'in defiance of (A)' are quite close to the more literal translation of 'without making (A) a thing'.As を must follow a noun, this expression may only be used after nouns, or nominated phrases.をものともせずwill often follow negative words which are being praised as something that a person was not affected by 'did not make a think of' in their response to it.Cautionをものともせずwill not be used when talking about one's own actions.",
    "examples": [
      {
        "japanese": "谷口選手は足が震えているのをものともせず、レースを完走した。",
        "english": "Taniguchi completed the race, regardless of his shaky legs."
      },
      {
        "japanese": "彼らは外が暑いのをものともせず、一日中街頭募金活動をした。",
        "english": "Regardless of it being hot outside, they spent all day on the streets fundraising."
      },
      {
        "japanese": "彼女は危険なのをものともせずに、子供たちを助けに行った。",
        "english": "She went to help the children, ignoring the danger."
      },
      {
        "japanese": "彼は手首の怪我をものともせずに試合で優勝した。",
        "english": "He won the match despite his wrist injury."
      },
      {
        "japanese": "私は嵐をものともせず海にドライブに行った。",
        "english": "Ignoring the storm, I went for a drive to the beach. (Unnatural Japanese)"
      },
      {
        "japanese": "勇敢なボランティアたちは零下30度の気温をものともせず、行方不明の子犬を探し続けた。",
        "english": "In defiance of the -30°C temperatures, the brave volunteers continued searching for the lost puppy."
      },
      {
        "japanese": "厳しい経済状況をものともせず、アンブレラ社の株は急騰した。",
        "english": "Regardless of the tough economic situation, Umbrella Corporation stocks shot up."
      },
      {
        "japanese": "清瀬灰二選手は肺がはげしくあえぐのをものともせずに、最後まで頑張って勝利した。",
        "english": "Haiji Kiyose, ignoring his lungs desperately gasping for air, pressed on and managed to be victorious."
      },
      {
        "japanese": "彼女は政敵からの揶揄をものともせず選挙を戦い抜き、大統領の座を勝ち取った。",
        "english": "Disregarding the mockery from her political opponents, she fought to the bitter end and won the presidential seat."
      },
      {
        "japanese": "上司の反対をものともせず提案を押し通した。",
        "english": "Making nothing of the objection of their superiors, they insisted on the proposal."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/をものともせず",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-799"
  },
  "dojg": {
    "grammar_point": "をものともせず",
    "description": "A phrase indicating that someone does something bravely/fearlessly in spite of unfavourable circumstances.",
    "meaning": "In spite of ~; undaunted by ~; in definance of ~; in the face of ~",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "493",
    "examples": [
      {
        "japanese": "(ksa).彼女は重度の身体障害をものともせず、自分の人生をつかみとった。",
        "english": "Despite severe physical handicaps, she took charge of her own  life."
      },
      {
        "japanese": "(ksb).彼は日本語がしゃべれないのをものともせず、身振り手振りで日本を旅行して歩いた。",
        "english": "Undaunted by his inability to speak Japanese, he travelled  around Japan communicating with gestures and signs."
      },
      {
        "japanese": "(a).友人は高波をものともせず4キロを泳ぎ切った。",
        "english": "Overcoming high waves, my friend swam (all of) four kilometres."
      },
      {
        "japanese": "(b).子供は時差をものともせず、早速水着に着替えてワイキキビーチへ出かけた。",
        "english": "In spite of the time difference, my child changed to her  swimming suit right away and went to Waikiki Beach."
      },
      {
        "japanese": "(c).高層ビル火災の際、消防士たちは危険をものともせずその建物の階段を駆け登っていった。",
        "english": "At the time of the high-rise fire, firemen ran up the stairs of  the building in spite of the danger."
      },
      {
        "japanese": "(d).民衆は軍事政権の弾圧をものともせず、デモ行進を続けた。",
        "english": "The people continued their demonstrations in deﬁance of the  military government's oppression."
      },
      {
        "japanese": "(e).彼女は周囲の人の批判をものともせず、自分の信じる道を進んだ。",
        "english": "Ignoring criticism from the people around her, she proceeded on  the path she believed in."
      },
      {
        "japanese": "(f).高校生たちは雨が激しく降っているのをものともせず、熱心に野球の練習をしていた。",
        "english": "The high school students were practicing baseball in spite of  the heavy rain (literally: in spite of the fact that it was raining hard)."
      },
      {
        "japanese": "(g).美佐子は片道所要時間が2時間を越えるのをものともせず、東京の証券会社に通勤した。",
        "english": "Despite the fact that it took Misako two hours each way, she  commuted (every day) to a securities company in Tokyo."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun\n- をものともせず\n- 失敗をものともせず\n- In spite of the failure\n- (ii)Sinformalの\n- をものともせず\n- だ after Adjectiveなstem and Noun changes to な\n- 非難されたのをものともせず\n- In spite of the fact that someone was criticised\n- 頭が痛いのをものともせず\n- In spite of the fact that someone has a headache\n- 場所が不便{な/である}のをものともせず\n- In spite of the fact that the location is inconvenient\n- 夫が病気{な/である}のをものともせず\n- In spite of the fact that someone’s husband is ill",
    "part_of_speech": "Phrase (usually used in formal writing and formal speech)",
    "related": "【Related Expression: にもかかわらず】",
    "antonym": "",
    "source": "resources/original/dojg/all/をものともせず.yaml"
  }
}