{
  "grammar_point": "を経て",
  "rank": 8,
  "bunpro": {
    "grammar_point": "を経て",
    "jlpt": "N1",
    "meaning": "Via, Through, After (experience at job, university, etc.), Pass through",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "を経てis a fairly formal grammar point used when highlighting a passage of time, or an event that took a certain amount of time.経る itself is a る-Verb that means 'to elapse' or 'to pass' in terms of time. The difference between it and過ぎる 'to pass time' is that過ぎる focuses on having reached the end point, while経る focuses on what was happening for the whole period leading up to that end point. Because of this,を経てcan also be translated as 'having undergone (A)', due to the emphasis being on the preceding action.を経てwill directly follow nouns, and the rest of the sentence usually then goes on to describe the significance of that passage of time or experience, or what happened as a result.As it is a formal structure,を経てis often seen in biographies, introductions, and similar media.",
    "examples": [
      {
        "japanese": "私たちは2019年に出会って、約2年間の交際を経て結婚しました。",
        "english": "We met in 2019, and married after going through two years of dating."
      },
      {
        "japanese": "日本への留学を経て、日本の文化などを学ぶことができました。",
        "english": "Through my study in Japan, I was able to learn about Japanese culture and other aspects of the country."
      },
      {
        "japanese": "人は色々な経験を経て、成長していく。",
        "english": "People grow through various experiences."
      },
      {
        "japanese": "ちとげとらくは、約１０年の交際を経て結婚した。",
        "english": "Chitoge and Raku finally married after going through about ten years of dating. (through・via・experience)"
      },
      {
        "japanese": "略歴：「早稲田大学理学部卒業後Google勤務を経て202◯年独立。」",
        "english": "Short bio: 'Graduated from the department of science, Waseda University. After (having the experience of) working at Google, he started his own business in 202X.' (through・via)"
      },
      {
        "japanese": "新聞：「今後必要な手続きを経て、鉱山買収は完了します。」",
        "english": "Newspaper: 'After going through all of the necessary procedures, the mine acquisition will be complete.' (through・via・experience)"
      },
      {
        "japanese": "数世代を経てもなお争議が続いている。",
        "english": "Even after several generations, the dispute still continues. (through・via・experience)"
      },
      {
        "japanese": "ベルリンからローマを経てブエノスアイレスに向かいます。",
        "english": "From Berlin, via Rome, to Buenos Aires. (through)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/を経て",
    "false_friends": [],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-813"
  }
}