{
  "grammar_point": "を皮切りに",
  "rank": 8,
  "bunpro": {
    "grammar_point": "を皮切りに",
    "jlpt": "N1",
    "meaning": "Beginning of, Starting with",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "を皮切りにis a grammar structure that will be utilized with nouns in order to show the starting point for something, from which it then expanded, or something kept happening after. In most cases,を皮切りにwill just be translated as 'starting with (A)', or 'beginning with (A)'.This structure is a combination of theadverbial particleを, the noun皮切り 'beginning' or 'outset', and the case-marking particle に. It will appear after nouns or phrases that have been nominalized, before going on to explain how something continued to expand afterwards.In place of に by itself, にして and として are also standard variations of the same grammar pattern.CautionIt is rare forを皮切りにto be used in relation to natural phenomena, or negative results. What happens as a result of (A) will usually be something positive, and have a specific 'doer'.Fun FactAlthough皮切り is really only used to mean 'beginning', the kanji combination of 'to cut a hide' can be used as a helpful memory tool for the nuance of creating a starting point from which something expanded outwards over a large area, like skinning an animal.",
    "examples": [
      {
        "japanese": "藤田先輩がやめたのを皮切りに、他の人たちもどんどんやめていった。",
        "english": "Starting with Fujita senpai quitting, others quit in quick succession."
      },
      {
        "japanese": "あの俳優はテレビ東京に出演したのを皮切りに、色々な局に出演することになった。",
        "english": "That actor started by appearing on TV Tokyo and then went on to appear on various stations."
      },
      {
        "japanese": "佐々木さんの発言を皮切りに、賛成する人が出てきた。",
        "english": "Starting with Sasaki-san's comment, some people began to agree with him."
      },
      {
        "japanese": "クラスメイトの高橋さんを皮切りに、クラスみんな風邪になってしまった。",
        "english": "Starting with Takahashi-san, my classmate, everyone in my class caught a cold."
      },
      {
        "japanese": "彼女が社長に文句を言ったのを皮切りにして、みんな社長に文句を言い始めた。",
        "english": "Starting with her making a complaint to the boss, everyone started to make complaints to the boss."
      },
      {
        "japanese": "あのグループは名古屋を皮切りとして、全国でライブを行った。",
        "english": "Starting with Nagoya, that group performed throughout the country."
      },
      {
        "japanese": "皆川さんが監督として選ばれたのを皮切りにして、うちのチームは次々とスポーツの成功を掴んだ。",
        "english": "Starting with Minagawa-san being chosen as our trainer, our team continued to be successful."
      },
      {
        "japanese": "店の移転を皮切りとして、売上げがどんどんと上がっています。",
        "english": "Starting with the shop relocation, sales are rapidly increasing."
      },
      {
        "japanese": "「レオナルド・ディカプリオはタイタニックの主人公になったのを皮切りにしてスターへの道を歩み始め、大ヒット映画に出演している。」",
        "english": "'Starting with his leading role in Titanic, Leonardo DiCaprio embarked on the road to stardom and has appeared in many hit movies.'"
      },
      {
        "japanese": "東京を皮切りに、明治時代を舞台にした演劇「〇〇」が全国３０劇場で公演されます。",
        "english": "Starting with Tokyo, the play XX, which is set in the Meiji era, will be performed at 30 theaters nationwide."
      },
      {
        "japanese": "それを皮切りとして、コンビニは相次いで出店し始めた。",
        "english": "Starting with that, convenience stores started opening one after the other."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/を皮切りに",
    "false_friends": [
      {
        "term": "をはじめ",
        "meaning": "Not only...but also..., Starting with",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-811"
  }
}