{
  "grammar_point": "を除いて",
  "rank": 6,
  "bunpro": {
    "grammar_point": "を除いて",
    "jlpt": "N2",
    "meaning": "Except, With the exception of, Unless",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "を除いてis a formal grammar structure that combines を and the て-form of the う-Verb除く 'to exclude'. This pattern will be seen following nouns in their dictionary form, and carries the meaning of 'except for (A), (B)', 'with the exception of (A), (B)', 'unless (A), (B)', or 'excluding (A), (B)'.As with many verb-based expressions, the standard form may also be used when directly modifying a second noun.を除いてis more formal than以外'except for', and is frequently found in formal writing, on street signs, and other similar places.",
    "examples": [
      {
        "japanese": "高橋さんと浜崎さんを除いて、他のみんなは残業をしてください。",
        "english": "Everyone, with the exception of Takahashi-san and Hamasaki-san, please work overtime."
      },
      {
        "japanese": "私は第２土曜日を除いて、毎日働いています。",
        "english": "With the exception of the second Saturday of the month, I work every day."
      },
      {
        "japanese": "そこの壁にかけてあるギターを除く全てのギターは母親のものです。",
        "english": "With the exception of that guitar hanging on the wall, all of it is my mother's."
      },
      {
        "japanese": "中田先生を除く全ての先生は同じ大学を卒業したらしい。",
        "english": "Apparently, all of the teachers, except Mr. Nakata, graduated from the same college."
      },
      {
        "japanese": "病院スタッフを除いて、入ってはならない。",
        "english": "With the exception of hospital staff, do not enter."
      },
      {
        "japanese": "警察は捜索状を持っている場合を除いては、家を捜索することができません。",
        "english": "Police cannot search a building unless they have a search warrant."
      },
      {
        "japanese": "エウロパを除いて、これらすべての世界が人間に属しています。",
        "english": "All these worlds belong to humans, except Europa."
      },
      {
        "japanese": "動物園にいるものを除くすべてのライオンはアフリカに生息している。",
        "english": "All lions, excluding those in Zoos, live in Africa."
      },
      {
        "japanese": "動物園を除くすべての都立公園は無料である。",
        "english": "All metropolitan parks, excluding zoos, are free."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/を除いて",
    "false_friends": [
      {
        "term": "はともかく",
        "meaning": "Setting aside, Apart from",
        "kind": "synonym"
      },
      {
        "term": "いがい",
        "meaning": "Except・besides, Other than, With the exception of",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-818"
  }
}