{
  "grammar_point": "一つには",
  "rank": 10,
  "dojg": {
    "grammar_point": "一つには",
    "description": "An adverb meaning “partly” in a context where someone gives one or two objectives, benefits, examples or reasons for something.",
    "meaning": "Partly; for one thing",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "122",
    "examples": [
      {
        "japanese": "(ksa).大学教育の目的は、一つには幅広い教養と専門的な知識・能力を授けること、一つには社会に貢献する指導者を育成することだ。",
        "english": "The objective of college education is partly to provide broad  schooling and professional knowledge and ability, and partly to train and  produce leaders who will contribute to society."
      },
      {
        "japanese": "(ksb).彼が外国語を好んで勉強しているのは、一つには、異文化学習が好きだからだ。",
        "english": "One reason he likes studying foreign languages is because he  likes to learn about different cultures."
      },
      {
        "japanese": "(a).彼がよく家族と旅行に出かけるのは、一つには自分のため、一つには家族のためだ。",
        "english": "He travels so frequently with his family, partly for himself  and partly for his family."
      },
      {
        "japanese": "(b).日本人が大人まで漫画を読んでいるのは、一つには、大人が十分味わえるような漫画があるからだ。",
        "english": "The reason even Japanese adults read comics is because there  are comics that adults can fully enjoy."
      },
      {
        "japanese": "(c).彼がその子を好きな理由はいろいろとあるが、一つには彼女の話し方がいつも生き生きとしているためだ。",
        "english": "He likes that girl for many reasons, but partly because her  talk is always lively."
      },
      {
        "japanese": "(d).私がアメリカに来た理由は、一つには、そこに学問の自由があると思ったからだ。",
        "english": "One reason I came to the U.S. was because I thought there was  academic freedom here."
      },
      {
        "japanese": "(e).政治家が嫌われる理由は、一つには、選挙の時には魅力的な公約を言うのに、当選するとそれを実行しないからだ。",
        "english": "Part of the reason politicians are disliked is because they  make attractive promises when campaigning but don't put them into practice once  they are elected."
      },
      {
        "japanese": "(f).日本に来た外国人が体験するカルチャーショックには色々あると思うが、一つには、日本人が彼らをガイジン、つまりソトの人と呼ぶということがある。",
        "english": "Foreigners experience a variety of culture shocks when they  come to Japan, one of which is being called gaijin, or “outside people,” by the  Japanese."
      },
      {
        "japanese": "(g).「十年日記」をやってみたいとよく思うが、まだ始めていない。それは一つには、前の年の方がいい年だったらいやだからだ。",
        "english": "I've often thought of keeping a &ldquo;10-year diary,” but I've never  gotten around to doing it. That's partly because I wouldn't like it if the  previous year was better."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)一つには\n- (もう)一つには〜\n- 一つには自分のため、もう一つには家族のため\n- Partly for oneself and partly for one’s family\n- (ii){V/Adjectiveい}informal\n- {の/理由}は一つには〜{から/ため}だ\n- 食べない{の/理由}は一つにはまずい{から/ため}だ\n- One reason why someone doesn’t eat something is because it doesn’t taste good\n- 食べなかった{の/理由}は一つにはまずかった{から/ため}だ\n- One reason why someone didn’t eat something was because it didn’t taste good\n- 美味しい{の/理由}は一つには素材がいい{から/ため}だ\n- One reason why something is delicious is because the ingredients are good\n- 美味しかった{の/理由}は一つには素材がよかった{から/ため}だ\n- One reason why something was delicious was because the ingredients were good\n- (iii)Adjective な stem {な/だった}\n- {の/理由}は一つには〜{から/ため}だ\n- 数学が得意な{の/理由}は一つには好き{だから/なため}だ\n- One reason why he excels in math is because he likes it\n- 数学が得意だった{の/理由}は一つには好きだった{から/ため}だ\n- One reason why he excelled in math was because he liked it\n- (iv)Noun{なの/である理由}\n- は一つには〜{から/ため}だ\n- 失敗{なの/である理由}は一つには計画不足{だから/のため}だ\n- One reason for the failure is lack of planning\n- (v)Nounだった{の/理由}\n- は一つには〜{から/ため}だ\n- 失敗だった{の/理由}は一つには計画不足だった{から/ため}だ\n- One reason for the failure was lack of planning",
    "part_of_speech": "Adverb",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/一つには.yaml"
  }
}