{
  "grammar_point": "上がる・上げる",
  "rank": 4,
  "bunpro": {
    "grammar_point": "上がる・上げる",
    "jlpt": "N3",
    "meaning": "Something is finished, To finish something, Something has come to an end, To do something completely, To do something through",
    "meaning_warning": "上がる is intransitive, 上げる is transitive",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When used after theconjunctive formof a verb, either of the verbs上げる 'to raise', or上がる'to rise' may be used. They will convey that something has been done 'to the limit'.上がるwill be used for actions that take place by themselves (intransitive), while上げるwill be used for actions that have an instigator (transitive).Although上げる and上がるshow that something has been done 'to the limit', the nuance is usually 'to do (A) to the point of completion', or 'to do (A) through to the end'. Therefore, the 'limit' that is being highlighted is usually a natural ending, and not due to running out of some kind of resource. Let's have a look at some examples.上げる and上がるare most commonly used when some kind of effect or product is produced as a result of the (A) action. In these cases, the literal meaning of 'to (A) up' is very similar to 'to finish up (A)' in English.Caution仕上がる is a very common expression that is used for many things. Usually it conveys that something has been completed after some involved or time consuming process.",
    "examples": [
      {
        "japanese": "レポートは書きあがった?",
        "english": "Did you finish writing the paper?"
      },
      {
        "japanese": "この炊飯器を使えば20分でご飯が炊きあがるよ。",
        "english": "If you use this rice cooker, your rice will finish cooking in 20 minutes."
      },
      {
        "japanese": "明日の朝までに書き上げるのは無理かな?頑張らなきゃ。",
        "english": "Is it impossible to finish up writing this paper by tomorrow? I should give it my all."
      },
      {
        "japanese": "彼は砂を使って小さな街を作り上げた。",
        "english": "He used sand to build up a small city."
      },
      {
        "japanese": "彼の作品は5分で書きあがる。",
        "english": "His pieces are drawn up in 5 minutes."
      },
      {
        "japanese": "古いコンピューターは立ち上がるのに10分かかる。",
        "english": "It takes an old computer 10 minutes to finish up booting."
      },
      {
        "japanese": "ラッピングが仕上がったら番号でお呼びします。",
        "english": "We will call you by your number once we finish wrapping it."
      },
      {
        "japanese": "あれはどんな風に仕上がるかな。",
        "english": "I wonder how that will be completed."
      },
      {
        "japanese": "ところで、やっと絵が描き上がったよ。",
        "english": "By the way, the picture has finally been completely painted."
      },
      {
        "japanese": "その日のうちに部屋の壁を塗り上げた。",
        "english": "I finished painting the room walls before the day was over."
      },
      {
        "japanese": "作品がし上がる。",
        "english": "The piece will be finished."
      },
      {
        "japanese": "なんとかドレスを縫い上げました。",
        "english": "I have somehow managed to finish sewing the dress."
      },
      {
        "japanese": "ご飯が炊きあがる。",
        "english": "The rice will finish up cooking."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/上がる-上げる",
    "false_friends": [
      {
        "term": "はじめる",
        "meaning": "To start, To begin to",
        "kind": "antonym"
      },
      {
        "term": "切れない",
        "meaning": "Being unable to finish or complete",
        "kind": "antonym"
      },
      {
        "term": "おわる",
        "meaning": "To finish, To end",
        "kind": "synonym"
      },
      {
        "term": "てしまう・ちゃう",
        "meaning": "To do something by accident, To finish completely・totally, Unfortunately",
        "kind": "synonym"
      },
      {
        "term": "切る",
        "meaning": "To do something completely to the end, Utterly, Resolutely",
        "kind": "synonym"
      },
      {
        "term": "抜く",
        "meaning": "All~, Completely, See through, Overcome, To the bitter end",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-833"
  }
}