{
  "grammar_point": "且つ・かつ",
  "rank": 10,
  "dojg": {
    "grammar_point": "且つ・かつ",
    "description": "A conjunction meaning “and” that connects words, phrases and sentences.",
    "meaning": "And; and also; yet; but; and ~ as well; as well as; moreover",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "209",
    "examples": [
      {
        "japanese": "(ksa).スミス氏は流暢な日本語を話し、且つ日本の歴史や文化にも明るい。",
        "english": "Mr. Smith is ﬂuent in Japanese and is also knowledgeable about  Japanese history and culture."
      },
      {
        "japanese": "(ksb).この本は、分かりやすく、且つ味わい深い言葉で書かれている。",
        "english": "This book is written in language that is easy to understand but  also profound."
      },
      {
        "japanese": "(ksc).彼女は一流のピアニストで、且つ優れた随筆家だ。",
        "english": "She is a ﬁrst-class pianist, as well as a ﬁne essayist."
      },
      {
        "japanese": "(ksd).外国語は、楽しく、且つ効果的に勉強したい。",
        "english": "We'd like to study foreign languages in an enjoyable yet  effective way."
      },
      {
        "japanese": "(kse).英語ができること、且つウェブサイトの作成経験があることがこの仕事の要件だ。",
        "english": "Being able to speak English and having experience in  constructing websites are the conditions required for this job."
      },
      {
        "japanese": "(a).パソコンさえあれば自宅ででき、且つ高収入の仕事をご紹介します。",
        "english": "We will introduce you to jobs that not only pay well, but can  be done at home, as long as you have a computer."
      },
      {
        "japanese": "(b).この図は、自動車を個人で利用できず、且つ家族とも共有できない６５歳以上の高齢者の外出頻度を示している。",
        "english": "This ﬁgure shows how often senior citizens over 65 who cannot  drive a car and do not share one with their family get out."
      },
      {
        "japanese": "(c).和太鼓による若々しく、且つたくましい演奏をご堪能下さい。",
        "english": "Please enjoy the youthful, powerful performance on the Japanese  drums."
      },
      {
        "japanese": "(d).当店では、スタイリッシュで、且つシンプルなトレーニングウエアを各種取り揃えております。",
        "english": "Our store has various kinds of training gear that are stylish  yet simple in design."
      },
      {
        "japanese": "(e).ご注文のキャンセルについては、注文から24時間以内で、且つ注文されたご本人によりメールあるいはファックスでご連絡いただいた場合のみ認められます。",
        "english": "We accept cancellations only within 24 hours  of an order being placed <em>and</em> only when we receive notiﬁcation via e-mail or fax  by the person who has placed the order."
      },
      {
        "japanese": "(f).この仕事では大量の文献を速く且つ正確に読むことが要求される。",
        "english": "This job demands that you read a large volume of material both  quickly and accurately."
      },
      {
        "japanese": "(g).当社は、個人情報を取り扱うにあたり、個人情報保護法はじめ適用される諸法令、規範遵守を徹底し、適切且つ慎重に管理いたします。",
        "english": "At our company, when we handle personal information, we  thoroughly observe the applicable laws and regulations, including the Personal  Information Protection Law, and we manage the information properly and  prudently."
      },
      {
        "japanese": "(h).売主は、製品には欠陥またはきずのある材料の使用がないこと、且つ当該製品が売主の発行した仕様に合致するものであることを保証する。",
        "english": "The seller guarantees that the product does not use materials  with defects or blemishes and that the product meets the speciﬁcations issued  by the seller."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){Vます/Vて}、\n- 且つ\n- 飲み、且つ\n- Someone drinks and\n- 飲んで、且つ\n- Someone drinks and\n- (ii)Vnegative ず、\n- 且つ\n- 行かず、且つ\n- Someone will not go and\n- (iii)Adjectiveいstemく(て)、\n- 且つ\n- 面白く(て)、且つ\n- Something is interesting and\n- (iv)Adjectiveなstem\n- ({で/であり/であって})、且つ\n- 経済的({で/であり/であって})、且つ\n- Something is economical and\n- (v)Nounで({あり/あって})、\n- 且つ\n- 天才で({あり/あって})、且つ\n- Someone is a genius and\n- (vi){Adjectiveいstemく/Adjectiveなstemで(は)/Nounで(は)}\n- なく、且つ\n- 面白くなく、且つ\n- Something is not interesting and\n- 便利(で)はなく、且つ\n- Something is not convenient and\n- 英語(で)はなく、且つ\n- Something is not English and\n- (vii){Adjectiveいstemく/Adjectiveなstem(に)}\n- 且つ{Adjectiveいstemく/Adjectiveなstemに}\n- 早く、且つ正確に\n- Quickly and accurately\n- 慎重(に)、且つ迅速に\n- Prudently and rapidly\n- (viii){Sentence/Phrase}1 こと、\n- 且つ{Sentence/Phrase}2 こと\n- 日本人であること、且つ区内に居住すること\n- Being a Japanese and living in the ward",
    "part_of_speech": "Conjunction (usually used in formal writing and formal speech)",
    "related": "【Related Expression: と; や; また; その上; 更に; 加えて; そして】",
    "antonym": "",
    "source": "resources/original/dojg/all/且つ・かつ.yaml"
  }
}