{
  "grammar_point": "並びに",
  "rank": 10,
  "dojg": {
    "grammar_point": "並びに",
    "description": "A conjunction used to combine two nouns or noun phrases.",
    "meaning": "And; both ~ and ~; as well as",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "353",
    "examples": [
      {
        "japanese": "(ks).国連総会には首相並びに外務大臣が出席した。",
        "english": "The prime minister and the foreign minister attended the U.N.  General Assembly."
      },
      {
        "japanese": "(a).県並びに県内各市町村では、地域イントラネット構築して、行政や福祉情報の円滑な提供に努めている。",
        "english": "The prefecture and its municipalities have constructed local  intranets, and are working to provide administrative and welfare information  smoothly to their residents."
      },
      {
        "japanese": "(b).以下は犬及びねこの引き取り並びに負傷動物の収容に関する措置要領である。",
        "english": "What follows is an outline of procedures for caring for dogs  and cats, and admitting injured animals."
      },
      {
        "japanese": "(c).その政党は、夫婦間における暴力の防止並びに被害者の保護に関する法律案を発表した。",
        "english": "The political party announced laws for the prevention of  spousal violence as well as the protection of the victims."
      },
      {
        "japanese": "(d).今日は、大気や河川の汚染並びに酸性雨が環境に及ぼす影響についてお話しいたします。",
        "english": "Today I am going to talk about the contamination of our air and  rivers as well as acid rain's effect on them."
      },
      {
        "japanese": "(e).このホームページ並びにメールマガジンのスタッフをご紹介します。",
        "english": "Let me introduce you to the staff of our website and mail  magazine."
      },
      {
        "japanese": "(f).本学学長の選挙資格者は、選挙公示の日における学長並びに専任の教授、准教授及び講師とする。",
        "english": "Those who are qualiﬁed to be a candidate for president of this  college are those who are full-time professors, associate professors and  lecturers as well as the president at the time the election is announced."
      },
      {
        "japanese": "(g).本日ここに、大統領、並びに国務長官ほか、御一行の歓迎の宴を開くことができましたことは、私の最も欣快とするところであります。",
        "english": "It is my great pleasure that today we welcome the President,  the Secretary of State and other honourable visitors to this reception."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Noun1\n- 並びにNoun2\n- 学長並びに副学長\n- The university president and the vice president",
    "part_of_speech": "Conjunction (usually used in formal writing and formal speech)",
    "related": "【Related Expression: と; 及び】",
    "antonym": "",
    "source": "resources/original/dojg/all/並びに.yaml"
  }
}