{
  "grammar_point": "以上に",
  "rank": 6,
  "bunpro": {
    "grammar_point": "以上に",
    "jlpt": "N2",
    "meaning": "More than, No less than, Even more",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Like other structures that include以上'beyond',以上にhighlights that (A) is beyond some specific extent. In this grammar pattern, thecase marking particleに will indicate the word that以上にis attached to as an amount.With (A) being considered as 'beyond' something,以上にcan be translated as 'more than (A)', or 'even more than (A)'.以上にmay be used after verbs, い-Adjectives, な-Adjectives, or nouns in their standard forms.Occasionally, に may be replaced by の when a specific amount or quantity is being indicated with a second noun. The noun attached to の may not always obviously be an 'amount', but it is something that the speaker is 'measuring' in regard to (A).",
    "examples": [
      {
        "japanese": "新しく発売した商品の評判が思っていた以上に良かったのでびっくりした。",
        "english": "I was surprised to find that the newly launched product was more well-received than I had expected."
      },
      {
        "japanese": "今日の風は冷たい以上に痛い。",
        "english": "More than it is cold, today's wind is painful."
      },
      {
        "japanese": "今節約中だから必要以上にお金を使わないようにしてる。",
        "english": "Since I am saving money right now, I am trying not to use more money than necessary."
      },
      {
        "japanese": "私はスキー以上にスノーボードが好きだ。",
        "english": "I like snowboarding more than skiing."
      },
      {
        "japanese": "僕の最初のライブに想像していた以上の人が集まったので、すごく嬉しかった。",
        "english": "I was very happy that more people than I expected showed up to my first concert."
      },
      {
        "japanese": "私の先輩は思った以上の人生を送っている。",
        "english": "My senpai is living a better life than I thought."
      },
      {
        "japanese": "天気は予想以上に悪かった。",
        "english": "The weather was worse than I thought."
      },
      {
        "japanese": "食べられる量以上に、料理を注文してしまった。",
        "english": "I ordered more food than I am able to eat."
      },
      {
        "japanese": "彼には思った以上の人生がある。",
        "english": "He has more of a life than I thought."
      },
      {
        "japanese": "彼は温泉以上に、この旅館の料理が気に入ったらしい。",
        "english": "He seems to like the food at this ryokan more than he likes the onsen."
      },
      {
        "japanese": "彼は、カーブ以上にシュートをよく投げる投手です。",
        "english": "He is a pitcher who throws screwballs more than curve balls."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/以上に",
    "false_friends": [
      {
        "term": "より",
        "meaning": "More than, Over",
        "kind": "synonym"
      },
      {
        "term": "以上 ①",
        "meaning": "More than (or equal to), Over・(and) above, Any more・Greater, Exceeding",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-844"
  }
}