{
  "grammar_point": "以来",
  "rank": 8,
  "bunpro": {
    "grammar_point": "以来",
    "jlpt": "N2",
    "meaning": "Since, Henceforth",
    "meaning_warning": "Cannot be used with recent events",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When the noun,以来'ever since' is paired with the て-form of verbs, or with nouns, it indicates that (B) is something that has continued non-stop since (A), or will continue non-stop from (A). This may be interpreted as 'since (A)', 'henceforth', or 'ever since (A)'.The key point of以来is that it indicates an ongoing state. Due to this, it focuses on (B) being something that will continue non-stop until a change is caused externally.Caution - Occasionally,以来may also be used to express a specific number of (B) that has occurred since (A). While this use is closer to 'since', it still just indicates that 'in total', (B) has occurred 'ever since (A)'. This will place a stronger emphasis on the amount of (B) being shocking in some way than a simpler structure like から.",
    "examples": [
      {
        "japanese": "2年前にタバコをやめて以来、一本も吸ってない。",
        "english": "I haven't smoked a single cigarette ever since I quit 2 years ago."
      },
      {
        "japanese": "日本に来て以来、全然母国の友達と連絡をとっていない。",
        "english": "I haven't kept in touch with my friends back home ever since I moved to Japan."
      },
      {
        "japanese": "久しぶり！卒業以来じゃない?",
        "english": "Long time no see! (We haven't met) since graduation, right?"
      },
      {
        "japanese": "入社以来、あの先輩には色々とお世話になっている。",
        "english": "That senpai has helped me in many ways since I've joined the company."
      },
      {
        "japanese": "海外転職して以来、5年も日本に帰っていない。",
        "english": "I have not been back to Japan for five years since I changed jobs overseas."
      },
      {
        "japanese": "去年この大学に入学して以来、１回しか実家に帰っていない。",
        "english": "I have only been back to my parents' house once since I entered university last year."
      },
      {
        "japanese": "8年前に日本語を勉強し始めて以来、毎日、しっかり勉強してる。",
        "english": "Since I began studying Japanese 8 years ago, I study hard every day."
      },
      {
        "japanese": "お父さんは３年前に引退した。それ以来、自由な時間がたくさん。",
        "english": "My father retired three years ago. Since then he has a lot of free time."
      },
      {
        "japanese": "兄が移住して以来、全然連絡が取れない。",
        "english": "Since my brother emigrated, I haven't been able to contact him."
      },
      {
        "japanese": "カマチョさんが首相に就任して以来、税金が上がる一方だ。",
        "english": "Taxes keep on rising since Mr. Camacho assumed the office of prime minister."
      },
      {
        "japanese": "休業して以来、再開の目処が立っていない。",
        "english": "Since closing my business, the prospect of reopening hasn't come up."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/以来",
    "false_friends": [
      {
        "term": "以上 ②",
        "meaning": "Since, Now that, As long as, If",
        "kind": "synonym"
      },
      {
        "term": "上は",
        "meaning": "Once, Since, Now that, As long as",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-846"
  },
  "dojg": {
    "grammar_point": "以来",
    "description": "An adverb meaning “since”",
    "meaning": "Since",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "154",
    "examples": [
      {
        "japanese": "(ksa).大統領の支持率が就任以来最低となった。",
        "english": "The president's approval ratings have hit their lowest level  since his presidency began."
      },
      {
        "japanese": "(ksb).G社が、創業以来初めてホームページのデザインを変更した。",
        "english": "Company G changed the design of its homepage for the ﬁrst time  since it opened for business."
      },
      {
        "japanese": "(ksc).肝臓を患って以来、酒はやめている。",
        "english": "I've stopped drinking since I had my liver problem (literally:  suffered from liver (disease))."
      },
      {
        "japanese": "(ksd).植村に会うのは十年前の高校のクラス会以来だ。",
        "english": "This will be the ﬁrst time since our high school class reunion  10 years ago that I've seen Uemura."
      },
      {
        "japanese": "(kse).二年ほど前に重いスーツケースを持ち上げようとして腰を痛めてしまった。それ以来、重いものは持てなくなった。",
        "english": "About two years ago I damaged my back when I tried to lift a  heavy suitcase. Since then I haven't been able to lift heavy things."
      },
      {
        "japanese": "(a).国の教育ローンの利用者が制度発足以来初めて三百万人を超えた。",
        "english": "The number of users of the state's education loan (program) has  exceeded 3 million for the ﬁrst time since the inauguration of the system."
      },
      {
        "japanese": "(b).当ホテルは、明治42年創業以来９０年の歴史を持っています。",
        "english": "Our hotel boasts a 90-year history, having been established in  the 42nd year of Meiji."
      },
      {
        "japanese": "(c).琵琶湖の水位が今月6日、プラス31センチとなり、昨年7月21日以来、８か月ぶりに基準値に戻った。",
        "english": "On the 6th of this month, the water level in Lake Biwa reached  31 centimetres above zero, returning to the standard level for the first time  in eight months, or since July 21 last year."
      },
      {
        "japanese": "(d).半導体市場は９５年以来の二桁成長が予測されている。",
        "english": "Two-digit growth is predicted in the semiconductor market for  the ﬁrst time since 1995."
      },
      {
        "japanese": "(e).ジョンソン氏が社長に就任して以来、この会社は次々に大きな改革を行った。",
        "english": "Since Mr. Johnson became president, this company has carried  out one major reform after another."
      },
      {
        "japanese": "(f).生の舞台を見て以来、すっかり歌舞伎のファンになってしまった。",
        "english": "Ever since seeing my first live performance, I've become a big  fan of kabuki."
      },
      {
        "japanese": "(g).この空港始まって以来の大事故となった。",
        "english": "This is the worst accident since this airport opened."
      },
      {
        "japanese": "(h).先週清美と大げんかをした。それ以来、彼女とは口をきいていない。",
        "english": "I had a ferocious quarrel with Kiyomi last week. Since then, I  haven't talked to her."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Noun\n- 以来\n- Where Noun indicates an event or a specific time\n- 卒業以来\n- Since someone’s graduation\n- 五月三日以来\n- Since May 3\n- (ii)Vて\n- 以来\n- 帰って以来\n- Since someone returned\n- (iii)Demonstrative Adjective\n- 以来\n- あれ以来\n- Since that time",
    "part_of_speech": "Adverb",
    "related": "【Related Expression: から; いこう; いご】",
    "antonym": "",
    "source": "resources/original/dojg/all/以来.yaml"
  }
}