{
  "grammar_point": "何も〜ない",
  "rank": 10,
  "dojg": {
    "grammar_point": "何も〜ない",
    "description": "A structure indicating that an action is taken for no good reason.",
    "meaning": "Why ~ have to ~?; it is unnecessary to ~; have no good reason to ~; not need to ~",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "331",
    "examples": [
      {
        "japanese": "(ksa).何もそんなに怒ることはないよ。",
        "english": "You have no good reason to get so angry."
      },
      {
        "japanese": "(ksb).良性の腫瘍だから、何もそんなに心配する必要はない。",
        "english": "It's a benign tumour, so you don't need to worry about it too  much."
      },
      {
        "japanese": "(a).何もいまさらみんながやっている研究をやる必要なんかないと思うだろう?それが間違いなんだ。",
        "english": "You must be thinking there's no need to start on the research  everybody is already doing. But you are wrong."
      },
      {
        "japanese": "(b).突然携帯電話が鳴ったのでびっくりした。友人にはすでに番号を知らせてあったから、何もそんなに驚くこともないのだが、悪いことに会議中だったのだ。",
        "english": "I was surprised when my cell phone rang suddenly. I had given  the phone number to my friends, so it shouldn't have been a surprise, but  unfortunately it happened right in the middle of a meeting."
      },
      {
        "japanese": "(c).まあ落ち着いて下さい。私たちは何もあなたが犯人だと決めてかかっているわけじゃありませんから。",
        "english": "Please calm down. We certainly aren't accusing you of being the  culprit."
      },
      {
        "japanese": "(d).甘えるのは何も日本人に限ったことではない。",
        "english": "It isn't just the Japanese who are psychologically dependent on  others."
      },
      {
        "japanese": "(e).彼女の性格を変えようとしているようだけど、何もそこまでしなくたっていいんじゃないか。",
        "english": "You seem to be trying to change her personality, but why do you  need to go that far?"
      },
      {
        "japanese": "(f).元々十分に安いのだから、何もそんなに値切らなくてもと思うんですが、それがゲームになってしまうんです。",
        "english": "The prices are cheap enough to begin with, so there really  isn't any need to haggle with the store clerk, but it gets to be sort of a game  to do so."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- 何も\n- 〜ない\n- 何も行くことはない。\n- Why do you have to go there?\n- 何も行く必要はない。\n- It is unnecessary for someone to go there\n- 何も行かなくても(よい)。\n- You don’t have to go there",
    "part_of_speech": "Structure (usually used in conversation)",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/何も～ない.yaml"
  }
}