{
  "grammar_point": "何といっても",
  "rank": 6,
  "bunpro": {
    "grammar_point": "何といっても",
    "jlpt": "N2",
    "meaning": "By any account, All the same, No doubt",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "何といってもis an expression that is used in almost exactly the same way in Japanese as it is in English, and qualifies that 'no matter what is said, (A)', or 'by any account, (A)'. Being a mix of thesubstitute noun何'what', or 'whatever', と, the て-form of the う-Verb言う 'to say', and も, the literal meaning is also 'even whatever one can say (A)'.何といってもis used primarily at the beginning of sentences, and frequently highlights something that is a positive aspect of (A).Like many uses of何, the pronunciation change to何is simply for ease of speech.Despite being used mainly in positive situations,何といってもmay occasionally appear with a negative nuance as well, although this is far less common.",
    "examples": [
      {
        "japanese": "あのカフェは何といってもコーヒーとアイスクリームが安いからとても人気がある。",
        "english": "Without a doubt, they have cheap coffee and ice cream at that cafe, so it is very popular."
      },
      {
        "japanese": "彼は正直者だし、話しやすい。しかし、何といっても誰に対しても優しいからみんなに好かれている。",
        "english": "He is honest and easy to talk to. But, by any account, he is nice to anyone, so he is well liked by everyone."
      },
      {
        "japanese": "私の日本語の先生は厳しいけど、何といっても日本語を教えるのがものすごく上手だ。",
        "english": "My Japanese teacher is strict, but she is very good at teaching Japanese without a doubt."
      },
      {
        "japanese": "彼の悪いところは、何といってもすぐに嘘をつくことだ。",
        "english": "The bad thing about him is, by any account, that he is quick to lie."
      },
      {
        "japanese": "別府は空気や雰囲気がいい。何といってもいろんな温泉が楽しめることだ。",
        "english": "Beppu is a place with clear air and a wonderful atmosphere. All the same, you should enjoy its variety of hot springs."
      },
      {
        "japanese": "ここの回転寿司は、ネタが新鮮で美味しい。しかし、何といっても安いからおすすめだ。",
        "english": "The toppings at this kaiten-zushi restaurant are fresh and delicious. But, by any account, it's very cheap so I recommend it."
      },
      {
        "japanese": "この電車は新しくて綺麗だ。しかし、何といっても客席のすわり心地が最高だ。",
        "english": "This train is new and clean. There's no doubt that the seats are extremely comfortable."
      },
      {
        "japanese": "うちの会社のいいところは、何といってもボーナスがたくさんもらえることです。",
        "english": "A good point about our company is, by any account, that we get lots of bonuses."
      },
      {
        "japanese": "あの牧場のおすすめは、何といっても自家製のアイスクリームだ。",
        "english": "My recommendation for that farm, is no doubt, their home-made ice cream."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/何といっても",
    "false_friends": [
      {
        "term": "何しろ",
        "meaning": "No wonder, After all, In fact, Because, At any rate",
        "kind": "synonym"
      },
      {
        "term": "どうせ",
        "meaning": "Anyhow, At any rate, In any case, I have no doubt that, Probably",
        "kind": "synonym"
      },
      {
        "term": "〜というのは事実だ",
        "meaning": "It is a fact that ~, There is no doubt that",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-849"
  }
}