{
  "grammar_point": "僅かに",
  "rank": 6,
  "bunpro": {
    "grammar_point": "僅かに",
    "jlpt": "N2",
    "meaning": "Only, Slightly, A little, Barely, Merely",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "僅か is a な-Adjective in Japanese that is often used adverbially at the beginning of sentences in order to indicate an excessively small amount of something. 僅か itself may be translated as 'trifling', or 'meager', with the adverbial variant being interpreted as 'merely', 'barely', or 'slightly'.As an adverb, 僅か will appear as 僅かに .Due to 僅か highlighting an extremely small amount of something, it is often used when the speaker is trying to be modest in indicating that something is nothing more than a trifling amount, such as the difference between their and another's opinions.Fun Fact僅か may also be used simply as a noun without the case-marking particle に following it. In these cases, it will just mean ‘a meager thing’, ‘a trifle’, ‘an insignificance’, or any other such word that indicates something that is exceptionally small in size or number.",
    "examples": [
      {
        "japanese": "あの提案に賛成した議員はほんの僅かだ。",
        "english": "Only a small number of assembly members agreed to that suggestion."
      },
      {
        "japanese": "彼に残された時間は残り僅かだった。",
        "english": "He had very little time left."
      },
      {
        "japanese": "そのグループの中から準決勝に進出する選手は僅かに４人です。",
        "english": "Only four players will advance to the semifinals from this group."
      },
      {
        "japanese": "子供の頃、この通りにそって歩いて行くと、子供が遊んでいるのが見えたものだ。賑やかな街だった。今では僅かに会えるくらいだ。",
        "english": "During my childhood, when I went along this street I used to see children playing.It used to be a lively town. Now, I barely see anyone."
      },
      {
        "japanese": "LINUXのインタフェイスはWINDOWSのと僅かに異なる。",
        "english": "Linux's interface slightly differs from Windows'."
      },
      {
        "japanese": "彼女とは僅かに意見が違う。",
        "english": "(My) opinion differs slightly from her's."
      },
      {
        "japanese": "似ているけど、僅かに形が違うような気がした。",
        "english": "They look similar, but I had a feeling that their shapes were slightly different."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/僅かに",
    "false_friends": [
      {
        "term": "たった(の)",
        "meaning": "Only, Just, No more than",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-852"
  }
}