{
  "grammar_point": "即ち",
  "rank": 4,
  "bunpro": {
    "grammar_point": "即ち",
    "jlpt": "N3",
    "meaning": "In other words, That is, Namely",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "In a similar way toつまり,即ちis another grammar pattern in Japanese that is often translated as 'in other words'. It may also be translated as 'namely', or 'that is to say'. While即ちis anadverb, it is often used as aconjunction, linking two sentences via some sort of reasoning.CautionThe kanji used in即ちsimply means 'in concordance'. This shows that the nuance associated with即ちis that of 'agreeance' or 'correspondence' to something else, whileつまりis purely that of 'summarisation'.",
    "examples": [
      {
        "japanese": "この人は私の妻のお母さんです。すなわち、義理の母です。",
        "english": "This person is my wife's mother. In other words, my mother in law."
      },
      {
        "japanese": "私はゲームしてお金を稼いでいます。すなわち、プロゲーマーです。",
        "english": "I get paid for playing video games. In other words, I am a professional gamer."
      },
      {
        "japanese": "この車はもう動かないです。すなわち廃車です。",
        "english": "This car does not run anymore. In other words, it is a decommissioned car."
      },
      {
        "japanese": "彼は僕の父の弟です。つまり叔父です。",
        "english": "He is my father's brother. In other words, he is my uncle."
      },
      {
        "japanese": "彼は私の母の弟の息子、即ち従兄弟です。",
        "english": "He is my mother's brother's son. In other words, he is my cousin."
      },
      {
        "japanese": "5割引きの商品とは、即ち元の値段の半額ということだ。",
        "english": "A product that is 50% off is, in other words, half off."
      },
      {
        "japanese": "私は将来、子供たちに物事を教える職業に就きたいです。即ち、学校の先生になりたいのです。",
        "english": "In the future, I'd like to take up the profession of teaching various things to kids. Namely, I'd like to become a school teacher."
      },
      {
        "japanese": "日本の議会は二院制、即ち衆議院と参議院です。",
        "english": "The Diet in Japan consists of two Houses, namely the House of Representatives and the House of Councilors."
      },
      {
        "japanese": "彼女は私の弟の妻、即ち義理の妹です。",
        "english": "She is my brother's wife, that is, my sister in law."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/即ち",
    "false_friends": [
      {
        "term": "つまり",
        "meaning": "In short, To sum up, In other words",
        "kind": "synonym"
      },
      {
        "term": "ということは",
        "meaning": "That means, That is to say",
        "kind": "synonym"
      },
      {
        "term": "要するに",
        "meaning": "To sum up, In summary, In short",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-860"
  }
}