{
  "grammar_point": "却って",
  "rank": 4,
  "bunpro": {
    "grammar_point": "却って",
    "jlpt": "N3",
    "meaning": "All the more, On the contrary, Conversely",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "In order to revoke, or take a step back from a statement that has already been made,却ってwill often be used.却ってcan translate as 'rather', or 'all the more'. If a sentence consists of '(A)却って, (B)', what it means is 'putting aside (A), (B)'.却ってis anadverb.却ってitself translates most closely to 'instead'. However, this is not the 'instead' used for phrases like '(B) was chosen over (A)', but the 'instead' used for phrases like '(A) couldn't be achieved, so (B)'. This shows that (A) is usually the intention or aim of the speaker, but (B) was the result instead.Fun FactAnother reading of the kanji used in却ってis却く, which means 'to retreat'. This further highlights却って's nuance of 'stepping away' from the (A) statement, to show the real result of (B).",
    "examples": [
      {
        "japanese": "手伝ってくれてるのはありがたいけど、却って邪魔になってるからあっちに行ってくれる?ごめんね。",
        "english": "I am grateful that you are helping me, but putting that aside, since you are in the way, can you go over there please? I'm sorry."
      },
      {
        "japanese": "お母さんを元気にさせるつもりだったけど、却って怒らせてしまった。",
        "english": "I was supposed to make my mom happy, but rather than that I actually made her angry."
      },
      {
        "japanese": "「宿題やれ！」って言われると、却ってやりたくなくなる。",
        "english": "When someone tells me to do my homework, taking a step back from that, it makes me not want to do it even more."
      },
      {
        "japanese": "遅く走った方が安全だと思うかもしれないけど却って危ないから、高速道路ではスピードを落とさないで。",
        "english": "You might think that it is safer to drive slower on a highway, but taking a step back from that, it is actually dangerous."
      },
      {
        "japanese": "笑わせるつもりだったけど、却って泣かせてしまった。",
        "english": "I intended to make her laugh, but on the contrary I unfortunately made her cry."
      },
      {
        "japanese": "お手伝いのつもりでしょうが、却って迷惑です。",
        "english": "I realize that you are trying to help, on the contrary you are getting in the way."
      },
      {
        "japanese": "近道のつもりが、却って遠回りしてしまった。",
        "english": "What was supposed to be a shortcut, on the contrary turned out to be the long way around."
      },
      {
        "japanese": "手術をしたら却って悪化する場合もあります。",
        "english": "On the contrary, if you have an operation your condition could worsen."
      },
      {
        "japanese": "言い訳すると却って悪い印象を与える。",
        "english": "You'll make all the more of a bad impression if you make excuses."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/却って",
    "false_friends": [
      {
        "term": "ところが",
        "meaning": "Even so, However, Even though, But",
        "kind": "synonym"
      },
      {
        "term": "逆に",
        "meaning": "On the contrary",
        "kind": "synonym"
      },
      {
        "term": "に反して",
        "meaning": "Go against, Contrary to",
        "kind": "synonym"
      },
      {
        "term": "むしろ",
        "meaning": "Rather, Instead, Over",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-861"
  }
}