{
  "grammar_point": "合う",
  "rank": 4,
  "bunpro": {
    "grammar_point": "合う",
    "jlpt": "N3",
    "meaning": "To or for one another, Mutually, With",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When following theconjunctive formof another verb, the う - Verb合うmeans to do that action in concert with another person/group. This is often translated as 'to mutually do (A)', or 'to do (A) for one another'. Realistically, it just means 'to do (A) reciprocally', with involvement from both sides being required. In this usage,合うis considered to be asuffix.This construction is often used with expressions like お互いに 'mutually', which simply emphasizes the point.Fun FactWhile合うis regularly translated as 'to fit', or 'to meet' in English, its meaning is somewhat broader in Japanese.合うmeans to perform an action 'as one', where it is not possible (or would be difficult) to complete the action by oneself. Due to this, it is regularly used to describe ideal situations in which individuals should be doing something together, without thinking about their own personal gain.Caution合うmay also be used to in regard to sports/contests. In these cases, it may seem like players are not doing the action 'for' each other, but involvement from both sides is required to make the act possible.",
    "examples": [
      {
        "japanese": "彼女と将来の事を話し合う。",
        "english": "I am going to talk with my girlfriend about our future."
      },
      {
        "japanese": "子供たちがおもちゃを取り合うのを見てお兄ちゃんの事を思い出した。",
        "english": "The kids were fighting with each other over a toy, and that reminded me of my older brother."
      },
      {
        "japanese": "友達とポケモンカードを見せ合う。",
        "english": "My friend and I showed each other our Pokemon cards."
      },
      {
        "japanese": "こういう時こそ、助け合うのが大切だよ。",
        "english": "At times like this, it is important to help each other out."
      },
      {
        "japanese": "私達は夫婦なんだから、どんなことがあっても協力し合わないといけないよ。",
        "english": "We are husband and wife, so no matter what happens, we need to cooperate."
      },
      {
        "japanese": "全チームが賞金をかけて競い合う。",
        "english": "Every team competed against each other with the prize money on the line."
      },
      {
        "japanese": "「友達が苦しんでる時は、助け合うべきだね。」",
        "english": "'Friends ought to help one another in times of trouble, right?'"
      },
      {
        "japanese": "かなださき：「私達、同時に告白し合ったんだよ！」",
        "english": "Saki Kanada: 'We professed our love for one another at the same time!'"
      },
      {
        "japanese": "私達はそのとき協力し合うべきだったのに。",
        "english": "We should have cooperated (with each other) at that time..."
      },
      {
        "japanese": "買い物袋を交代しながら運び合ったので、家に早く帰ることができた。",
        "english": "We came home early because we took turns carrying the groceries (for one another)."
      },
      {
        "japanese": "お互いに助け合って、理解できるようになったから、付き合うようになった。",
        "english": "Since we were mutually helping one another and came to be able to understand one another we ended up dating."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/合う",
    "false_friends": [
      {
        "term": "と共に",
        "meaning": "Together with, At the same time,  As well as",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-865"
  }
}