{
  "grammar_point": "同士",
  "rank": 7,
  "bunpro": {
    "grammar_point": "同士",
    "jlpt": "N3",
    "meaning": "Fellow, With each other, Mutually, Between, Among, Together, With",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "同士'fellow' is a noun that may be used in the same way as asuffix. When used this way, it conveys things that are 'mutually (A)', 'fellow (A)', or '(A) together'.To use同士, attach it directly to the end of another noun, before expressing further information about that 'mutual' relationship. Alternatively, (noun+同士+の+noun) is also common, and expresses that noun (B) is a grouped form of noun (A).同士is used most often to express two different types of 'mutuality'. These are as follows:種類- Type. (A) is the same type as (B).関係- Relationship. (A) shares the same relationship as (B).Caution同士is most frequently used to highlight 'people', or 'living things' that share some type of relationship, rather than inanimate objects. An easy way to remember this is that the士kanji in this word means 'gentleman'. However, it may occasionally be seen in reference to inanimate objects as well.",
    "examples": [
      {
        "japanese": "これは弁護士同士の話しなので勝手に入って来ないで下さい。",
        "english": "This is a conversation between lawyers, so please don't barge in."
      },
      {
        "japanese": "家族同士で会話をするときはほとんど日本語です。",
        "english": "When we talk between family members, we mostly use Japanese."
      },
      {
        "japanese": "彼は友達同士の約束を破った。",
        "english": "He broke a promise that was made between friends."
      },
      {
        "japanese": "お互い大人同士なんだから、落ち着いて話し合おうよ。",
        "english": "We are fellow adults, so let's calm down and talk about this."
      },
      {
        "japanese": "あなたたちは本当に似たもの同士ね。",
        "english": "You guys are really similar (in personality)."
      },
      {
        "japanese": "それは兄弟同士の問題でしょ?私を巻き込まないで。",
        "english": "That is an issue between siblings, isn't it? Don't pull me into it."
      },
      {
        "japanese": "この糊は紙同士だとよくくっつきますがプラスチック同士だとあまりくっつかないです。",
        "english": "This glue sticks really well between paper, but between plastic, it does not stick well. (Natural, but not very common)"
      },
      {
        "japanese": "プロの格闘家同士の戦いは見ていて楽しい。",
        "english": "Watching a fight between two professional martial artists is fun. (Natural)"
      },
      {
        "japanese": "キリンは雄同士が喧嘩をする時互いに長い首で打ち合う。",
        "english": "When male giraffes fight among themselves they hit each other with their long necks."
      },
      {
        "japanese": "そのため、日本の企業会社同士の協力が以前よりも必要だ。",
        "english": "Because of that, cooperation among Japanese companies is needed more than before."
      },
      {
        "japanese": "負けた者同士で飲みに行こうよ！",
        "english": "Those among us who have lost, let's go drinking!"
      },
      {
        "japanese": "「だって」は家族や友達同士などで使う、くだけた表現なので、上司などとの話し合いのときは使わないでください。",
        "english": "'だって' is an informal expression used among family and friends, therefore please do not use it when discussing with superiors and the like."
      },
      {
        "japanese": "このように紐でページ同士を結びつけることができます。",
        "english": "You can connect pages together with a string like this."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/同士",
    "false_friends": [
      {
        "term": "〜のうち(で)",
        "meaning": "Of the, Among(st)",
        "kind": "synonym"
      },
      {
        "term": "のなかで",
        "meaning": "In, Among, Within",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-866"
  },
  "dojg": {
    "grammar_point": "同士",
    "description": "A sufﬁx that adds the meaning of “the same things/people”.",
    "meaning": "Each other; between/among (things/people of the same kind, group, etc.); together; with",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "94",
    "examples": [
      {
        "japanese": "(ksa).磁石のN極(またはS極)同士は反発する。",
        "english": "North poles (or south poles) of magnets repel each other."
      },
      {
        "japanese": "(ksb).高校時代の友達同士で海外旅行に行くことになった。",
        "english": "We’ve decided that we high school friends will travel abroad  together."
      },
      {
        "japanese": "(ksc).決勝戦はアルゼンチン選手同士の対決になった。",
        "english": "The ﬁnal turned out to be a battle between (two) Argentine  players."
      },
      {
        "japanese": "(ksd).このケーブルを使うと、パソコン同士を直接つないで高速ファイル転送をすることができる。",
        "english": "With this cable, you can connect personal computers directly  and transfer files (from one computer to another) at high speed."
      },
      {
        "japanese": "(a).タバコを吸う者同士は、何となく相手に親しみを感じやすい。",
        "english": "Smokers somehow ﬁnd it easier to feel close to each other."
      },
      {
        "japanese": "(b).面白いことに、隣り合った国同士は仲が悪いことが多い。",
        "english": "Interestingly, adjacent countries often have poor relations  with each other."
      },
      {
        "japanese": "(c).茨城沖で貨物船同士が衝突、二人死亡四人行方不明。",
        "english": "[Newspaper headline] Two cargo ships collide off (the coast of)  Ibaraki; two killed, four missing."
      },
      {
        "japanese": "(d).これは分子同士が衝突して起こる現象だ。",
        "english": "This is a phenomenon caused by molecules colliding (literally:  against each other)."
      },
      {
        "japanese": "(e).男同士で旅行に行ってもつまらない。",
        "english": "It’s boring if we travel together as a group of all men."
      },
      {
        "japanese": "(f).韓国では１９９７年に法律が変わり同姓同士でも自由に結婚できるようになった。",
        "english": "In South Korea the laws changed in 1997, and people with the  same family name can freely marry each other now."
      },
      {
        "japanese": "(g).この国ではいとこ同士の結婚は法的に認められている。",
        "english": "In this country, marriage between cousins is legally  recognized."
      },
      {
        "japanese": "(h).何も知らない者同士が話し合ってもいい答えは出てこない。",
        "english": "Discussions among those who don’t know anything will never lead  to a good solution."
      },
      {
        "japanese": "(i).日本ではバレンタインデーに女の子が男の子にチョコレートを渡して愛を告白するのが一般的になっていますが、アメリカでは夫婦や恋人同士はもちろんのこと、友達や家族同士でもこの日、愛を言葉にします。",
        "english": "It is common in Japan for girls to confess their love to boys  on St. Valentine’s Day by giving them chocolates. However, in America, not only  married couples and lovers but also friends and family members verbally express  their love to each other."
      },
      {
        "japanese": "(j).このタンパク質は細胞同士を結びつけるセメントのような役割をする。",
        "english": "This protein acts like cement in joining cells."
      },
      {
        "japanese": "(k).モンスター同士を戦わせるコンピュータゲームが間もなく発売される。",
        "english": "A computer game in which monsters fight against each other (literally:  which makes monsters fight against each other) will be on sale soon."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- Noun\n- 同士\n- 友達同士\n- The friends do something to/for each other/together",
    "part_of_speech": "Suffix",
    "related": "【Related Expression: と; 一緒に】",
    "antonym": "",
    "source": "resources/original/dojg/all/同士.yaml"
  }
}