{
  "grammar_point": "恐れがある",
  "rank": 8,
  "bunpro": {
    "grammar_point": "恐れがある",
    "jlpt": "N2",
    "meaning": "There is a risk or fear that, Be in danger of, Possibility of",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "硬い"
    },
    "writeup": "恐れがあるis a set phrase in Japanese that is used in a fairly literal sense to convey that 'there is a chance of (A)', or 'there is a fear of (A)'. This is a combination of the noun,恐れ 'fear', が, and the う-Verb ある 'to be'.恐れがあるwill be used when (A) is a negative outcome that may potentially occur in some particular situation, and is usually used to warn about being careful of something.恐れ is primarily used directly after verbs, or nouns followed by の.In most cases,恐れ carries the meaning of something that innately carries some kind of concern in relation to it, so depending on the context, alternative suitable translations could be 'concern', 'anxiety', 'worry', etc.Fun-fact - In addition to がある following恐れ, other common combinations are恐れを抱く'to carry the fear of (A)', or 'to bear the fear of (A)', and恐れが強まる'for the fear of (A) to strengthen', or 'for the fear of (A) to intensify'.",
    "examples": [
      {
        "japanese": "高温にすると爆発する恐れがあるので、直射日光が当たるところに置かないでください。",
        "english": "Since there is a possibility of explosion when this reaches high temperatures, please don't place this in direct sunlight."
      },
      {
        "japanese": "津波の恐れがある場合には、速やかに避難所まで避難してください。",
        "english": "When there is a risk of a tsunami, please rapidly evacuate to the evacuation area."
      },
      {
        "japanese": "若者が将来について恐れを抱くことは普通のことです。",
        "english": "It is normal for young people to have fears about the future."
      },
      {
        "japanese": "夏場の現場では熱中症の恐れが強まるので、作業員の方はこまめに水分補給と休憩を取るようにしてください。",
        "english": "Workers are encouraged to hydrate and take frequent breaks, as the risk of heat stroke increases at construction sites during summer."
      },
      {
        "japanese": "天気予報：「明日は、本州を中心に大雨の降る所がありそうです。関東から東北にかけては強風の恐れもあります。」",
        "english": "Weather forecast: 'It seems that the areas where rain will fall tomorrow are centered in Honshuu.There is also the possibility of strong winds from the Kanto to Tohoku areas.'"
      },
      {
        "japanese": "もし全住民が注射されなければ、伝染病が拡がる恐れがある。",
        "english": "If the entire population is not vaccinated, there is a fear that the contagious disease will spread."
      },
      {
        "japanese": "医者：「倒れたせいで肩に怪我をした恐れがあるので、レントゲンを撮ったほうがいいです。」",
        "english": "Doctor: 'You should have an X-ray since there is a risk that you injured your shoulder due to falling.'"
      },
      {
        "japanese": "この絵の具は中身が漏れる恐れがあるから袋に入れてください。",
        "english": "There is a risk that the contents of these paints will leak, so please place them in a bag."
      },
      {
        "japanese": "遠足に行ったのはいいが、急な天候の変化で帰れない恐れがある。",
        "english": "It is alright if you go on the trip, but there is the possibility of a sudden change in weather that would not let you return (home)."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/恐れがある",
    "false_friends": [
      {
        "term": "かねない",
        "meaning": "Might, Could be, Capable of, Possible",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-882"
  },
  "dojg": {
    "grammar_point": "恐れがある",
    "description": "A phrase that means “it is feared (that)\"",
    "meaning": "It is feared (that); we fear (that); we are worried/concerned (that); there is a fear/risk/chance/concern/etc.; can; could; may; it is possible (that); be in danger of",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "509",
    "examples": [
      {
        "japanese": "(ksa).台風の影響で、西日本は大雨の恐れがある。",
        "english": "Due to the typhoon (literally: the typhoon's inﬂuence), there  is a chance of heavy rain across Western Japan."
      },
      {
        "japanese": "(ksb).この戦争は第二のベトナム戦争になる恐れがある。",
        "english": "This war could become a second Vietnam War. (literally: There  is a risk that this war will become a second Vietnam War.)"
      },
      {
        "japanese": "(ksc).テロリストたちが入国した恐れがある。",
        "english": "There is concern that terrorists have entered the country."
      },
      {
        "japanese": "(ksd).測定誤差が大きい恐れがある。",
        "english": "We are worried that the measurement errors may be large."
      },
      {
        "japanese": "(kse).腫瘍が悪性である恐れがある。",
        "english": "The tumour may be malignant."
      },
      {
        "japanese": "(a).この地域の野性動物は絶滅の恐れがある。",
        "english": "The wild animals in this region are in danger of becoming  extinct."
      },
      {
        "japanese": "(b).M社は自社の携帯電話のいくつかの機種に発熱の恐れがあると発表した。",
        "english": "Company M announced that there is a risk that some of their  cell phone models may generate heat."
      },
      {
        "japanese": "(c).この薬品が目に入ると失明の恐れがあるので、保護眼鏡を着用して下さい。",
        "english": "This chemical can cause blindness (literally:  when it gets in an eye), so please wear protective goggles."
      },
      {
        "japanese": "(d).県は近く、がけ崩れなどの恐れがある場所で地形や土地利用状況などの調査を始める。",
        "english": "The prefectural government will soon begin an investigation of  the ground conﬁguration, land use, etc. in places where there is some fear of  landslides."
      },
      {
        "japanese": "(e).添付書類を不用意に開けるとウイルスに感染する恐れがある。",
        "english": "If you open attached ﬁles without paying close attention, you  risk infecting (your computer) with a virus."
      },
      {
        "japanese": "(f).この薬は副作用がないと言われているが、８週間以上続けて服用すると肝臓に害を及ぼす恐れがある。",
        "english": "This drug is said to have no side effects, but if you take it  for more than eight weeks straight, there is a risk that it will damage your  liver."
      },
      {
        "japanese": "(g).選手たちが試合の中止を知らないまま、まだ練習している恐れがある。",
        "english": "We're concerned that the players are still practicing, not  knowing that the game has been cancelled."
      },
      {
        "japanese": "(h).警視庁は、殺人容疑者のAが海外へ逃亡した恐れがあると発表した。",
        "english": "The Metropolitan Police Ofﬁce announced that there is some  concern that murder suspect A has escaped overseas."
      },
      {
        "japanese": "(i).ここのカフェテリアは食材が古い恐れがある。",
        "english": "The ingredients used (in the food) at this cafeteria may be  old."
      },
      {
        "japanese": "(j).この薬は胎児に有害である恐れがある。",
        "english": "This drug may be harmful to embryos."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Nounの\n- 恐れがある\n- 洪水の恐れがある\n- There is a fear of flood\n- 爆発の恐れがある\n- There is a fear of an explosion\n- (ii){V/Adjectiveい}informal\n- 恐れがある\n- {傷つける/傷つけた}恐れがある\n- There is a fear that someone/something will hurt/has hurt someone/something\n- (品物が){古い/古かった}恐れがある\n- There is a fear that something is/was old\n- (iii)Adjectiveなstem\n- {な/である/だった/であった}恐れがある\n- “Adjectiveなstemな” is rarely used\n- 不安定{な/である/だった/であった}恐れがある\n- There is a fear that something is/was unstable\n- (iv)Noun{である/だった/であった}\n- 恐れがある\n- 不良品{である/だった/であった}恐れがある\n- There is a fear that something is/was a defective product",
    "part_of_speech": "Phrase",
    "related": "【Related Expression: きけんせいがる; 心配がある; かのうせいがある; かもしれない】",
    "antonym": "",
    "source": "resources/original/dojg/all/恐れがある.yaml"
  }
}