{
  "grammar_point": "最中に",
  "rank": 4,
  "bunpro": {
    "grammar_point": "最中に",
    "jlpt": "N3",
    "meaning": "In the middle of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "While中にhighlights that something is in the process of happening (when used in relation to events/actions),最中にstrengthens that meaning further, to show that something is 'right in the middle of happening'. As the kanji最means 'utmost', we can see that the literal meaning is 'utmost middle'. This can be translated in a similar way to phrases like 'at the height of (A)', or 'in the midst of (A)', in English.When using最中に, a (B) part of the sentence will usually highlight something else that happened during (A), somehow interrupting or disturbing it.To use最中に, attach it to the end of the ている form of a verb, or a noun followed by の.Caution最中may also occasionally be used with adjectives, but this is uncommon. In these cases, the meaning is to be at the 'pinnacle' of whatever the adjective is describing (usually a feeling/emotion).",
    "examples": [
      {
        "japanese": "お祖母ちゃんの歯がお餅を食べている最中にポロっと取れた。",
        "english": "Grandma's tooth fell out right in the middle of eating mochi."
      },
      {
        "japanese": "仕事の最中に怪我をしたら、黙っていないですぐに責任者に電話をしてください。",
        "english": "If you get hurt in the middle of work, please don't keep it to yourself and notify your supervisor."
      },
      {
        "japanese": "今、犯人を追いかけている最中だ。",
        "english": "Right now, I'm in the midst of chasing a criminal."
      },
      {
        "japanese": "冗談でも悲しい最中に悪口を言われると、もっと悲しくなる。",
        "english": "Even if it is a joke, when someone says something mean when I am really sad, I get even more sad."
      },
      {
        "japanese": "一生懸命な最中に話し掛けられると、一気に集中力がなくなる。",
        "english": "When someone talks to me when I am highly concentrated, I suddenly lose my concentration."
      },
      {
        "japanese": "映画を見ている最中に彼は電話をした。",
        "english": "He made a phone call in the middle of watching the movie."
      },
      {
        "japanese": "家族と食事の最中に、携帯を触らないで。",
        "english": "Don't use your cellphone while in the middle of dinner with your family."
      },
      {
        "japanese": "朝の散歩の最中に、犬に噛まれた。",
        "english": "I was bitten by a dog while in the middle of my morning walk."
      },
      {
        "japanese": "寝ている最中に声をかけるのはやめてほしい。",
        "english": "I want you to stop trying to talk to me while I am sleeping."
      },
      {
        "japanese": "仕事の最中に旅行の話ばかりするのはやめてください。",
        "english": "Please stop talking about traveling while you are at work."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/最中に",
    "false_friends": [
      {
        "term": "〜ところに・〜ところへ",
        "meaning": "At the time, When, While, Timing",
        "kind": "synonym"
      },
      {
        "term": "途中に・途中で",
        "meaning": "On the way, Partway, In the middle of",
        "kind": "synonym"
      },
      {
        "term": "とき",
        "meaning": "When, At the time of",
        "kind": "synonym"
      },
      {
        "term": "ているところだ",
        "meaning": "In the process of doing ~ right now/at this moment",
        "kind": "synonym"
      },
      {
        "term": "中",
        "meaning": "During, While, Throughout, In the process of",
        "kind": "synonym"
      },
      {
        "term": "の間に",
        "meaning": "While, During, Between, Period",
        "kind": "synonym"
      },
      {
        "term": "うちに",
        "meaning": "While, During",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-887"
  }
}