{
  "grammar_point": "末(に)",
  "rank": 10,
  "dojg": {
    "grammar_point": "末(に)",
    "description": "A noun that indicates the end of a period or the time after long, hard mental or physical work.",
    "meaning": "After; at the end of",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "562",
    "examples": [
      {
        "japanese": "(ksa).さんざん迷った末に、友達の結婚祝いはコーヒーカップのセットを贈ることにした。",
        "english": "After much hesitation, I decided to give my friends a set of  coffee cups as a wedding present."
      },
      {
        "japanese": "(ksb).試行錯誤の末(に)、やっと車に使える燃料電池ができた。",
        "english": "After much trial and error, we ﬁnally made a fuel cell battery  that can be used in cars."
      },
      {
        "japanese": "(a).一週間悩んだ末(に)、家族をおいて単身赴任することにした。",
        "english": "After considering it for a week, I decided to leave my family  behind and transfer to my new job alone."
      },
      {
        "japanese": "(b).両者は8時間にわたる交渉の末に、ついに合意に達した。",
        "english": "After eight hours of negotiation, both parties ﬁnally came to  an agreement."
      },
      {
        "japanese": "(c).5時間を超える熱戦の末、タイガースが勝った。",
        "english": "After a close game lasting more than ﬁve hours, the Tigers won."
      },
      {
        "japanese": "(d).M銀行とU銀行の合併交渉は１年以上も難航した末、やっと成立した。",
        "english": "After more than a year of difﬁcult merger negotiations, M Bank  and U Bank ﬁnally came to an agreement."
      },
      {
        "japanese": "(e).下書きを20枚近く失敗した末に、やっとなんとか気に入った絵ができた。",
        "english": "After almost twenty bad sketches, I finally managed to draw one  I liked."
      },
      {
        "japanese": "(f).再就職は、苦労した末、過去のコンピュータ経験を評価してくれたIT関係の会社に決まりました。",
        "english": "After much trouble looking for a new job, I found one with an  IT-related company that valued my previous computer experience."
      },
      {
        "japanese": "(g).男は走って逃げ、最後には暴れ回って抵抗した末に逮捕された。",
        "english": "The man tried to run away and, in the end, he was arrested  after resisting violently."
      },
      {
        "japanese": "(h).この案は、各国の意見が衝突した末の「妥協の産物」だった。",
        "english": "This plan was a product of compromise, reached after working  through a clash of opinions between the countries."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Nounの\n- 末(に)\n- 今月の末(に)\n- At the end of this month\n- 交渉の末(に)\n- After negotiation\n- (ii)Vinformal past\n- 末(に)\n- よく考えた末(に)\n- After thinking hard",
    "part_of_speech": "Noun",
    "related": "【Related Expression: あと(で); のち(に); あげく(に)】",
    "antonym": "",
    "source": "resources/original/dojg/all/末(に).yaml"
  }
}