{
  "grammar_point": "次第",
  "rank": 5,
  "bunpro": {
    "grammar_point": "次第",
    "jlpt": "N3",
    "meaning": "As soon as",
    "meaning_warning": null,
    "details": {
      "Register": "Formal",
      "使用域": "敬語"
    },
    "writeup": "次第is anounthat is often translated in different ways, depending on what type of word it follows. In this lesson, we will look at the meaning associated with theconjunctive formof standard verbs, and the stem ofするverbs. Although it is a noun,次第may also be classified simply as asuffixin many cases.Basically,次第means 'next in sequence after (A)', and is often translated to 'as soon as (A)'.Fun FactOne of the most important things to keep in mind with次第, is that the literal meaning in almost every situation is 'determining sequence'. This is unlike any standard phrase in English, but simply expresses that (A) is what will govern (B). Let's look at how this translates with different word types.Verb次第- Verb determines the sequence of (B). Since a verb is not capable of making a choice, (A) simply 'happening' will result in (B).Living noun次第- Noun determines the sequence of (B). Since living things can make choices, (B) will depend on (A).Inanimate/abstract noun次第- Noun determines the sequence of (B). Since inanimate/abstract things cannot make choices, (A) will determine (B)'s course of action. (B) will usually involve some kind of decision.",
    "examples": [
      {
        "japanese": "用意が出来次第、僕に声をかけてください。",
        "english": "As soon as you get ready, please let me know."
      },
      {
        "japanese": "ミュージカルが終わり次第、連絡をください。",
        "english": "Please call me as soon as the musical ends."
      },
      {
        "japanese": "待ち合わせ場所に到着し次第、私に連絡してください。",
        "english": "Please give me a call as soon as you arrive at the meet up spot."
      },
      {
        "japanese": "計画が決まり次第、あなたに報告します。",
        "english": "I will notify you as soon as we decide on the plan."
      },
      {
        "japanese": "行くか行かないかは君次第だよ。",
        "english": "Whether you go or not will depend on you."
      },
      {
        "japanese": "6人も乗れるかは車のサイズ次第だね。",
        "english": "Whether or not 6 people can fit will depend on the size of the car."
      },
      {
        "japanese": "映画が終わり次第、連絡して。迎えに行くからね。",
        "english": "Let me know as soon as the movie is over because I'll go pick you up."
      },
      {
        "japanese": "宿題の答えが分かり次第、教えてください。",
        "english": "Please tell (teach) me the homework answers as soon as you know them."
      },
      {
        "japanese": "雨が止み次第、大会は再開される。",
        "english": "The rally will resume as soon as the rain stops."
      },
      {
        "japanese": "平日、妻の仕事が終わり次第、迎えに行ってあげている。",
        "english": "On weekdays, as soon as my wife finishes work, I pick her up."
      },
      {
        "japanese": "準備が出来次第出発しますよ。",
        "english": "We will depart as soon as you are ready."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/次第",
    "false_friends": [
      {
        "term": "なり",
        "meaning": "As soon as, The moment, When",
        "kind": "synonym"
      },
      {
        "term": "直ちに",
        "meaning": "At once, Immediately, As soon as",
        "kind": "synonym"
      },
      {
        "term": "たとたんに",
        "meaning": "The instant or moment, As soon as, Just as",
        "kind": "synonym"
      },
      {
        "term": "にかかわる",
        "meaning": "To relate to, To have to do with, Concerning, Depends on",
        "kind": "synonym"
      },
      {
        "term": "によって・による",
        "meaning": "By means of, According to, Depending on, Because of, Due to",
        "kind": "synonym"
      },
      {
        "term": "次第だ・次第で",
        "meaning": "Depending on, So",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-890"
  },
  "dojg": {
    "grammar_point": "次第",
    "description": "A conjunction/noun to express that an action indicated by a preceding verb or an action implied by a preceding noun is a prerequisite for another action.",
    "meaning": "As soon as; depend on",
    "level": "Intermediate",
    "level_symbol": "㊥",
    "level_japanese": "中級編",
    "page": "385",
    "examples": [
      {
        "japanese": "(ksa).大阪に着き次第、お電話を差し上げます。",
        "english": "As  soon as I get to Osaka, I will call you."
      },
      {
        "japanese": "(ksb).原稿は完成次第お送り致します。",
        "english": "I  will send my manuscripts as soon as they are completed."
      },
      {
        "japanese": "(ksc).世の中で成功するかしないかはあなたの努力次第ですよ。",
        "english": "Whether  you succeed in the world or not depends on your efforts."
      },
      {
        "japanese": "(a).夫は仕事が終わり次第、毎日まっすぐ帰宅します。",
        "english": "My  husband comes straight home every day, as soon as he has finished his work."
      },
      {
        "japanese": "(b).空港から電話があり次第、お迎えに参ります。",
        "english": "I  will go to pick you up as soon as you call me from the airport."
      },
      {
        "japanese": "(c).山岸先生がいらっしゃり次第、会議を始めたいと思います。",
        "english": "As  soon as Professor Yamagishi comes here I'd like to begin our meeting."
      },
      {
        "japanese": "(d).東大を卒業次第、京大の大学院に入学するつもりだ。",
        "english": "Upon  graduation from the University of Tokyo, I intend to enter the Graduate School  of Kyoto University."
      },
      {
        "japanese": "(e).お尋ねの件は、判明次第、ご連絡申し上げます。",
        "english": "On  the matter you have inquired about, I will inform you as soon as I find out."
      },
      {
        "japanese": "(f).レセプションが終了次第、晩餐会を始めます。",
        "english": "As  soon as the reception is finished we will start the dinner party."
      },
      {
        "japanese": "(g).就職はコネ次第ですよ。",
        "english": "Finding  employment depends on connections."
      },
      {
        "japanese": "(h).「地獄の沙汰も金次第(だ)」ということわざを知っていますか。",
        "english": "Do  you know the proverb &quot;Even affairs in hell depend on money&rdquo;?"
      },
      {
        "japanese": "(i).ご注文次第で、どんな物でも料理致します。",
        "english": "Depending  on your orders, I will cook you anything you like."
      },
      {
        "japanese": "(j).条件次第では、その仕事を引き受けたいと思います。",
        "english": "Depending  on the employment terms I would like to accept that job."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Vます\n- 次第\n- 読み次第\n- As soon as someone has read something\n- 帰り次第\n- As soon as someone has returned\n- Exception\n- いらっしゃり次第\n- As soon as someone comes/goes there\n- おっしゃり次第\n- As soon as someone says it\n- なさり次第\n- As soon as someone does something\n- (ii)VN\n- 次第\n- 帰国次第\n- As soon as someone comes back to his/her country\n- 到着次第\n- As soon as someone/something arrives\n- (iii)(Xは)Noun\n- 次第だ/で\n- (農業は)天気次第だ\n- Farming depends on the weather\n- 給料次第で\n- Depending on the salary",
    "part_of_speech": "Conjunction/Noun",
    "related": "【Related Expression: による; たらすぐ】",
    "antonym": "",
    "source": "resources/original/dojg/all/次第.yaml"
  }
}