{
  "grammar_point": "決して〜ない",
  "rank": 4,
  "bunpro": {
    "grammar_point": "決して〜ない",
    "jlpt": "N3",
    "meaning": "Never, By no means",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "決して by itself is the て form of the verb決する 'to determine'. However決して is special in that it is considered to be a stand-aloneadverb. As an adverb, it carries the meaning of 'decidedly', or 'assuredly', and is used in sentences that contain ない, in order to convey 'never (A)', 'under no circumstances (A)' or 'by no means (A)'.Like many other adverbs in Japanese,決して can appear at the beginning of a sentence, or directly before the word it is modifying (which will be in its ない form).While the translation is 'never', the literal meaning of決して is 'decidedly not (A)', or 'assuredly not (A)', simply emphasizing the negative point within a sentence.Caution決して may also sometimes be paired with other structures that are not specifically negative, the primary example of this beingものか(a grammar point that we will learn about later).ものかstrongly confirms a statement as being something that does not exist/will not be done.",
    "examples": [
      {
        "japanese": "この道はものすごく危ないので、決してグループから離れないで下さい。",
        "english": "This road is very dangerous, so please under no circumstances leave the group."
      },
      {
        "japanese": "決して痛くないとは言えないです。",
        "english": "By no means, can I say that it does not hurt."
      },
      {
        "japanese": "この乗り物は決して危険ではないです。",
        "english": "This ride is by no means dangerous."
      },
      {
        "japanese": "この子は決して悪い人ではないけど、時々失礼なときがある。",
        "english": "By no means do I think that this person is bad, but they are rude at times."
      },
      {
        "japanese": "この宝石を決して渡すものか！",
        "english": "There is no way I will hand over this treasure."
      },
      {
        "japanese": "お前に決してお金を貸すものか！",
        "english": "There is no way I will lend you money."
      },
      {
        "japanese": "トムは決して頭が悪いわけではない。単なる怠け者なだけだ。",
        "english": "Tom is by no means dumb, he is simply lazy."
      },
      {
        "japanese": "何回友達に行こうと誘われても、決して行かない。",
        "english": "No matter how many times my friends pressure me to go, I will never go."
      },
      {
        "japanese": "嘘をついたら決してゆるさない。",
        "english": "I will never forgive you if you lie to me."
      },
      {
        "japanese": "何があっても、決して諦めない。",
        "english": "I will never give up, no matter what happens."
      },
      {
        "japanese": "彼は決して妥協しない人だ。",
        "english": "He is a person that never compromises."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/決して-ない",
    "false_friends": [
      {
        "term": "ことはない",
        "meaning": "There is no need to, Never happens",
        "kind": "synonym"
      },
      {
        "term": "すこしも〜ない",
        "meaning": "Not even a little, Not at all, Not in the least, Never",
        "kind": "synonym"
      },
      {
        "term": "全く〜ない",
        "meaning": "Not~at all",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-894"
  }
}