{
  "grammar_point": "済む",
  "rank": 10,
  "dojg": {
    "grammar_point": "済む",
    "description": "A verb that means “to be finished; to do (in the sense of being enough)”.",
    "meaning": "Take/cost/need/etc. only ~; do/manage (without/only with); get by/get away (without/only with); be let off (without/only with); be enough (if); be all right (if); not to have to: there is no need for",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "565",
    "examples": [
      {
        "japanese": "(ksa).ちょっと顔を見せるだけで済むと思う。",
        "english": "I think just showing up for a while will be enough."
      },
      {
        "japanese": "(ksb).面接は20分で済んだ。",
        "english": "The interview took only 20 minutes."
      },
      {
        "japanese": "(ksc).あまり難しい日本語ではなかったので、辞書なしで済んだ。",
        "english": "Because the Japanese (in it) was not very difﬁcult, I managed (to  read it) without a dictionary."
      },
      {
        "japanese": "(ksd).旅行先ではどこでもクレジットカードが使えたので、現金がなくても済んだ。",
        "english": "Everywhere I travelled I was able to use my credit card, so I  could travel without cash."
      },
      {
        "japanese": "(kse).これは黙っていて済む問題ではない。",
        "english": "This is not the kind of problem where you can get away with  staying silent."
      },
      {
        "japanese": "(ksf).奨学金をもらったので、お金を借り{ずに/なくて(も)/ないで}済むと思う。",
        "english": "I've been given a scholarship, so I think I can get by without  borrowing money."
      },
      {
        "japanese": "(ksg).解約したい時は、入会金だけ損をすれば済む。",
        "english": "When you want to cancel the agreement, all you will lose is the  enrolment fee."
      },
      {
        "japanese": "(a).この程度の翻訳なら3日で済むだろう。",
        "english": "Three days should be enough for a translation like this."
      },
      {
        "japanese": "(b).この方法だと今のシステムの大部分がそのまま使えるので、新たな投資が最小で済む。",
        "english": "Because this approach would allow us to use most of the current  system, our new investment will be minimal (literally: we could get by with a  minimal investment)."
      },
      {
        "japanese": "(c).徒歩あるいは自転車で済むところへ車で行く無駄をしていませんか。",
        "english": "Aren't you being wasteful by driving places where you could  walk or go by bicycle?"
      },
      {
        "japanese": "(d).15キロオーバーだったが、幸い警告だけで済んだ。",
        "english": "It was 15 km/hr above (the speed limit), but fortunately I got  off with just a warning."
      },
      {
        "japanese": "(e).こんな大きな失敗をして「ごめん」「知らなかった」では済まない。",
        "english": "You can't excuse a major mistake like this just by saying,  \"Sorry,\" or \"I didn't know.\""
      },
      {
        "japanese": "(f).電動自転車はモーターの力だけで動くことはないから、法律上「自転車」とされ、運転免許もヘルメットもなしで済む。",
        "english": "Because electric bicycles are not powered solely by motor, the  law classiﬁes them as bicycles, so you can ride them without either a driver's  license or a helmet."
      },
      {
        "japanese": "(g).ここからは地下鉄でどこへでも行けるから車がなくても済む。",
        "english": "From here we can go anywhere by subway, so we don't need a car."
      },
      {
        "japanese": "(h).謝って済むことと済まないことがある。",
        "english": "Sometimes an apology is not enough. (literally: There are  things that can be settled by apologizing and things that cannot.)"
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i)Number(+Counter)で\n- 済む\n- ２０ドルで済む\n- Something costs only 20 dollars\n- (ii)Noun {(だけ)/なし}で\n- 済む\n- 電話(だけ)で済む\n- (just) a telephone call is enough\n- 検査なしで済む\n- Not have to have/give an examination; do without an exam\n- (iii)Nounがなくても\n- 済む\n- 携帯電話がなくても済む\n- Manage without a cell phone\n- (iv){Vて/Adjectiveいstem}\n- くて済む\n- 謝って済む\n- Get away with just apologising\n- 安くて済む\n- Something costs only a little\n- (v)Vinformalだけで\n- 済む\n- 行くだけで済む\n- Just going is enough; get by with just going\n- (vi)Vnegative {ずに/なくて(も)/ないで}\n- 済む\n- Exception: する→せずに\n- 行か{ずに/なくて(も)/ないで}済む\n- Do not have to go; be all right if someone doesn’t go\n- (vii){Vconditionalば/Vinformal past}ら\n- 済む\n- {借りれば/借りたら}済む\n- Be all right if someone borrows something",
    "part_of_speech": "Verb",
    "related": "【Related Expression: 済ませる】",
    "antonym": "",
    "source": "resources/original/dojg/all/済む.yaml"
  }
}