{
  "grammar_point": "的",
  "rank": 4,
  "bunpro": {
    "grammar_point": "的",
    "jlpt": "N3",
    "meaning": "~ly・~like・~al, Typical",
    "meaning_warning": "adjectivization",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "的 is a 接語尾 (suffix) in Japanese that has two primary uses. The first use is very similar to 'as' or 'for' in English, and means 'considering/within the category of (A), (B)'. The second use primarily relates to people, and will be covered later. As a single word, 的 is often likened to adjective endings such as '~ly', '~like', and '~al'.To use 的 , attach it to the end of a noun that you want to express as being the focus point of either a verb or a noun that will come later in the sentence. When describing a noun, 的 will be followed by な (meaning that it becomes a な-Adjective ). When describing a verb, it will be followed by に (making it an adverb).Fun FactThe second common use of 的 is specifically with the names of people, and highlights that (B) is something that is being considered in regard to (A). (A) being the person mentioned. This may be used either positively or negatively. In English, this is similar to 'that's so (A)', or 'just what you'd expect of (A)'.Fun FactThe easiest way to understand and use 的 correctly almost all the time, is by knowing another common suffix , 圏 . Let's look at how these suffixes compare:圏 - Occurring in the sphere of (A), (B). (B) only happens inside of (A).的 - Speaking in the sphere of (A), (B). (B) can only be said within the sphere of (A).As we can see here, when you want to convey something that can be said from a specific standpoint, 的 will be a logical choice.",
    "examples": [
      {
        "japanese": "リサ的にはどう思う?",
        "english": "In a Lisa-way, what do you think? (What is your opinion)"
      },
      {
        "japanese": "それは本当にタナカ的な考え方だな。",
        "english": "That is such a Tanaka-way of thinking."
      },
      {
        "japanese": "彼は英語圏の国に引っ越しました。",
        "english": "He moved to an English speaking country. (A country within the English speaking world)"
      },
      {
        "japanese": "彼女は国民的アイドルです。",
        "english": "She is a national star. (Speaking in terms of the nation, she is a star)"
      },
      {
        "japanese": "時期的に雨が降りやすい。",
        "english": "Typical of the season, it is more likely to rain."
      },
      {
        "japanese": "彼はいつも自発的に掃除をしてくれます。",
        "english": "He always spontaneously cleans for me."
      },
      {
        "japanese": "感動的な映画だった。",
        "english": "It was an emotional movie."
      },
      {
        "japanese": "なんだって肯定的な意見と否定的な意見がある。",
        "english": "There are both positive and negative opinions at any issue."
      },
      {
        "japanese": "あの台風は破壊的だった。",
        "english": "That typhoon was destructive."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/的",
    "false_friends": [
      {
        "term": "らしい ①",
        "meaning": "Seems like, Apparently, I heard",
        "kind": "synonym"
      },
      {
        "term": "っぽい",
        "meaning": "-ish, -like, Characteristic of, Typical of, Tendency to",
        "kind": "synonym"
      },
      {
        "term": "ぎみ",
        "meaning": "Looking, Feeling a little, Touch of, Tending to, Slightly",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-898"
  }
}