{
  "grammar_point": "結果・の結果",
  "rank": 6,
  "bunpro": {
    "grammar_point": "結果・の結果",
    "jlpt": "N2",
    "meaning": "As a result of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "結果'result' is a noun in Japanese that is often seen paired with the past form of verbs, or with nouns followed by の. This grammar structure can be translated as 'as a result of (A), (B)', and simply indicates (A) as being the cause for how something ended up.Caution - Unlikeあげく, a similar grammar point that is used for highlighting causes,結果may highlight both positive and negative results, whileあげくtends to only be used when the outcome is negative.",
    "examples": [
      {
        "japanese": "お酒を飲んで運転した結果、電柱にぶつかって免許を取り消された。",
        "english": "As a result of drinking and driving, I drove into a telephone pole and my license was revoked."
      },
      {
        "japanese": "みんなが努力した結果、大会で優勝することができた。",
        "english": "As a result of everyone doing their best, we were able to win the competition."
      },
      {
        "japanese": "話し合いの結果、親が学費を払ってくれることになりました。",
        "english": "As a result of the discussion, it has been decided that my parents are going to pay my tuition."
      },
      {
        "japanese": "調査の結果、この土地の土は汚染されていることが確認できました。",
        "english": "As a result of the examination, we were able to confirm that the soil on this property is contaminated."
      },
      {
        "japanese": "仕事で頑張った結果、昇進する事が決まった。",
        "english": "As a result of my hard work, I'm getting promoted."
      },
      {
        "japanese": "パートナーと話し合いをした挙句、離婚することになった。",
        "english": "After having a discussion with my partner, we have decided to get divorced."
      },
      {
        "japanese": "国民が反対した結果、増税の提案は破棄された。",
        "english": "As a result of public opposition, the tax increase proposal was abandoned."
      },
      {
        "japanese": "研究の結果、新しい粒子が見つかった。",
        "english": "As a result of research, new particles were discovered."
      },
      {
        "japanese": "家族とよく相談した結果、一人暮らしを決めたんだ。",
        "english": "As a result of discussion with family, I decided to live alone."
      },
      {
        "japanese": "調査の結果、容疑者は無罪となった。",
        "english": "As a result of the investigation, the suspect has been found not guilty."
      },
      {
        "japanese": "宿題を先延ばしにした結果、当日の明け方までかかってしまった。",
        "english": "As a result of putting off homework until late, it took me until dawn of the day it was due to finish."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/結果・の結果",
    "false_friends": [
      {
        "term": "その結果",
        "meaning": "As a result",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-905"
  }
}