{
  "grammar_point": "聞こえる",
  "rank": 1,
  "bunpro": {
    "grammar_point": "聞こえる",
    "jlpt": "N4",
    "meaning": "To be audible, To sound (like), (Can) hear, To be heard",
    "meaning_warning": "聞こえる was originally a conjugation of 聞く、but nowadays it is treated as a standalone intransitive verb",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "聞こえるis a verb that is often used to describe things that can be heard, or the way in which something is heard. Because of this, the most common translations of this verb are 'to be audible', or 'to sound like (A)'.聞こえるis an intransitive verb, and literally means 'to give off sound'.When using聞こえる, (A) will always be followed byが. (A) is considered to be the 'source' of the sound (a noun). However, the 'way that something sounds' will be marked adverbially. This means that anい-Adjectivewill be changed to its く form, andな-Adjectives/nouns will be followed byに.Fun FactThe primary difference between聞こえる, and聞ける(thepotentialform of聞く), is that聞こえるis used to identify things that do not require the active concentration of the listener to be heard. In other words, ambient noise. However,聞けるis used when the speaker is trying to concentrate on some specific sound, and refers to their 'ability' to hear it.",
    "examples": [
      {
        "japanese": "車の音が聞こえる。",
        "english": "I can hear the sound of a car."
      },
      {
        "japanese": "アニメに出てくる女の子の声は可愛く聞こえるけど、声優はいつもおばさんだ。",
        "english": "Voices of girls that appear in anime sound cute, but the voice actor is always an old lady."
      },
      {
        "japanese": "こう歌うと上手に聞こえる。",
        "english": "If you sing like this, you will sound good."
      },
      {
        "japanese": "電車の音のように聞こえるけどあれは隣の人のいびきだ。",
        "english": "It sounds like the noise from a train, but it's the neighbor's snoring."
      },
      {
        "japanese": "静かな部屋にいると聞こえるよ。",
        "english": "You can hear it if you are in a quiet room. (Without effort)"
      },
      {
        "japanese": "静かな部屋にいると聞けるよ。",
        "english": "If you are in a quiet room, you can hear it. (If you focus and try to hear the sound)"
      },
      {
        "japanese": "「西山さんは生まれつき耳が聞こえないんです。」",
        "english": "'Nishiyama has been deaf since birth.'"
      },
      {
        "japanese": "隣のせきくんはうるさすぎるわよ。彼が音楽を聴くときいつもあたしのアパートに聞こえるわ！",
        "english": "My neighbor Seki is too loud! Whenever he listens to music, I can hear it in my flat!"
      },
      {
        "japanese": "「教師の声が小さすぎるから何も聞こえないんだよ。」",
        "english": "'The teacher is too quiet, so I cannot hear anything.'"
      },
      {
        "japanese": "「外がうるさいからテレビの音がよく聞こえない。」",
        "english": "'Since it is loud outside, I cannot hear the TV very well.'"
      },
      {
        "japanese": "「滝の音はすごく大きくてここからでも聞こえます！」",
        "english": "'The sound of the waterfall is really loud, and we can hear it even from here!'"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/聞こえる",
    "false_friends": [
      {
        "term": "れる・られる (Potential)",
        "meaning": "To be able, Can (Potential)",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-907"
  },
  "dojg": {
    "grammar_point": "聞こえる・きこえる",
    "description": "Something is passively and spontaneously audiable.",
    "meaning": "Audible; (can) hear; it sounds",
    "level": "Basic",
    "level_symbol": "㊦",
    "level_japanese": "基本",
    "page": "188",
    "examples": [
      {
        "japanese": "(ks).私(に)は鶯の声がよく聞こえる・聞こえます。",
        "english": "To me the cries of a nightingale are clearly audible. / I can clearly hear the cries of a nightingale."
      },
      {
        "japanese": "(a).その音は小さ過ぎて聞こえない。",
        "english": "That sound is too weak and is not audible."
      },
      {
        "japanese": "(b).大山さんの声は大きいので隣の部屋の人にもよく聞こえる。",
        "english": "Mr. Oyama's voice is so loud that people in the neighbouring rooms can hear him."
      },
      {
        "japanese": "(c).私にはお寺の鐘の音が聞こえたが、弟には聞こえなかった。",
        "english": "I could hear the sound of the temple bell, but my younger brother couldn't."
      },
      {
        "japanese": "(d).テーラーさんの作った文は変に聞こえる。",
        "english": "The sentences which Mr. Taylor made sound strange."
      }
    ],
    "writeup": "## 【Related Expression】",
    "formation": "##",
    "part_of_speech": "Verb (Group 2)",
    "related": "【Related Expression: 聞ける】",
    "antonym": "",
    "source": "resources/original/dojg/all/聞こえる・きこえる.yaml"
  }
}