{
  "grammar_point": "要するに",
  "rank": 6,
  "bunpro": {
    "grammar_point": "要するに",
    "jlpt": "N2",
    "meaning": "To sum up, In summary, In short",
    "meaning_warning": "要するに can only take an initial position in the sentence.",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "要するにis an expression in Japanese used to highlight important information in a similar way to 'to sum up', 'in summary', or 'in short' in English. It is a combination of the する-Verb要'to need', or 'to require', and に. Literally it means something similar to 'as for what's necessary (A)'.This is a phrase that will only ever take the initial position in a sentence, before expressing a condensed version of what has previously been said.",
    "examples": [
      {
        "japanese": "要するに、あなたは履歴書に嘘を書いたと言う事ですね。",
        "english": "In short, this means that you lied on your resume, doesn't it?"
      },
      {
        "japanese": "要するに、小麦が入っている食べ物は食べれないと言う事ですね?",
        "english": "So, in summary, I can't eat any food that has wheat in it?"
      },
      {
        "japanese": "要するに、俺はあいつに使われていたと言うことだ。",
        "english": "In short, I was being used by him."
      },
      {
        "japanese": "行員：「要するにお金が足りない場合デビットカードを使えないということです。」",
        "english": "Bank clerk: 'In summary, if there is not enough money on the debit card, you won't be able to use it.'"
      },
      {
        "japanese": "車の職人：「要するに部品を替えるよりも機械を買い替えればいいってことだ。」",
        "english": "Car mechanic: 'In short, it's better to replace the whole machine, rather than just parts.'"
      },
      {
        "japanese": "要するに何でもいいよね?",
        "english": "In short, it is all the same to you?"
      },
      {
        "japanese": "要するに、農薬は一切使ってはいけないということですよね?",
        "english": "In summary, without exception, you must not use agricultural chemicals, right?"
      },
      {
        "japanese": "要するに、能率の悪い仕事は引き受ける気がないんですね。",
        "english": "In summary, you don't feel like undertaking jobs that are inefficient, right?"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/要するに",
    "false_friends": [
      {
        "term": "つまり",
        "meaning": "In short, To sum up, In other words",
        "kind": "synonym"
      },
      {
        "term": "即ち",
        "meaning": "In other words, That is, Namely",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-908"
  }
}