{
  "grammar_point": "言うまでもない",
  "rank": 7,
  "bunpro": {
    "grammar_point": "言うまでもない ②",
    "jlpt": "N3",
    "meaning": "It goes without saying, It is needless to say, Of course, Obviously",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "Unlike は言うまでもない, which usually comes after other phrases,言うまでもない tends to come at the beginning. It is a structure that combines the う - Verb言う, two (2)adverbial particlesまで and も, and theい-Adjectiveない. This is regularly translated as 'it goes without saying that (A)', or 'it is needless to say (A)', where (A) is whatever comes later in the sentence.言うまでもないis often followed directly by ことだが, が, けど, and similar expressions, to add the nuance of 'but'.Fun Fact言うまでもないis a polite way to express that something is 'obvious', without unintentionally sounding arrogant.",
    "examples": [
      {
        "japanese": "言うまでもないことだが、毎日漢字の勉強をすれば、どんどん漢字を覚えることができる。",
        "english": "It goes without saying that if you practice kanji everyday, you will steadily memorize them."
      },
      {
        "japanese": "電化製品を使っている間、言うまでもないが、濡れた手や水の周りで使うのは危険だ。",
        "english": "While you are using electronics, it is needless to say that you should not use them with wet hands or around water."
      },
      {
        "japanese": "言うまでもないけど、君に会えて良かった。",
        "english": "It goes without saying, but I am glad that I met you."
      },
      {
        "japanese": "言うまでもないことだが、お酒を飲んで運転をしてはいけない。",
        "english": "Obviously,  you should not drink and drive."
      },
      {
        "japanese": "A：「あのさ近づいちゃいけない動物っているの?」B：「う〜ん....ライオンやヘビみたいなのは言うまでもないけどカバも危ないよ。」",
        "english": "A: 'Hey, are there any animals I shouldn't approach?'B: 'Hmm, lions and snakes go without saying, but hippos are also dangerous.'"
      },
      {
        "japanese": "言うまでもないことだが、文章を読みやすくするために、括弧は使われている。",
        "english": "It goes without saying that brackets are used to make reading easier."
      },
      {
        "japanese": "さだおさんの妻のえみさんは英語は言うまでもなく、韓国語も話せます。",
        "english": "Sadao-san's wife, Emi-san can speak Korean, not to mention English."
      },
      {
        "japanese": "言うまでもないけど、それが恋だった。",
        "english": "It goes without saying, but that was love."
      },
      {
        "japanese": "言うまでもないことだが、アルコールを飲んで泳いだら、溺れて死んでしまうかもしれない。",
        "english": "It goes without saying that if you drink and go swimming, then you might drown."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/言うまでもない2",
    "false_friends": [
      {
        "term": "は言うまでもない ①",
        "meaning": "It goes without saying (that), (It is) needless to say, I don't need to remind you",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-910"
  },
  "dojg": {
    "grammar_point": "言うまでもない",
    "description": "A phrase indicating that what the speaker/writer expresses is generally known but that he/she presents it as a reminder.",
    "meaning": "It is needless to say that ~; needless to say; it goes without saying",
    "level": "Advanced",
    "level_symbol": "㊤",
    "level_japanese": "上級編",
    "page": "167",
    "examples": [
      {
        "japanese": "(ksa).寿司が日本の代表的な料理であることは言うまでもない。",
        "english": "It goes without saying that sushi is representative of Japanese  cuisine."
      },
      {
        "japanese": "(ksb).言うまでもなく、日本の社会は世界一の高齢化社会になっている。",
        "english": "That Japan has become the most rapidly aging society in the  world goes without saying."
      },
      {
        "japanese": "(a).少子化が日本の社会を変えていくことは言うまでもない。",
        "english": "It goes without saying that the shrinking population of  children will change Japanese society."
      },
      {
        "japanese": "(b).「アジアの人々は貧しい」「貧しいのは可哀想」「開発援助しなくては」という固定観念が有害なのは言うまでありません。",
        "english": "The set of ﬁxed ideas that \"Asians are poor,” \"Being poor is  pitiable,” and \"We should provide development assistance,” is, needless to say,  harmful."
      },
      {
        "japanese": "(c).二人はパーティーで会って、すぐ意気投合しました。そのあと毎日のようにデートをしたのは言うまでもありません。",
        "english": "The two met at a party, and right away they hit it off. I  hardly need to mention that after that they went out on a date almost every  day."
      },
      {
        "japanese": "(d).オープンネットワークコンピューティング環境では、日々増大するネットワークデータをいかに敏速にかつ効率よくバックアップするかが重要であることは言うまでもありません。",
        "english": "Needless to say, in an open network computing environment, it  is important how quickly and effectively you back up the continually expanding  network data."
      },
      {
        "japanese": "(e).言うまでもありませんが、大学の成績の優秀な学生が社会で成功するとは限りません。",
        "english": "Needless to say, students whose grades in college were superb  do not always succeed in society."
      },
      {
        "japanese": "(f).いまさら言うまでもなく、地球の温暖化は生態系に悪影響をもたらしている。",
        "english": "It's obvious now, but global warming is having an adverse  effect on the ecosystem."
      },
      {
        "japanese": "(g).菜穂子はとびきりの美人でもなかったが、誰とでもにこやかに話し、いつも溌溂としていた。言うまでもないことだが、彼女の周りには人が自然に集まり、職場のみんなにも好かれていた。",
        "english": "Nahoko was not especially beautiful, but she had a smile for  everybody and was always cheerful. Needless to say, people spontaneously  gathered around her, and everybody at her ofﬁce loved her."
      }
    ],
    "writeup": "##",
    "formation": "## \n\n- (i){V/Adjectiveい} informal+Nominalは\n- 言うまでもない。\n- {買う/買った}{の/こと}は言うまでもない。\n- Needless to say, someone will buy/bought something\n- つまらない{の/こと}は言うまでもない。\n- It goes without saying that something is boring\n- つまらなかった{の/こと}は言うまでもない。\n- It goes without saying that something was boring\n- (ii)Adjective な stem{な/である/だった/であった}\n-+Nominalは言うまでもない。\n- 立派{な/である/だった/であった}{の/こと}は言うまでもない。\n- It goes without saying that something is/was magnificent\n- (iii)Noun{な/である/だった/であった}\n- のは言うまでもない。\n- 教授{な/である/だった/であった}のは言うまでもない。\n- It goes without saying that someone is/was a professor\n- (iv)Noun{である/だった}\n- ことは言うまでもない。\n- 天才{である/だった}ことは言うまでもない。\n- Needless ot say, he is/was a genius\n- (v)言うまで\n- {なく/ない(ことだ)が}、Sentence。\n- 言うまで{なく/ない(ことだ)が}、日本は島国だ。\n- Needless to say, Japan is an island country",
    "part_of_speech": "Phrase",
    "related": "",
    "antonym": "",
    "source": "resources/original/dojg/all/言うまでもない.yaml"
  }
}