{
  "grammar_point": "途中に・途中で",
  "rank": 6,
  "bunpro": {
    "grammar_point": "途中に・途中で",
    "jlpt": "N2",
    "meaning": "On the way, Partway, In the middle of",
    "meaning_warning": null,
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "With途中meaning 'on the way', the addition of either thecase marking particleに or で will indicate that something is either being done 'on the way to (A)', 'partway through (A)' or 'in the middle of (A)'.途中may be seen after verbs in their standard form, or nouns followed by の.As always, に will put more emphasis on the time or duration of (A), while で will put further emphasis on the process of (A) being the cause of (B), or being used as an opportunity to do (B). Let's take a look at both.The meanings of で and に in regard to this particular grammar point can overlap quite often, so it may be necessary to see many examples before the slight difference in nuance becomes apparent.",
    "examples": [
      {
        "japanese": "待ち合わせ場所に向かっている途中に、「ごめん、やっぱり今日行けないかも」と友達からメールが来た。",
        "english": "On the way to the meeting place, I received a text from a friend saying, 'Sorry, I might not be able to make it today after all'."
      },
      {
        "japanese": "授業の途中に校長先生から呼び出された時はビクッとした。",
        "english": "I was a bit startled when the principal called me out in the middle of class."
      },
      {
        "japanese": "会社から帰る途中で変なおじさんに話しかけられた。",
        "english": "On my way home from work, a strange man tried to talk to me."
      },
      {
        "japanese": "ミーティングの途中で社長が倒れて、会社中がパニックになった。",
        "english": "The president collapsed in the middle of a meeting and everyone in the whole company panicked."
      },
      {
        "japanese": "旅の途中で迷っていたら、通行人が案内してくれた。",
        "english": "In the middle of a trip, I lost my way, and a passerby gave me directions."
      },
      {
        "japanese": "面接の途中でリクルーターはいきなり笑い始めた。",
        "english": "In the middle of an interview, the recruiter suddenly started laughing."
      },
      {
        "japanese": "朝ご飯を作っている途中で電話が鳴った。",
        "english": "In the middle of making breakfast, the telephone rang."
      },
      {
        "japanese": "シーズンの途中で引退会見をするのは微妙だ。",
        "english": "Holding a retirement press conference in the middle of the season is questionable."
      },
      {
        "japanese": "司会の途中でトイレに行きたくなって困った。",
        "english": "I found myself in a pickle when I had to go to the bathroom in the middle of leading a meeting."
      }
    ],
    "url": "https://bunpro.jp/grammar_points/途中に・途中で",
    "false_friends": [
      {
        "term": "最中に",
        "meaning": "In the middle of",
        "kind": "synonym"
      },
      {
        "term": "がけに",
        "meaning": "On the way to, As you go",
        "kind": "synonym"
      },
      {
        "term": "ているところだ",
        "meaning": "In the process of doing ~ right now/at this moment",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-915"
  }
}