{
  "grammar_point": "陸に〜ない",
  "rank": 6,
  "bunpro": {
    "grammar_point": "陸に〜ない",
    "jlpt": "N2",
    "meaning": "Not well or properly, Not much or enough, Barely, Hardly",
    "meaning_warning": "Other forms - 碌に",
    "details": {
      "Register": "Standard",
      "使用域": "一般"
    },
    "writeup": "When the adverb陸に 'satisfactorily' appears in ない sentences, it indicates that (A) is 'not satisfactory', 'not enough', or 'not being done properly'. This grammar pattern appears at the beginning of phrases, before the (B) part of the sentence will include a ない word, often a verb in its potential form.Whileろくにwill often appear in the kanji form, it is also common to see this structure in hiragana alone. Alternatively,碌にmay also sometimes be seen, but this particular kanji is ateji (a kanji used purely for its pronunciation, not its meaning).This particular grammar point often has the nuance of something that is being done without sufficient effort, or is half-baked.Fun-fact -陸comes from the kanji meaning 'land', and is used with the reading of ろく when the nuance is flatness, correctness, or seriousness.",
    "examples": [
      {
        "japanese": "息子は英語をろくに話せないのに、アメリカにひとりで行くそうだ。大丈夫かな。",
        "english": "Apparently my son is going to the States, even though he can barely speak English. I hope he will be okay."
      },
      {
        "japanese": "あの人はろくに仕事も出来ないのに、偉そうな態度をとるから会社中で嫌われている。",
        "english": "He is disliked by everyone in the company because he has an arrogant attitude even though he can barely do his job."
      },
      {
        "japanese": "仕事が忙しすぎて、ここ最近、ろくに友達にも会えてない。",
        "english": "Because I am so busy, I barely have time to see my friends."
      },
      {
        "japanese": "近所のワンちゃんが朝までずっと吠えていたから、昨晩は陸に寝れなかった。",
        "english": "A dog in my neighborhood was barking until this morning so I barely got any sleep."
      },
      {
        "japanese": "豆なんて碌に食べないのに、うちには豆の缶詰がいっぱいある。",
        "english": "I have a lot of canned beans at home even though I hardly eat them."
      },
      {
        "japanese": "彼はケーキを焼くどころか、シンプルな料理さえ陸にできない。",
        "english": "Far from baking a cake, he can't even cook a simple meal properly. (hardly・not well)"
      },
      {
        "japanese": "毎日、うちの猫に起こされるせいで陸にねられない。",
        "english": "Every day I am woken up by my cat, so I can't sleep well. (hardly・not properly)"
      },
      {
        "japanese": "英語を陸にしらないのに父が外国人のカップルに道を教えようとした。",
        "english": "Despite barely knowing any English, dad tried to give directions to a foreign couple. (hardly・not well/properly)"
      },
      {
        "japanese": "陸に準備もしていないのに、ショップをオープンさせた。",
        "english": "Even though we had barely prepared, I had them open the shop. (hardly・not well/properly)"
      },
      {
        "japanese": "陸に稽古もせずステージに出て、悲惨なことになった。",
        "english": "I went on stage, not having properly prepared, and it was a disaster. (hardly/barely・not well)"
      }
    ],
    "url": "https://bunpro.jp/grammar_points/陸に-ない",
    "false_friends": [
      {
        "term": "めったに〜ない",
        "meaning": "Hardly, Rarely, Seldom",
        "kind": "synonym"
      }
    ],
    "source": "resources/grammar/files/bunpro-fixed-yaml-all/create-bunpro-fixed-yaml-all-920"
  }
}